[Killed] BlockStatement
src/lib/server/crypto.ts:28:24
  * @returns The SHA-256 digest of `ENCRYPTION_KEY`.
  * @throws Error If `ENCRYPTION_KEY` is not configured.
  */
-function key(): Buffer {
-	if (!env.ENCRYPTION_KEY) throw new Error('ENCRYPTION_KEY is required');
-	return createHash('sha256').update(env.ENCRYPTION_KEY).digest();
-}
+function key(): Buffer {}
 
 /**
killedBy: read returns null for an unknown state
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Killed] ConditionalExpression
src/lib/server/crypto.ts:29:6
  * @throws Error If `ENCRYPTION_KEY` is not configured.
  */
 function key(): Buffer {
-	if (!env.ENCRYPTION_KEY) throw new Error('ENCRYPTION_KEY is required');
+	if (false) throw new Error('ENCRYPTION_KEY is required');
 	return createHash('sha256').update(env.ENCRYPTION_KEY).digest();
 }
killedBy: encrypt fails loudly with the exact error when ENCRYPTION_KEY is not configured
statusReason: expected [Function] to throw error matching /^ENCRYPTION_KEY is required$/ but got 'The "data" argument must be of type s…'

[Killed] BooleanLiteral
src/lib/server/crypto.ts:29:6
  * @throws Error If `ENCRYPTION_KEY` is not configured.
  */
 function key(): Buffer {
-	if (!env.ENCRYPTION_KEY) throw new Error('ENCRYPTION_KEY is required');
+	if (env.ENCRYPTION_KEY) throw new Error('ENCRYPTION_KEY is required');
 	return createHash('sha256').update(env.ENCRYPTION_KEY).digest();
 }
killedBy: read returns null for an unknown state
statusReason: ENCRYPTION_KEY is required

[Killed] ArrayDeclaration
src/lib/server/crypto.ts:43:28
 	const iv = randomBytes(12);
 	const cipher = createCipheriv('aes-256-gcm', key(), iv);
-	const enc = Buffer.concat([cipher.update(plaintext, 'utf8'), cipher.final()]);
+	const enc = Buffer.concat([]);
 	const tag = cipher.getAuthTag();
 	return Buffer.concat([iv, tag, enc]).toString('base64');
killedBy: read returns null for an unknown state
statusReason: Invalid state for operation getAuthTag

[Killed] StringLiteral
src/lib/server/crypto.ts:45:48
 	const enc = Buffer.concat([cipher.update(plaintext, 'utf8'), cipher.final()]);
 	const tag = cipher.getAuthTag();
-	return Buffer.concat([iv, tag, enc]).toString('base64');
+	return Buffer.concat([iv, tag, enc]).toString("");
 }
 
killedBy: read returns null for an unknown state
statusReason: Unknown encoding:

[Killed] BlockStatement
src/lib/server/crypto.ts:54:50
  * @param payload - The Base64-encoded initialization vector, authentication tag, and ciphertext.
  * @returns The decrypted UTF-8 plaintext.
  */
-export function decrypt(payload: string): string {
-	const buf = Buffer.from(payload, 'base64');
-	const iv = buf.subarray(0, 12);
-	const tag = buf.subarray(12, 28);
-	const enc = buf.subarray(28);
-	// Stryker disable next-line ObjectLiteral: aes-256-gcm's default authTagLength is 16, so {} is identical to { authTagLength: 16 } (verified: decrypt succeeds with {} and a 16-byte tag).
-	const decipher = createDecipheriv('aes-256-gcm', key(), iv, { authTagLength: 16 });
-	decipher.setAuthTag(tag);
-	return Buffer.concat([decipher.update(enc), decipher.final()]).toString('utf8');
-}
+export function decrypt(payload: string): string {}
 
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] ArrayDeclaration
src/lib/server/crypto.ts:62:23
 	// Stryker disable next-line ObjectLiteral: aes-256-gcm's default authTagLength is 16, so {} is identical to { authTagLength: 16 } (verified: decrypt succeeds with {} and a 16-byte tag).
 	const decipher = createDecipheriv('aes-256-gcm', key(), iv, { authTagLength: 16 });
 	decipher.setAuthTag(tag);
-	return Buffer.concat([decipher.update(enc), decipher.final()]).toString('utf8');
+	return Buffer.concat([]).toString('utf8');
 }
 
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }
