[Killed] BlockStatement
src/lib/consentText.ts:39:68
  * character. Fails loudly when a document title is absent — the sentence and
  * its links are a legal artifact and must never silently degrade.
  */
-export function segmentConsentText(text: string): ConsentSegment[] {
-	const segments: ConsentSegment[] = [];
-	let rest = text;
-	for (const doc of CONSENT_DOC_LINKS) {
-		const at = rest.indexOf(doc.title);
-		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
-		if (at > 0) segments.push({ text: rest.slice(0, at) });
-		segments.push({ text: doc.title, href: doc.href });
-		rest = rest.slice(at + doc.title.length);
-	}
-	if (rest) segments.push({ text: rest });
-	return segments;
-}
+export function segmentConsentText(text: string): ConsentSegment[] {}
 
killedBy: page states: the rendered sentence equals the logged text exactly, docs are linked, errors are announced
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/lib/consentText.ts:42:39
 export function segmentConsentText(text: string): ConsentSegment[] {
 	const segments: ConsentSegment[] = [];
 	let rest = text;
-	for (const doc of CONSENT_DOC_LINKS) {
-		const at = rest.indexOf(doc.title);
-		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
-		if (at > 0) segments.push({ text: rest.slice(0, at) });
-		segments.push({ text: doc.title, href: doc.href });
-		rest = rest.slice(at + doc.title.length);
-	}
+	for (const doc of CONSENT_DOC_LINKS) {}
 	if (rest) segments.push({ text: rest });
 	return segments;
killedBy: page states: the rendered sentence equals the logged text exactly, docs are linked, errors are announced
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/lib/consentText.ts:44:7
 	let rest = text;
 	for (const doc of CONSENT_DOC_LINKS) {
 		const at = rest.indexOf(doc.title);
-		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
+		if (false) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
 		if (at > 0) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
killedBy: segmentConsentText fails loudly when the sentence is missing the 'Terms of Service' link target
statusReason: expected [Function] to throw an error

[Killed] UnaryOperator
src/lib/consentText.ts:44:14
 	let rest = text;
 	for (const doc of CONSENT_DOC_LINKS) {
 		const at = rest.indexOf(doc.title);
-		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
+		if (at === +1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
 		if (at > 0) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
killedBy: segmentConsentText fails loudly when the sentence is missing the 'Terms of Service' link target
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/consentText.ts:45:7
 	for (const doc of CONSENT_DOC_LINKS) {
 		const at = rest.indexOf(doc.title);
 		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
-		if (at > 0) segments.push({ text: rest.slice(0, at) });
+		if (at >= 0) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
 		rest = rest.slice(at + doc.title.length);
killedBy: segmentConsentText emits no empty leading text segment when the sentence starts with a document title
statusReason: expected [ { text: '' }, …(6) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/lib/consentText.ts:45:7
 	for (const doc of CONSENT_DOC_LINKS) {
 		const at = rest.indexOf(doc.title);
 		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
-		if (at > 0) segments.push({ text: rest.slice(0, at) });
+		if (false) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
 		rest = rest.slice(at + doc.title.length);
killedBy: segmentConsentText splits the real consent sentence into exact text and link segments
statusReason: expected [ …(3) ] to deeply equal [ …(6) ]

[Killed] ArithmeticOperator
src/lib/consentText.ts:47:21
 		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
 		if (at > 0) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
-		rest = rest.slice(at + doc.title.length);
+		rest = rest.slice(at - doc.title.length);
 	}
 	if (rest) segments.push({ text: rest });
killedBy: segmentConsentText splits the real consent sentence into exact text and link segments
statusReason: expected [ …(7) ] to deeply equal [ …(6) ]

[Killed] MethodExpression
src/lib/consentText.ts:47:10
 		if (at === -1) throw new Error(`consent sentence is missing the "${doc.title}" link target`);
 		if (at > 0) segments.push({ text: rest.slice(0, at) });
 		segments.push({ text: doc.title, href: doc.href });
-		rest = rest.slice(at + doc.title.length);
+		rest = rest;
 	}
 	if (rest) segments.push({ text: rest });
killedBy: segmentConsentText splits the real consent sentence into exact text and link segments
statusReason: expected [ …(7) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/lib/consentText.ts:49:6
 		segments.push({ text: doc.title, href: doc.href });
 		rest = rest.slice(at + doc.title.length);
 	}
-	if (rest) segments.push({ text: rest });
+	if (false) segments.push({ text: rest });
 	return segments;
 }
killedBy: segmentConsentText preserves every character of the input across the segments
statusReason: expected 'Agree to the Terms of Service and Pri…' to be 'Agree to the Terms of Service and Pri…' // Object.is equality

[Killed] ConditionalExpression
src/lib/consentText.ts:49:6
 		segments.push({ text: doc.title, href: doc.href });
 		rest = rest.slice(at + doc.title.length);
 	}
-	if (rest) segments.push({ text: rest });
+	if (true) segments.push({ text: rest });
 	return segments;
 }
killedBy: segmentConsentText splits the real consent sentence into exact text and link segments
statusReason: expected [ …(7) ] to deeply equal [ …(6) ]
