[Killed] BooleanLiteral
google/login/callback/+server.ts:39:16
 export async function GET({ url, cookies }: { url: URL; cookies: import('@sveltejs/kit').Cookies }) {
 	const state = url.searchParams.get('state');
 	const pending = readPendingStates(cookies);
-	if (!state || !pending.includes(state)) throw error(400, 'bad state');
+	if (!state || pending.includes(state)) throw error(400, 'bad state');
 
 	const code = url.searchParams.get('code');
killedBy: callback rejects a missing or mismatched state with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:39:6
 export async function GET({ url, cookies }: { url: URL; cookies: import('@sveltejs/kit').Cookies }) {
 	const state = url.searchParams.get('state');
 	const pending = readPendingStates(cookies);
-	if (!state || !pending.includes(state)) throw error(400, 'bad state');
+	if (false) throw error(400, 'bad state');
 
 	const code = url.searchParams.get('code');
killedBy: callback rejects a missing or mismatched state with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:42:6
 	if (!state || !pending.includes(state)) throw error(400, 'bad state');
 
 	const code = url.searchParams.get('code');
-	if (!code) throw error(400, 'missing code');
+	if (true) throw error(400, 'missing code');
 
 	const tokens = await exchangeGoogleCode(
killedBy: callback returns 502 when the token exchange fails upstream
statusReason: expected { Object (status, body) } to match object { status: 502, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:42:6
 	if (!state || !pending.includes(state)) throw error(400, 'bad state');
 
 	const code = url.searchParams.get('code');
-	if (!code) throw error(400, 'missing code');
+	if (false) throw error(400, 'missing code');
 
 	const tokens = await exchangeGoogleCode(
killedBy: callback rejects a missing code with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] StringLiteral
google/login/callback/+server.ts:47:3
 	const tokens = await exchangeGoogleCode(
 		code,
 		'/api/auth/google/login/callback',
-		'google login token exchange',
+		"",
 		'Google sign-in failed — please retry'
 	);
killedBy: callback returns 502 when the token exchange fails upstream
statusReason: expected ' failed: 400 invalid_grant' to contain 'google login token exchange'

[Killed] BlockStatement
google/login/callback/+server.ts:53:6
 
 	let infoRes: Response;
 	let infoText: string;
-	try {
-		infoRes = await fetch('https://openidconnect.googleapis.com/v1/userinfo', {
-			headers: { Authorization: `Bearer ${tokens.accessToken}` },
-			signal: AbortSignal.timeout(10_000)
-		});
-		infoText = await infoRes.text();
-	} catch (e) {
+	try {} catch (e) {
 		console.error(`google userinfo request failed: ${e instanceof Error ? e.message : e}`);
 		throw error(502, 'Google sign-in failed — please retry');
killedBy: callback authorizes the userinfo lookup with the exchanged access token
statusReason: userinfo lookup must be called: expected undefined to be defined

[Killed] ObjectLiteral
google/login/callback/+server.ts:54:77
 	let infoRes: Response;
 	let infoText: string;
 	try {
-		infoRes = await fetch('https://openidconnect.googleapis.com/v1/userinfo', {
-			headers: { Authorization: `Bearer ${tokens.accessToken}` },
-			signal: AbortSignal.timeout(10_000)
-		});
+		infoRes = await fetch('https://openidconnect.googleapis.com/v1/userinfo', {});
 		infoText = await infoRes.text();
 	} catch (e) {
killedBy: callback authorizes the userinfo lookup with the exchanged access token
statusReason: Cannot read properties of undefined (reading 'Authorization')

[Killed] ObjectLiteral
google/login/callback/+server.ts:55:13
 	let infoText: string;
 	try {
 		infoRes = await fetch('https://openidconnect.googleapis.com/v1/userinfo', {
-			headers: { Authorization: `Bearer ${tokens.accessToken}` },
+			headers: {},
 			signal: AbortSignal.timeout(10_000)
 		});
killedBy: callback authorizes the userinfo lookup with the exchanged access token
statusReason: expected undefined to be 'Bearer google-access-token' // Object.is equality

[Killed] BlockStatement
google/login/callback/+server.ts:59:14
 			signal: AbortSignal.timeout(10_000)
 		});
 		infoText = await infoRes.text();
-	} catch (e) {
-		console.error(`google userinfo request failed: ${e instanceof Error ? e.message : e}`);
-		throw error(502, 'Google sign-in failed — please retry');
-	}
+	} catch (e) {}
 	if (!infoRes.ok) {
 		console.error(`google userinfo lookup failed: ${infoRes.status}`);
killedBy: callback returns 502 when the userinfo request itself fails
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 502, …(1) }

[Killed] StringLiteral
google/login/callback/+server.ts:61:20
 		infoText = await infoRes.text();
 	} catch (e) {
 		console.error(`google userinfo request failed: ${e instanceof Error ? e.message : e}`);
-		throw error(502, 'Google sign-in failed — please retry');
+		throw error(502, "");
 	}
 	if (!infoRes.ok) {
killedBy: callback returns 502 when the userinfo request itself fails
statusReason: expected { Object (status, body) } to match object { status: 502, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:63:6
 		console.error(`google userinfo request failed: ${e instanceof Error ? e.message : e}`);
 		throw error(502, 'Google sign-in failed — please retry');
 	}
-	if (!infoRes.ok) {
+	if (true) {
 		console.error(`google userinfo lookup failed: ${infoRes.status}`);
 		throw error(502, 'Google sign-in failed — please retry');
killedBy: callback returns 502 when the userinfo body is not valid JSON
statusReason: expected { Object (status, body) } to match object { status: 502, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:63:6
 		console.error(`google userinfo request failed: ${e instanceof Error ? e.message : e}`);
 		throw error(502, 'Google sign-in failed — please retry');
 	}
-	if (!infoRes.ok) {
+	if (false) {
 		console.error(`google userinfo lookup failed: ${infoRes.status}`);
 		throw error(502, 'Google sign-in failed — please retry');
killedBy: callback rejects a non-OK userinfo response even when its body is valid JSON
statusReason: expected Redirect{ status: 302, …(1) } to match object { status: 502, …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
google/login/callback/+server.ts:68:6
 		throw error(502, 'Google sign-in failed — please retry');
 	}
 	let info: { sub?: unknown; email?: unknown; name?: unknown };
-	try {
-		info = JSON.parse(infoText) as typeof info;
-	} catch {
+	try {} catch {
 		console.error(`google userinfo returned invalid JSON: ${infoRes.status}`);
 		throw error(502, 'invalid response from Google — please retry');
killedBy: callback returns 502 when the userinfo body is not valid JSON
statusReason: expected 'google userinfo returned no usable su…' to contain 'google userinfo returned invalid JSON'

[Killed] BlockStatement
google/login/callback/+server.ts:70:10
 	let info: { sub?: unknown; email?: unknown; name?: unknown };
 	try {
 		info = JSON.parse(infoText) as typeof info;
-	} catch {
-		console.error(`google userinfo returned invalid JSON: ${infoRes.status}`);
-		throw error(502, 'invalid response from Google — please retry');
-	}
+	} catch {}
 	// I2: identity claims are validated at the boundary; no sub, no sign-in.
killedBy: callback returns 502 when the userinfo body is not valid JSON
statusReason: expected 'google userinfo returned no usable su…' to contain 'google userinfo returned invalid JSON'

[Killed] StringLiteral
google/login/callback/+server.ts:72:20
 		info = JSON.parse(infoText) as typeof info;
 	} catch {
 		console.error(`google userinfo returned invalid JSON: ${infoRes.status}`);
-		throw error(502, 'invalid response from Google — please retry');
+		throw error(502, "");
 	}
 	// I2: identity claims are validated at the boundary; no sub, no sign-in.
killedBy: callback returns 502 when the userinfo body is not valid JSON
statusReason: expected { Object (status, body) } to match object { status: 502, …(1) }

[Killed] EqualityOperator
google/login/callback/+server.ts:76:34
 	}
 	// I2: identity claims are validated at the boundary; no sub, no sign-in.
-	if (typeof info !== 'object' || info === null || typeof info.sub !== 'string' || !info.sub) {
+	if (typeof info !== 'object' || info !== null || typeof info.sub !== 'string' || !info.sub) {
 		console.error('google userinfo returned no usable sub claim');
 		throw error(502, 'invalid response from Google — please retry');
killedBy: callback returns 502 when the userinfo JSON is null
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 502, …(1) }

[Killed] LogicalOperator
google/login/callback/+server.ts:76:6
 	}
 	// I2: identity claims are validated at the boundary; no sub, no sign-in.
-	if (typeof info !== 'object' || info === null || typeof info.sub !== 'string' || !info.sub) {
+	if ((typeof info !== 'object' || info === null || typeof info.sub !== 'string') && !info.sub) {
 		console.error('google userinfo returned no usable sub claim');
 		throw error(502, 'invalid response from Google — please retry');
killedBy: callback returns 502 when the userinfo JSON is null
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 502, …(1) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:80:16
 		console.error('google userinfo returned no usable sub claim');
 		throw error(502, 'invalid response from Google — please retry');
 	}
-	const email = typeof info.email === 'string' && info.email ? info.email : `${info.sub}@accounts.google.com`;
+	const email = true ? info.email : `${info.sub}@accounts.google.com`;
 	const displayName = typeof info.name === 'string' && info.name ? info.name : email;
 	const sub: string = info.sub;
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:80:16
 		console.error('google userinfo returned no usable sub claim');
 		throw error(502, 'invalid response from Google — please retry');
 	}
-	const email = typeof info.email === 'string' && info.email ? info.email : `${info.sub}@accounts.google.com`;
+	const email = true && info.email ? info.email : `${info.sub}@accounts.google.com`;
 	const displayName = typeof info.name === 'string' && info.name ? info.name : email;
 	const sub: string = info.sub;
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('non-string')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] LogicalOperator
google/login/callback/+server.ts:81:22
 		throw error(502, 'invalid response from Google — please retry');
 	}
 	const email = typeof info.email === 'string' && info.email ? info.email : `${info.sub}@accounts.google.com`;
-	const displayName = typeof info.name === 'string' && info.name ? info.name : email;
+	const displayName = typeof info.name === 'string' || info.name ? info.name : email;
 	const sub: string = info.sub;
 
killedBy: callback falls back to the email as display name when Google sends no usable name ('empty')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
google/login/callback/+server.ts:81:22
 		throw error(502, 'invalid response from Google — please retry');
 	}
 	const email = typeof info.email === 'string' && info.email ? info.email : `${info.sub}@accounts.google.com`;
-	const displayName = typeof info.name === 'string' && info.name ? info.name : email;
+	const displayName = true ? info.name : email;
 	const sub: string = info.sub;
 
killedBy: callback falls back to the email as display name when Google sends no usable name ('missing')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] BlockStatement
google/login/callback/+server.ts:90:13
 	// its latest consent covers the current LEGAL_VERSION; a stale or missing
 	// consent sends it back through /consent (re-acceptance on doc updates).
 	const user = await db.select().from(users).where(eq(users.googleSub, sub)).get();
-	if (!user) {
-		parkPendingConsent(cookies, state, { kind: 'new', sub, email, displayName });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
-		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
-	}
+	if (!user) {}
 	const consent = await hasCurrentConsent(user.id);
 	if (!consent) {
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 302 }

[Killed] ConditionalExpression
google/login/callback/+server.ts:90:6
 	// its latest consent covers the current LEGAL_VERSION; a stale or missing
 	// consent sends it back through /consent (re-acceptance on doc updates).
 	const user = await db.select().from(users).where(eq(users.googleSub, sub)).get();
-	if (!user) {
+	if (false) {
 		parkPendingConsent(cookies, state, { kind: 'new', sub, email, displayName });
 		storePendingStates(cookies, pending.filter((s) => s !== state));
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 302 }

[Killed] EqualityOperator
google/login/callback/+server.ts:92:53
 	const user = await db.select().from(users).where(eq(users.googleSub, sub)).get();
 	if (!user) {
 		parkPendingConsent(cookies, state, { kind: 'new', sub, email, displayName });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
+		storePendingStates(cookies, pending.filter((s) => s === state));
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
killedBy: callback with a new identity parks a pending consent and redirects to /consent without creating anything
statusReason: expected '["s"]' to be undefined

[Killed] ArrowFunction
google/login/callback/+server.ts:92:46
 	const user = await db.select().from(users).where(eq(users.googleSub, sub)).get();
 	if (!user) {
 		parkPendingConsent(cookies, state, { kind: 'new', sub, email, displayName });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
+		storePendingStates(cookies, pending.filter(() => undefined));
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
killedBy: a new-identity sign-in consumes only its own state, leaving other tabs valid
statusReason: expected null to deeply equal [ 'other-tab' ]

[Killed] BlockStatement
google/login/callback/+server.ts:96:16
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
 	const consent = await hasCurrentConsent(user.id);
-	if (!consent) {
-		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
-		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
-	}
+	if (!consent) {}
 
 	const { token, expiresAt } = await createSession(user.id);
killedBy: callback with an existing user on a stale document version sends them back through /consent
statusReason: expected '/dashboard' to be '/consent?state=s' // Object.is equality

[Killed] BooleanLiteral
google/login/callback/+server.ts:96:6
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
 	const consent = await hasCurrentConsent(user.id);
-	if (!consent) {
+	if (consent) {
 		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
 		storePendingStates(cookies, pending.filter((s) => s !== state));
killedBy: callback with a consented existing user creates a session and redirects to the dashboard
statusReason: expected '/consent?state=s' to be '/dashboard' // Object.is equality

[Killed] StringLiteral
google/login/callback/+server.ts:97:46
 	}
 	const consent = await hasCurrentConsent(user.id);
 	if (!consent) {
-		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
+		parkPendingConsent(cookies, state, { kind: "", userId: user.id });
 		storePendingStates(cookies, pending.filter((s) => s !== state));
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
killedBy: callback with an existing user on a stale document version sends them back through /consent
statusReason: expected null to deeply equal { kind: 'existing', …(1) }

[Killed] ObjectLiteral
google/login/callback/+server.ts:97:38
 	}
 	const consent = await hasCurrentConsent(user.id);
 	if (!consent) {
-		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
+		parkPendingConsent(cookies, state, {});
 		storePendingStates(cookies, pending.filter((s) => s !== state));
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
killedBy: callback with an existing user on a stale document version sends them back through /consent
statusReason: expected null to deeply equal { kind: 'existing', …(1) }

[Killed] ArrowFunction
google/login/callback/+server.ts:98:46
 	const consent = await hasCurrentConsent(user.id);
 	if (!consent) {
 		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
+		storePendingStates(cookies, pending.filter(() => undefined));
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
killedBy: a stale-consent sign-in consumes only its own state, leaving other tabs valid
statusReason: expected null to deeply equal [ 'other-tab' ]

[Killed] MethodExpression
google/login/callback/+server.ts:98:31
 	const consent = await hasCurrentConsent(user.id);
 	if (!consent) {
 		parkPendingConsent(cookies, state, { kind: 'existing', userId: user.id });
-		storePendingStates(cookies, pending.filter((s) => s !== state));
+		storePendingStates(cookies, pending);
 		throw redirect(302, `/consent?state=${encodeURIComponent(state)}`);
 	}
killedBy: a stale-consent sign-in consumes only its own state, leaving other tabs valid
statusReason: expected [ 'other-tab', 's' ] to deeply equal [ 'other-tab' ]

[Killed] StringLiteral
google/login/callback/+server.ts:104:9
 
 	const { token, expiresAt } = await createSession(user.id);
 	cookies.set(SESSION_COOKIE, token, {
-		path: '/',
+		path: "",
 		httpOnly: true,
 		sameSite: 'lax',
killedBy: callback with a consented existing user creates a session and redirects to the dashboard
statusReason: expected { path: '', httpOnly: true, …(3) } to match object { httpOnly: true, …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
google/login/callback/+server.ts:113:52
 
 	// Consume the state only once the flow has succeeded, so a transient
 	// failure leaves the callback retryable while a success cannot be replayed.
-	storePendingStates(cookies, pending.filter((s) => s !== state));
+	storePendingStates(cookies, pending.filter((s) => true));
 
 	throw redirect(302, '/dashboard');
killedBy: callback with a consented existing user creates a session and redirects to the dashboard
statusReason: expected '["s"]' to be undefined

[Killed] EqualityOperator
google/login/callback/+server.ts:113:52
 
 	// Consume the state only once the flow has succeeded, so a transient
 	// failure leaves the callback retryable while a success cannot be replayed.
-	storePendingStates(cookies, pending.filter((s) => s !== state));
+	storePendingStates(cookies, pending.filter((s) => s === state));
 
 	throw redirect(302, '/dashboard');
killedBy: callback with a consented existing user creates a session and redirects to the dashboard
statusReason: expected '["s"]' to be undefined
