[Killed] BlockStatement
src/lib/landing/queue-script.ts:68:54
 }));
 
 /** A comment lands in the queue. */
-export function applyArrival(counts: Counts): Counts {
-	return { ...counts, incoming: counts.incoming + 1 };
-}
+export function applyArrival(counts: Counts): Counts {}
 
 /**
killedBy: Bonk Queue counter logic every arrival increments incoming and nothing else
statusReason: Cannot read properties of undefined (reading 'incoming')

[Killed] ArithmeticOperator
src/lib/landing/queue-script.ts:69:32
 
 /** A comment lands in the queue. */
 export function applyArrival(counts: Counts): Counts {
-	return { ...counts, incoming: counts.incoming + 1 };
+	return { ...counts, incoming: counts.incoming - 1 };
 }
 
killedBy: Bonk Queue counter logic every arrival increments incoming and nothing else
statusReason: expected 38 to be 40 // Object.is equality

[Killed] BlockStatement
src/lib/landing/queue-script.ts:78:72
  * creator's pile, so yours +1 on top. That closes the books on the
  * illustrative night: incoming 47 = actioned 41 + yours 6.
  */
-export function applyVerdict(counts: Counts, verdict: Verdict): Counts {
-	if (verdict === 'HELD') return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
-	return { ...counts, actioned: counts.actioned + 1 };
-}
+export function applyVerdict(counts: Counts, verdict: Verdict): Counts {}
 
 /**
killedBy: Bonk Queue counter logic BANNED increments actioned and leaves the human pile alone
statusReason: Cannot read properties of undefined (reading 'actioned')

[Killed] ConditionalExpression
src/lib/landing/queue-script.ts:79:6
  * illustrative night: incoming 47 = actioned 41 + yours 6.
  */
 export function applyVerdict(counts: Counts, verdict: Verdict): Counts {
-	if (verdict === 'HELD') return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
+	if (false) return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
 	return { ...counts, actioned: counts.actioned + 1 };
 }
killedBy: Bonk Queue counter logic HELD goes to the human: yours +1 on top of the tool action
statusReason: expected 4 to be 5 // Object.is equality

[Killed] EqualityOperator
src/lib/landing/queue-script.ts:79:6
  * illustrative night: incoming 47 = actioned 41 + yours 6.
  */
 export function applyVerdict(counts: Counts, verdict: Verdict): Counts {
-	if (verdict === 'HELD') return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
+	if (verdict !== 'HELD') return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
 	return { ...counts, actioned: counts.actioned + 1 };
 }
killedBy: Bonk Queue counter logic BANNED increments actioned and leaves the human pile alone
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ArithmeticOperator
src/lib/landing/queue-script.ts:80:32
  */
 export function applyVerdict(counts: Counts, verdict: Verdict): Counts {
 	if (verdict === 'HELD') return { ...counts, actioned: counts.actioned + 1, yours: counts.yours + 1 };
-	return { ...counts, actioned: counts.actioned + 1 };
+	return { ...counts, actioned: counts.actioned - 1 };
 }
 
killedBy: Bonk Queue counter logic BANNED increments actioned and leaves the human pile alone
statusReason: expected 32 to be 34 // Object.is equality

[Killed] BlockStatement
src/lib/landing/queue-script.ts:88:75
  * never empty. The live loop resets to INITIAL_COUNTS and starts over when
  * JS runs with motion allowed.
  */
-export function initialQueueState(): { rows: QueueRow[]; counts: Counts } {
-	return {
-		// Stryker disable next-line UnaryOperator: SCRIPT has exactly 8 entries, so slice(+4) and slice(-4) return the identical tail rows — the mutant is equivalent while the 8-entry script stands.
-		rows: SCRIPT.slice(-4).map((item, i) => ({ key: i, item, state: 'settled' })),
-		counts: FINAL_COUNTS
-	};
-}
+export function initialQueueState(): { rows: QueueRow[]; counts: Counts } {}
 
killedBy: Bonk Queue counter logic the SSR/no-JS state is the completed night: settled tail rows and final counts
statusReason: Cannot read properties of undefined (reading 'counts')

[Killed] MethodExpression
src/lib/landing/queue-script.ts:91:9
 export function initialQueueState(): { rows: QueueRow[]; counts: Counts } {
 	return {
 		// Stryker disable next-line UnaryOperator: SCRIPT has exactly 8 entries, so slice(+4) and slice(-4) return the identical tail rows — the mutant is equivalent while the 8-entry script stands.
-		rows: SCRIPT.slice(-4).map((item, i) => ({ key: i, item, state: 'settled' })),
+		rows: SCRIPT.map((item, i) => ({ key: i, item, state: 'settled' })),
 		counts: FINAL_COUNTS
 	};
killedBy: Bonk Queue counter logic the SSR/no-JS state is the completed night: settled tail rows and final counts
statusReason: expected [ …(8) ] to have a length of 4 but got 8

[Killed] ArrowFunction
src/lib/landing/queue-script.ts:91:30
 export function initialQueueState(): { rows: QueueRow[]; counts: Counts } {
 	return {
 		// Stryker disable next-line UnaryOperator: SCRIPT has exactly 8 entries, so slice(+4) and slice(-4) return the identical tail rows — the mutant is equivalent while the 8-entry script stands.
-		rows: SCRIPT.slice(-4).map((item, i) => ({ key: i, item, state: 'settled' })),
+		rows: SCRIPT.slice(-4).map(() => undefined),
 		counts: FINAL_COUNTS
 	};
killedBy: Bonk Queue counter logic the SSR/no-JS state is the completed night: settled tail rows and final counts
statusReason: Cannot read properties of undefined (reading 'item')
