[Killed] BooleanLiteral
routes/api/cron/+server.ts:141:10
 		const message = cause instanceof Error ? cause.message : String(cause);
 		console.error(`channel run ${channel.id} failed:`, cause);
 		return json(
-			{ ok: false, dryRun, consentEmailsNulled, sweepError, results: { [channel.id]: { error: message } } },
+			{ ok: true, dryRun, consentEmailsNulled, sweepError, results: { [channel.id]: { error: message } } },
 			{ status: 500 } // failure must not look like success to the cron caller
 		);
killedBy: a failing channel run reports failure, never success
statusReason: expected { ok: true, dryRun: true, …(3) } to match object { ok: false, results: { …(1) } }
(3 matching properties omitted from actual)

[Killed] ObjectLiteral
routes/api/cron/+server.ts:141:67
 		const message = cause instanceof Error ? cause.message : String(cause);
 		console.error(`channel run ${channel.id} failed:`, cause);
 		return json(
-			{ ok: false, dryRun, consentEmailsNulled, sweepError, results: { [channel.id]: { error: message } } },
+			{ ok: false, dryRun, consentEmailsNulled, sweepError, results: {} },
 			{ status: 500 } // failure must not look like success to the cron caller
 		);
killedBy: a failing channel run reports failure, never success
statusReason: expected { ok: false, dryRun: true, …(3) } to match object { ok: false, results: { …(1) } }
(3 matching properties omitted from actual)

[Killed] BlockStatement
routes/api/cron/+server.ts:144:12
 			{ ok: false, dryRun, consentEmailsNulled, sweepError, results: { [channel.id]: { error: message } } },
 			{ status: 500 } // failure must not look like success to the cron caller
 		);
-	} finally {
-		// Record the run even on failure so a failing channel cannot starve the others.
-		await db
-			.update(channels)
-			.set({ leaseExpiresAt: null, lastRunAt: nowIso })
-			.where(eq(channels.id, channel.id));
-	}
+	} finally {}
 };
 
killedBy: records the run afterwards: lastRunAt is set and the lease is cleared
statusReason: expected null not to be null
