[Killed] BlockStatement
src/lib/relative-time.ts:26:50
 const MONTH = 30 * DAY;
 const YEAR = 365 * DAY;
 
-function plural(n: number, unit: string): string {
-	return `${n} ${unit}${n === 1 ? '' : 's'} ago`;
-}
+function plural(n: number, unit: string): string {}
 
 /** Human "N units ago" rendering for ISO timestamps; falls back to the raw string if unparseable. */
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected undefined to be '1 minute ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:27:24
 const YEAR = 365 * DAY;
 
 function plural(n: number, unit: string): string {
-	return `${n} ${unit}${n === 1 ? '' : 's'} ago`;
+	return `${n} ${unit}${true ? '' : 's'} ago`;
 }
 
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '2 hour ago' to be '2 hours ago' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:27:24
 const YEAR = 365 * DAY;
 
 function plural(n: number, unit: string): string {
-	return `${n} ${unit}${n === 1 ? '' : 's'} ago`;
+	return `${n} ${unit}${n !== 1 ? '' : 's'} ago`;
 }
 
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '1 minutes ago' to be '1 minute ago' // Object.is equality

[Killed] BlockStatement
src/lib/relative-time.ts:31:75
 }
 
 /** Human "N units ago" rendering for ISO timestamps; falls back to the raw string if unparseable. */
-export function relativeTime(iso: string, now: Date = new Date()): string {
-	const then = new Date(iso).getTime();
-	if (Number.isNaN(then)) return iso;
-	const diff = now.getTime() - then;
-	if (diff < MINUTE) return 'just now';
-	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
-	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
-	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
-	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
-	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
-	return plural(Math.floor(diff / YEAR), 'year');
-}
+export function relativeTime(iso: string, now: Date = new Date()): string {}
 
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected undefined to be 'just now' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:33:6
 /** Human "N units ago" rendering for ISO timestamps; falls back to the raw string if unparseable. */
 export function relativeTime(iso: string, now: Date = new Date()): string {
 	const then = new Date(iso).getTime();
-	if (Number.isNaN(then)) return iso;
+	if (true) return iso;
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '2026-07-30T11:59:40Z' to be 'just now' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:33:6
 /** Human "N units ago" rendering for ISO timestamps; falls back to the raw string if unparseable. */
 export function relativeTime(iso: string, now: Date = new Date()): string {
 	const then = new Date(iso).getTime();
-	if (Number.isNaN(then)) return iso;
+	if (false) return iso;
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
killedBy: relativeTime returns unparseable input unchanged instead of crashing
statusReason: expected 'NaN years ago' to be 'not-a-date' // Object.is equality

[Killed] ArithmeticOperator
src/lib/relative-time.ts:34:15
 export function relativeTime(iso: string, now: Date = new Date()): string {
 	const then = new Date(iso).getTime();
 	if (Number.isNaN(then)) return iso;
-	const diff = now.getTime() - then;
+	const diff = now.getTime() + then;
 	if (diff < MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '113 years ago' to be 'just now' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:35:6
 	const then = new Date(iso).getTime();
 	if (Number.isNaN(then)) return iso;
 	const diff = now.getTime() - then;
-	if (diff < MINUTE) return 'just now';
+	if (diff >= MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '0 minutes ago' to be 'just now' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:35:6
 	const then = new Date(iso).getTime();
 	if (Number.isNaN(then)) return iso;
 	const diff = now.getTime() - then;
-	if (diff < MINUTE) return 'just now';
+	if (diff <= MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected 'just now' to be '1 minute ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:36:6
 	if (Number.isNaN(then)) return iso;
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
-	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
+	if (true) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '120 minutes ago' to be '2 hours ago' // Object.is equality

[Killed] ArithmeticOperator
src/lib/relative-time.ts:36:44
 	if (Number.isNaN(then)) return iso;
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
-	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
+	if (diff < HOUR) return plural(Math.floor(diff * MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '3600000000 minutes ago' to be '1 minute ago' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:37:6
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
-	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
+	if (diff <= DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '24 hours ago' to be '1 day ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:37:6
 	const diff = now.getTime() - then;
 	if (diff < MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
-	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
+	if (true) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '24 hours ago' to be '1 day ago' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:38:6
 	if (diff < MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
-	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
+	if (diff >= WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
 	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '0 weeks ago' to be '1 day ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:38:6
 	if (diff < MINUTE) return 'just now';
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
-	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
+	if (false) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
 	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '0 weeks ago' to be '1 day ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:39:6
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
-	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
+	if (false) return plural(Math.floor(diff / WEEK), 'week');
 	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
 	return plural(Math.floor(diff / YEAR), 'year');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '0 months ago' to be '2 weeks ago' // Object.is equality

[Killed] EqualityOperator
src/lib/relative-time.ts:39:6
 	if (diff < HOUR) return plural(Math.floor(diff / MINUTE), 'minute');
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
-	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
+	if (diff <= MONTH) return plural(Math.floor(diff / WEEK), 'week');
 	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
 	return plural(Math.floor(diff / YEAR), 'year');
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '4 weeks ago' to be '1 month ago' // Object.is equality

[Killed] ArithmeticOperator
src/lib/relative-time.ts:40:44
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
-	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
+	if (diff < YEAR) return plural(Math.floor(diff * MONTH), 'month');
 	return plural(Math.floor(diff / YEAR), 'year');
 }
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '6718464000000000000 months ago' to be '1 month ago' // Object.is equality

[Killed] ConditionalExpression
src/lib/relative-time.ts:40:6
 	if (diff < DAY) return plural(Math.floor(diff / HOUR), 'hour');
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
-	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
+	if (false) return plural(Math.floor(diff / MONTH), 'month');
 	return plural(Math.floor(diff / YEAR), 'year');
 }
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '0 years ago' to be '1 month ago' // Object.is equality

[Killed] ArithmeticOperator
src/lib/relative-time.ts:41:27
 	if (diff < WEEK) return plural(Math.floor(diff / DAY), 'day');
 	if (diff < MONTH) return plural(Math.floor(diff / WEEK), 'week');
 	if (diff < YEAR) return plural(Math.floor(diff / MONTH), 'month');
-	return plural(Math.floor(diff / YEAR), 'year');
+	return plural(Math.floor(diff * YEAR), 'year');
 }
 
killedBy: relativeTime renders each bucket with correct pluralization
statusReason: expected '994519296000000000000 years ago' to be '1 year ago' // Object.is equality
