[Killed] ConditionalExpression
src/hooks.server.ts:40:6
 	// database health itself, so it bypasses the migration guard and session
 	// resolution — either one would convert a database outage into a 500
 	// before the endpoint could answer with its documented 503.
-	if (event.url.pathname === '/api/health') return resolve(event);
+	if (false) return resolve(event);
 	// Deploy-ordering boundary (issue #81): if the database is behind the
 	// deployed code's migration journal, every DB query would fail with
killedBy: /api/health bypasses the guard and session so a database outage still reaches the probe
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] ConditionalExpression
src/hooks.server.ts:40:6
 	// database health itself, so it bypasses the migration guard and session
 	// resolution — either one would convert a database outage into a 500
 	// before the endpoint could answer with its documented 503.
-	if (event.url.pathname === '/api/health') return resolve(event);
+	if (true) return resolve(event);
 	// Deploy-ordering boundary (issue #81): if the database is behind the
 	// deployed code's migration journal, every DB query would fail with
killedBy: a database failure during session lookup degrades to maintenance mode, never a bare 500
statusReason: expected undefined to be null

[Killed] BlockStatement
src/hooks.server.ts:50:6
 	// The site-wide coupling is intentional: the public pages are prerendered
 	// and served statically (handle never runs for them), so every request that
 	// reaches this point is DB-backed and would fail downstream anyway.
-	try {
-		await assertMigrationsCurrent();
-	} catch (e) {
+	try {} catch (e) {
 		if (isHttpError(e)) throw e;
 		console.error('migration guard query failed:', e);
killedBy: a database behind the code fails the request with the guard 503 before any session work
statusReason: promise resolved "Response { status: 200, statusText: '', headers: Headers { 'content-type': 'text/plain;charset=UTF-8' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: true, redirected: false, type: 'default', url: '' }" instead of rejecting

[Killed] BlockStatement
src/hooks.server.ts:52:14
 	// reaches this point is DB-backed and would fail downstream anyway.
 	try {
 		await assertMigrationsCurrent();
-	} catch (e) {
-		if (isHttpError(e)) throw e;
-		console.error('migration guard query failed:', e);
-		event.locals.dbDown = true;
-		event.locals.user = null;
-		return resolve(event);
-	}
+	} catch (e) {}
 	const token = event.cookies.get(SESSION_COOKIE);
 	try {
killedBy: a database behind the code fails the request with the guard 503 before any session work
statusReason: promise resolved "Response { status: 200, statusText: '', headers: Headers { 'content-type': 'text/plain;charset=UTF-8' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: true, redirected: false, type: 'default', url: '' }" instead of rejecting

[Killed] ConditionalExpression
src/hooks.server.ts:53:7
 	try {
 		await assertMigrationsCurrent();
 	} catch (e) {
-		if (isHttpError(e)) throw e;
+		if (true) throw e;
 		console.error('migration guard query failed:', e);
 		event.locals.dbDown = true;
killedBy: a database failure inside the guard check degrades to maintenance mode, never a bare 500
statusReason: database is locked

[Killed] ConditionalExpression
src/hooks.server.ts:53:7
 	try {
 		await assertMigrationsCurrent();
 	} catch (e) {
-		if (isHttpError(e)) throw e;
+		if (false) throw e;
 		console.error('migration guard query failed:', e);
 		event.locals.dbDown = true;
killedBy: a database behind the code fails the request with the guard 503 before any session work
statusReason: promise resolved "Response { status: 200, statusText: '', headers: Headers { 'content-type': 'text/plain;charset=UTF-8' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: true, redirected: false, type: 'default', url: '' }" instead of rejecting

[Killed] StringLiteral
src/hooks.server.ts:54:17
 		await assertMigrationsCurrent();
 	} catch (e) {
 		if (isHttpError(e)) throw e;
-		console.error('migration guard query failed:', e);
+		console.error("", e);
 		event.locals.dbDown = true;
 		event.locals.user = null;
killedBy: a guard-check outage is logged with its identifiable message
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "migration guard query failed:",

[Killed] BooleanLiteral
src/hooks.server.ts:55:25
 	} catch (e) {
 		if (isHttpError(e)) throw e;
 		console.error('migration guard query failed:', e);
-		event.locals.dbDown = true;
+		event.locals.dbDown = false;
 		event.locals.user = null;
 		return resolve(event);
killedBy: a database failure inside the guard check degrades to maintenance mode, never a bare 500
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks.server.ts:60:6
 		return resolve(event);
 	}
 	const token = event.cookies.get(SESSION_COOKIE);
-	try {
-		const resolution = await getSessionUser(token);
-		event.locals.user = resolution?.user ?? null;
-		if (resolution?.renewed && token) {
-			event.cookies.set(SESSION_COOKIE, token, {
-				path: '/',
-				httpOnly: true,
-				sameSite: 'lax',
-				secure: cookieSecure(),
-				expires: new Date(resolution.expiresAt)
-			});
-		}
-	} catch (e) {
+	try {} catch (e) {
 		// A deliberate HttpError (e.g. the account-has-no-org integrity failure)
 		// is NOT an outage: let it fail loudly instead of masking it as
killedBy: a database failure during session lookup degrades to maintenance mode, never a bare 500
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/hooks.server.ts:62:23
 	const token = event.cookies.get(SESSION_COOKIE);
 	try {
 		const resolution = await getSessionUser(token);
-		event.locals.user = resolution?.user ?? null;
+		event.locals.user = resolution?.user && null;
 		if (resolution?.renewed && token) {
 			event.cookies.set(SESSION_COOKIE, token, {
killedBy: a resolved session user populates locals.user
statusReason: expected null to match object { id: 'user-1' }

[Killed] OptionalChaining
src/hooks.server.ts:62:23
 	const token = event.cookies.get(SESSION_COOKIE);
 	try {
 		const resolution = await getSessionUser(token);
-		event.locals.user = resolution?.user ?? null;
+		event.locals.user = resolution.user ?? null;
 		if (resolution?.renewed && token) {
 			event.cookies.set(SESSION_COOKIE, token, {
killedBy: no session resolves to signed-out without tripping the maintenance flag
statusReason: expected true to be undefined

[Killed] ConditionalExpression
src/hooks.server.ts:63:7
 	try {
 		const resolution = await getSessionUser(token);
 		event.locals.user = resolution?.user ?? null;
-		if (resolution?.renewed && token) {
+		if (true) {
 			event.cookies.set(SESSION_COOKIE, token, {
 				path: '/',
killedBy: no session resolves to signed-out without tripping the maintenance flag
statusReason: expected true to be undefined

[Killed] ConditionalExpression
src/hooks.server.ts:63:7
 	try {
 		const resolution = await getSessionUser(token);
 		event.locals.user = resolution?.user ?? null;
-		if (resolution?.renewed && token) {
+		if (false) {
 			event.cookies.set(SESSION_COOKIE, token, {
 				path: '/',
killedBy: a renewed session refreshes the cookie with the new expiry and security attributes
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/hooks.server.ts:65:11
 		event.locals.user = resolution?.user ?? null;
 		if (resolution?.renewed && token) {
 			event.cookies.set(SESSION_COOKIE, token, {
-				path: '/',
+				path: "",
 				httpOnly: true,
 				sameSite: 'lax',
killedBy: a renewed session refreshes the cookie with the new expiry and security attributes
statusReason: expected "vi.fn()" to be called with arguments: [ 'moderaty_session', …(2) ]

Received:

  1st vi.fn() call:

@@ -2,10 +2,10 @@
    "moderaty_session",

[Killed] BlockStatement
src/hooks.server.ts:72:14
 				expires: new Date(resolution.expiresAt)
 			});
 		}
-	} catch (e) {
-		// A deliberate HttpError (e.g. the account-has-no-org integrity failure)
-		// is NOT an outage: let it fail loudly instead of masking it as
-		// maintenance and signing the user out.
-		if (isHttpError(e)) throw e;
-		console.error('session lookup failed:', e);
-		event.locals.dbDown = true;
-		event.locals.user = null;
-	}
+	} catch (e) {}
 	return resolve(event);
 };
killedBy: a database failure during session lookup degrades to maintenance mode, never a bare 500
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/hooks.server.ts:76:7
 		// A deliberate HttpError (e.g. the account-has-no-org integrity failure)
 		// is NOT an outage: let it fail loudly instead of masking it as
 		// maintenance and signing the user out.
-		if (isHttpError(e)) throw e;
+		if (true) throw e;
 		console.error('session lookup failed:', e);
 		event.locals.dbDown = true;
killedBy: a database failure during session lookup degrades to maintenance mode, never a bare 500
statusReason: database is locked

[Killed] ConditionalExpression
src/hooks.server.ts:76:7
 		// A deliberate HttpError (e.g. the account-has-no-org integrity failure)
 		// is NOT an outage: let it fail loudly instead of masking it as
 		// maintenance and signing the user out.
-		if (isHttpError(e)) throw e;
+		if (false) throw e;
 		console.error('session lookup failed:', e);
 		event.locals.dbDown = true;
killedBy: a deliberate HttpError from session resolution propagates — integrity failures are not outages
statusReason: promise resolved "Response { status: 200, statusText: '', headers: Headers { 'content-type': 'text/plain;charset=UTF-8' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: true, redirected: false, type: 'default', url: '' }" instead of rejecting

[Killed] BooleanLiteral
src/hooks.server.ts:78:25
 		// maintenance and signing the user out.
 		if (isHttpError(e)) throw e;
 		console.error('session lookup failed:', e);
-		event.locals.dbDown = true;
+		event.locals.dbDown = false;
 		event.locals.user = null;
 	}
killedBy: a database failure during session lookup degrades to maintenance mode, never a bare 500
statusReason: expected false to be true // Object.is equality
