[Killed] BlockStatement
src/lib/server/channelConnect.ts:55:53
 
 type PickEntry = PendingChannelPick & { state: string; ts: number };
 
-function readEntries(cookies: Cookies): PickEntry[] {
-	const raw = cookies.get(CHANNEL_PICK_COOKIE);
-	// Stryker disable next-line ConditionalExpression: equivalent — with the guard forced false, decrypt(undefined) throws and the catch below returns the same []
-	if (!raw) return [];
-	let parsed: unknown;
-	try {
-		parsed = JSON.parse(decrypt(raw));
-	}
-	// Stryker disable next-line BlockStatement: equivalent — an empty catch leaves parsed undefined, and the Array.isArray check below returns the same []
-	catch {
-		return [];
-	}
-	if (!Array.isArray(parsed)) return [];
-	return parsed.filter(
-		(e): e is PickEntry =>
-			typeof e === 'object' && e !== null && typeof (e as PickEntry).state === 'string'
-	) as PickEntry[];
-}
+function readEntries(cookies: Cookies): PickEntry[] {}
 
 function writeEntries(cookies: Cookies, entries: PickEntry[]): void {
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 302, …(1) }

[Killed] BooleanLiteral
src/lib/server/channelConnect.ts:58:6
 function readEntries(cookies: Cookies): PickEntry[] {
 	const raw = cookies.get(CHANNEL_PICK_COOKIE);
 	// Stryker disable next-line ConditionalExpression: equivalent — with the guard forced false, decrypt(undefined) throws and the catch below returns the same []
-	if (!raw) return [];
+	if (raw) return [];
 	let parsed: unknown;
 	try {
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] BlockStatement
src/lib/server/channelConnect.ts:60:6
 	// Stryker disable next-line ConditionalExpression: equivalent — with the guard forced false, decrypt(undefined) throws and the catch below returns the same []
 	if (!raw) return [];
 	let parsed: unknown;
-	try {
-		parsed = JSON.parse(decrypt(raw));
-	}
+	try {}
 	// Stryker disable next-line BlockStatement: equivalent — an empty catch leaves parsed undefined, and the Array.isArray check below returns the same []
 	catch {
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] ArrayDeclaration
src/lib/server/channelConnect.ts:65:10
 	}
 	// Stryker disable next-line BlockStatement: equivalent — an empty catch leaves parsed undefined, and the Array.isArray check below returns the same []
 	catch {
-		return [];
+		return ["Stryker was here"];
 	}
 	if (!Array.isArray(parsed)) return [];
killedBy: clear deletes the cookie when nothing valid remains
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:67:6
 	catch {
 		return [];
 	}
-	if (!Array.isArray(parsed)) return [];
+	if (true) return [];
 	return parsed.filter(
 		(e): e is PickEntry =>
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] BooleanLiteral
src/lib/server/channelConnect.ts:67:6
 	catch {
 		return [];
 	}
-	if (!Array.isArray(parsed)) return [];
+	if (Array.isArray(parsed)) return [];
 	return parsed.filter(
 		(e): e is PickEntry =>
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] BlockStatement
src/lib/server/channelConnect.ts:74:69
 	) as PickEntry[];
 }
 
-function writeEntries(cookies: Cookies, entries: PickEntry[]): void {
-	if (entries.length === 0) {
-		cookies.delete(CHANNEL_PICK_COOKIE, { path: '/' });
-		return;
-	}
-	cookies.set(CHANNEL_PICK_COOKIE, encrypt(JSON.stringify(entries)), {
-		path: '/',
-		httpOnly: true,
-		sameSite: 'lax',
-		secure: cookieSecure(),
-		maxAge: PICK_TTL_MS / 1000
-	});
-}
+function writeEntries(cookies: Cookies, entries: PickEntry[]): void {}
 
 /**
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] BlockStatement
src/lib/server/channelConnect.ts:75:28
 }
 
 function writeEntries(cookies: Cookies, entries: PickEntry[]): void {
-	if (entries.length === 0) {
-		cookies.delete(CHANNEL_PICK_COOKIE, { path: '/' });
-		return;
-	}
+	if (entries.length === 0) {}
 	cookies.set(CHANNEL_PICK_COOKIE, encrypt(JSON.stringify(entries)), {
 		path: '/',
killedBy: clear deletes the cookie at path / when the last entry is removed
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/lib/server/channelConnect.ts:75:6
 }
 
 function writeEntries(cookies: Cookies, entries: PickEntry[]): void {
-	if (entries.length === 0) {
+	if (entries.length !== 0) {
 		cookies.delete(CHANNEL_PICK_COOKIE, { path: '/' });
 		return;
killedBy: a multi-channel account parks the channels and redirects to the picker without writing anything
statusReason: expected undefined to deeply equal [ { id: 'UC1', title: 'One' }, …(1) ]

[Killed] StringLiteral
src/lib/server/channelConnect.ts:76:47
 
 function writeEntries(cookies: Cookies, entries: PickEntry[]): void {
 	if (entries.length === 0) {
-		cookies.delete(CHANNEL_PICK_COOKIE, { path: '/' });
+		cookies.delete(CHANNEL_PICK_COOKIE, { path: "" });
 		return;
 	}
killedBy: clear deletes the cookie at path / when the last entry is removed
statusReason: expected [ { …(2) } ] to deeply equal [ { …(2) } ]

[Killed] StringLiteral
src/lib/server/channelConnect.ts:82:13
 	cookies.set(CHANNEL_PICK_COOKIE, encrypt(JSON.stringify(entries)), {
 		path: '/',
 		httpOnly: true,
-		sameSite: 'lax',
+		sameSite: "",
 		secure: cookieSecure(),
 		maxAge: PICK_TTL_MS / 1000
killedBy: parking writes an encrypted httpOnly lax cookie with a ten-minute maxAge
statusReason: expected { path: '/', httpOnly: true, …(3) } to deeply equal { path: '/', httpOnly: true, …(3) }

[Killed] ArithmeticOperator
src/lib/server/channelConnect.ts:84:11
 		httpOnly: true,
 		sameSite: 'lax',
 		secure: cookieSecure(),
-		maxAge: PICK_TTL_MS / 1000
+		maxAge: PICK_TTL_MS * 1000
 	});
 }
killedBy: parking writes an encrypted httpOnly lax cookie with a ten-minute maxAge
statusReason: expected { path: '/', httpOnly: true, …(3) } to deeply equal { path: '/', httpOnly: true, …(3) }

[Killed] BlockStatement
src/lib/server/channelConnect.ts:94:108
  * AES-GCM makes the payload tamper-proof and confidential, so the picker can
  * trust that both the token and the channel list came from Google's callback.
  */
-export function parkPendingChannelPick(cookies: Cookies, state: string, payload: PendingChannelPick): void {
-	const now = Date.now();
-	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
-	);
-	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_PICKS));
-}
+export function parkPendingChannelPick(cookies: Cookies, state: string, payload: PendingChannelPick): void {}
 
 /**
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] MethodExpression
src/lib/server/channelConnect.ts:96:18
  */
 export function parkPendingChannelPick(cookies: Cookies, state: string, payload: PendingChannelPick): void {
 	const now = Date.now();
-	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
-	);
+	const entries = readEntries(cookies);
 	entries.push({ ...payload, state, ts: now });
 	writeEntries(cookies, entries.slice(-MAX_PENDING_PICKS));
killedBy: parking twice under one state keeps only the newest grant
statusReason: expected [ { …(4) }, { …(4) } ] to have a length of 1 but got 2

[Killed] LogicalOperator
src/lib/server/channelConnect.ts:97:10
 export function parkPendingChannelPick(cookies: Cookies, state: string, payload: PendingChannelPick): void {
 	const now = Date.now();
 	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
+		(e) => e.state !== state || now - e.ts <= PICK_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
killedBy: parking twice under one state keeps only the newest grant
statusReason: expected [ { …(4) }, { …(4) } ] to have a length of 1 but got 2

[Killed] ArrowFunction
src/lib/server/channelConnect.ts:97:3
 export function parkPendingChannelPick(cookies: Cookies, state: string, payload: PendingChannelPick): void {
 	const now = Date.now();
 	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
+		() => undefined
 	);
 	entries.push({ ...payload, state, ts: now });
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-a', …(1) }

[Killed] UnaryOperator
src/lib/server/channelConnect.ts:100:38
 		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_PICKS));
+	writeEntries(cookies, entries.slice(+MAX_PENDING_PICKS));
 }
 
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] MethodExpression
src/lib/server/channelConnect.ts:100:24
 		(e) => e.state !== state && now - e.ts <= PICK_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_PICKS));
+	writeEntries(cookies, entries);
 }
 
killedBy: the cookie is bounded to the five newest pending picks
statusReason: expected [ …(6) ] to have a length of 5 but got 6

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:109:49
  * so the user reconnects. Other flows' entries are untouched.
  */
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
-	const entry = readEntries(cookies).find((e) => e.state === state);
+	const entry = readEntries(cookies).find((e) => false);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:109:49
  * so the user reconnects. Other flows' entries are untouched.
  */
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
-	const entry = readEntries(cookies).find((e) => e.state === state);
+	const entry = readEntries(cookies).find((e) => true);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
killedBy: read returns null for an unknown state
statusReason: expected { refreshToken: 'tok', …(1) } to be null

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:110:48
  */
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
-	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
+	if (!entry || typeof entry.ts !== 'number' || false) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
killedBy: read honors the TTL boundary: valid at exactly ten minutes, null one millisecond later
statusReason: expected { refreshToken: 'tok', …(1) } to be null

[Killed] LogicalOperator
src/lib/server/channelConnect.ts:110:6
  */
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
-	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
+	if ((!entry || typeof entry.ts !== 'number') && Date.now() - entry.ts > PICK_TTL_MS) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
killedBy: read returns null when no pick cookie exists
statusReason: Cannot read properties of undefined (reading 'ts')

[Killed] BooleanLiteral
src/lib/server/channelConnect.ts:111:48
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
-	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
+	if (typeof entry.refreshToken !== 'string' || entry.refreshToken) return null;
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
 	const valid = entry.channels.every(
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] EqualityOperator
src/lib/server/channelConnect.ts:111:6
 export function readPendingChannelPick(cookies: Cookies, state: string): PendingChannelPick | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
-	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
+	if (typeof entry.refreshToken === 'string' || !entry.refreshToken) return null;
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
 	const valid = entry.channels.every(
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:112:40
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
-	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
+	if (!Array.isArray(entry.channels) || false) return null;
 	const valid = entry.channels.every(
killedBy: read returns null for a forged entry whose channels are not a non-empty array
statusReason: expected { refreshToken: 'refresh-token', …(1) } to be null

[Killed] EqualityOperator
src/lib/server/channelConnect.ts:112:40
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PICK_TTL_MS) return null;
 	if (typeof entry.refreshToken !== 'string' || !entry.refreshToken) return null;
-	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
+	if (!Array.isArray(entry.channels) || entry.channels.length !== 0) return null;
 	const valid = entry.channels.every(
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] EqualityOperator
src/lib/server/channelConnect.ts:115:49
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
 	const valid = entry.channels.every(
-		(c) => typeof c === 'object' && c !== null && typeof c.id === 'string' && c.id && typeof c.title === 'string'
+		(c) => typeof c === 'object' && c !== null && typeof c.id !== 'string' && c.id && typeof c.title === 'string'
 	);
 	if (!valid) return null;
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] LogicalOperator
src/lib/server/channelConnect.ts:115:10
 	if (!Array.isArray(entry.channels) || entry.channels.length === 0) return null;
 	const valid = entry.channels.every(
-		(c) => typeof c === 'object' && c !== null && typeof c.id === 'string' && c.id && typeof c.title === 'string'
+		(c) => typeof c === 'object' && c !== null || typeof c.id === 'string' && c.id && typeof c.title === 'string'
 	);
 	if (!valid) return null;
killedBy: read returns null when any parked channel is malformed
statusReason: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:117:6
 		(c) => typeof c === 'object' && c !== null && typeof c.id === 'string' && c.id && typeof c.title === 'string'
 	);
-	if (!valid) return null;
+	if (false) return null;
 	return { refreshToken: entry.refreshToken, channels: entry.channels };
 }
killedBy: read returns null when any parked channel is malformed
statusReason: channels: [null]: expected { refreshToken: 'refresh-token', …(1) } to be null

[Killed] BooleanLiteral
src/lib/server/channelConnect.ts:117:6
 		(c) => typeof c === 'object' && c !== null && typeof c.id === 'string' && c.id && typeof c.title === 'string'
 	);
-	if (!valid) return null;
+	if (valid) return null;
 	return { refreshToken: entry.refreshToken, channels: entry.channels };
 }
killedBy: read returns the grant parked for the matching state only
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] BlockStatement
src/lib/server/channelConnect.ts:122:80
 }
 
 /** Clears only this flow's parked pick once the channel is connected. */
-export function clearPendingChannelPick(cookies: Cookies, state: string): void {
-	writeEntries(
-		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
-	);
-}
+export function clearPendingChannelPick(cookies: Cookies, state: string): void {}
 
 /**
killedBy: clear removes only the matching flow and keeps the others
statusReason: expected { refreshToken: 'token-a', …(1) } to be null

[Killed] MethodExpression
src/lib/server/channelConnect.ts:125:3
 export function clearPendingChannelPick(cookies: Cookies, state: string): void {
 	writeEntries(
 		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
+		readEntries(cookies)
 	);
 }
killedBy: clear removes only the matching flow and keeps the others
statusReason: expected { refreshToken: 'token-a', …(1) } to be null

[Killed] ArrowFunction
src/lib/server/channelConnect.ts:125:31
 export function clearPendingChannelPick(cookies: Cookies, state: string): void {
 	writeEntries(
 		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
+		readEntries(cookies).filter(() => undefined)
 	);
 }
killedBy: clear removes only the matching flow and keeps the others
statusReason: expected null to deeply equal { refreshToken: 'token-b', …(1) }

[Killed] ObjectLiteral
src/lib/server/channelConnect.ts:164:14
 			set: { userId: user.id, orgId: user.orgId, title: channel.title, refreshTokenEnc, active: 1 },
 			setWhere: or(isNull(channels.orgId), eq(channels.orgId, user.orgId))
 		})
-		.returning({ id: channels.id });
+		.returning({});
 	return updated.length === 0 ? 'conflict' : 'ok';
 }
killedBy: a new channel is inserted with the token encrypted and the scan window opening at connect time
statusReason: params: UC1,user-1,org-1,One,U/EWjaSvBc+Y33HHUW3GjQtCV6FSU0Alc7Syw37Eq3+h05gCcwjfNWM=,2026-08-06T15:52:46.790Z,1,0,0,2026-08-06T15:52:46.790Z,user-1,org-1,One,U/EWjaSvBc+Y33HHUW3GjQtCV6FSU0Alc7Syw37Eq3+h05gCcwjfNWM=,1,org-1

[Killed] EqualityOperator
src/lib/server/channelConnect.ts:165:9
 			setWhere: or(isNull(channels.orgId), eq(channels.orgId, user.orgId))
 		})
 		.returning({ id: channels.id });
-	return updated.length === 0 ? 'conflict' : 'ok';
+	return updated.length !== 0 ? 'conflict' : 'ok';
 }
 
killedBy: a new channel is inserted with the token encrypted and the scan window opening at connect time
statusReason: expected 'conflict' to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/channelConnect.ts:165:9
 			setWhere: or(isNull(channels.orgId), eq(channels.orgId, user.orgId))
 		})
 		.returning({ id: channels.id });
-	return updated.length === 0 ? 'conflict' : 'ok';
+	return false ? 'conflict' : 'ok';
 }
 
killedBy: a channel owned by another team is left untouched and reports exactly conflict
statusReason: expected 'ok' to be 'conflict' // Object.is equality
