[Killed] BlockStatement
lib/server/db/migrationTestUtils.ts:32:61
  * @param file - The migration file name inside `drizzle/` (e.g. `0013_channels_org_contract.sql`)
  * @returns The migration's statements in execution order
  */
-export function migrationStatements(file: string): string[] {
-	const migration = readFileSync(new URL(`../../../../drizzle/${file}`, import.meta.url), 'utf8');
-	return migration
-		.split('--> statement-breakpoint')
-		.map((chunk) =>
-			chunk
-				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
-				.join('\n')
-				.trim()
-		)
-		.filter((chunk) => chunk.length > 0);
-}
+export function migrationStatements(file: string): string[] {}
 
 // Every client opened via applyMigration is tracked here so
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] MethodExpression
lib/server/db/migrationTestUtils.ts:34:9
  */
 export function migrationStatements(file: string): string[] {
 	const migration = readFileSync(new URL(`../../../../drizzle/${file}`, import.meta.url), 'utf8');
-	return migration
-		.split('--> statement-breakpoint')
-		.map((chunk) =>
-			chunk
-				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
-				.join('\n')
-				.trim()
-		)
-		.filter((chunk) => chunk.length > 0);
+	return migration.split('--> statement-breakpoint').map(chunk => chunk.split('\n').filter(line => !line.trimStart().startsWith('--')).join('\n').trim());
 }
 
killedBy: migrationStatements drops chunks that are empty after comment stripping
statusReason: expected [ '', …(3) ] to deeply equal [ …(2) ]

[Killed] ArrowFunction
lib/server/db/migrationTestUtils.ts:36:8
 	const migration = readFileSync(new URL(`../../../../drizzle/${file}`, import.meta.url), 'utf8');
 	return migration
 		.split('--> statement-breakpoint')
-		.map((chunk) =>
-			chunk
-				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
-				.join('\n')
-				.trim()
+		.map(() => undefined
 		)
 		.filter((chunk) => chunk.length > 0);
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
lib/server/db/migrationTestUtils.ts:37:4
 	return migration
 		.split('--> statement-breakpoint')
 		.map((chunk) =>
-			chunk
-				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
+			chunk.split('\n')
 				.join('\n')
 				.trim()
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] MethodExpression
lib/server/db/migrationTestUtils.ts:37:4
 	return migration
 		.split('--> statement-breakpoint')
 		.map((chunk) =>
-			chunk
-				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
-				.join('\n')
-				.trim()
+			chunk.split('\n').filter(line => !line.trimStart().startsWith('--')).join('\n')
 		)
 		.filter((chunk) => chunk.length > 0);
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] StringLiteral
lib/server/db/migrationTestUtils.ts:38:12
 		.split('--> statement-breakpoint')
 		.map((chunk) =>
 			chunk
-				.split('\n')
+				.split("")
 				.filter((line) => !line.trimStart().startsWith('--'))
 				.join('\n')
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
lib/server/db/migrationTestUtils.ts:39:23
 		.map((chunk) =>
 			chunk
 				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
+				.filter((line) => line.trimStart().startsWith('--'))
 				.join('\n')
 				.trim()
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] MethodExpression
lib/server/db/migrationTestUtils.ts:39:24
 		.map((chunk) =>
 			chunk
 				.split('\n')
-				.filter((line) => !line.trimStart().startsWith('--'))
+				.filter((line) => !line.trimStart().endsWith('--'))
 				.join('\n')
 				.trim()
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] StringLiteral
lib/server/db/migrationTestUtils.ts:40:11
 			chunk
 				.split('\n')
 				.filter((line) => !line.trimStart().startsWith('--'))
-				.join('\n')
+				.join("")
 				.trim()
 		)
killedBy: migrationStatements preserves multi-line statement text exactly (0013 CREATE TABLE)
statusReason: expected 'CREATE TABLE `__new_channels` (\t`id`…' to be 'CREATE TABLE `__new_channels` (\n\t`i…' // Object.is equality

[Killed] ConditionalExpression
lib/server/db/migrationTestUtils.ts:43:22
 				.join('\n')
 				.trim()
 		)
-		.filter((chunk) => chunk.length > 0);
+		.filter((chunk) => true);
 }
 
killedBy: migrationStatements drops chunks that are empty after comment stripping
statusReason: expected [ '', …(3) ] to deeply equal [ …(2) ]

[Killed] ArrowFunction
lib/server/db/migrationTestUtils.ts:43:11
 				.join('\n')
 				.trim()
 		)
-		.filter((chunk) => chunk.length > 0);
+		.filter(() => undefined);
 }
 
killedBy: migrationStatements splits on breakpoints and strips license/comment lines
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] BlockStatement
lib/server/db/migrationTestUtils.ts:61:108
  * @param seedSql - Optional seed statements executed after the DDL
  * @returns The open, migrated in-memory client
  */
-export async function applyMigration(preDdl: string, migrationFile: string, seedSql = ''): Promise<Client> {
-	const client = createClient({ url: ':memory:' });
-	openClients.push(client);
-	await client.execute('PRAGMA foreign_keys = ON');
-	await client.executeMultiple(preDdl + seedSql);
-	for (const statement of migrationStatements(migrationFile)) await client.execute(statement);
-	return client;
-}
+export async function applyMigration(preDdl: string, migrationFile: string, seedSql = ''): Promise<Client> {}
 
 /**
killedBy: applyMigration runs DDL, seed, and migration in order with foreign keys ON
statusReason: Cannot read properties of undefined (reading 'execute')

[Killed] ObjectLiteral
lib/server/db/migrationTestUtils.ts:62:30
  * @returns The open, migrated in-memory client
  */
 export async function applyMigration(preDdl: string, migrationFile: string, seedSql = ''): Promise<Client> {
-	const client = createClient({ url: ':memory:' });
+	const client = createClient({});
 	openClients.push(client);
 	await client.execute('PRAGMA foreign_keys = ON');
killedBy: applyMigration runs DDL, seed, and migration in order with foreign keys ON
statusReason: URL_INVALID: The URL 'undefined' is not in a valid format

[Killed] ArithmeticOperator
lib/server/db/migrationTestUtils.ts:65:31
 	const client = createClient({ url: ':memory:' });
 	openClients.push(client);
 	await client.execute('PRAGMA foreign_keys = ON');
-	await client.executeMultiple(preDdl + seedSql);
+	await client.executeMultiple(preDdl - seedSql);
 	for (const statement of migrationStatements(migrationFile)) await client.execute(statement);
 	return client;
killedBy: applyMigration runs DDL, seed, and migration in order with foreign keys ON
statusReason: failed to downcast any to string

[Killed] BlockStatement
lib/server/db/migrationTestUtils.ts:73:42
 /**
  * Closes every client opened via applyMigration. Pass to vitest's afterEach.
  */
-export function closeMigratedDbs(): void {
-	for (const client of openClients.splice(0)) client.close();
-}
+export function closeMigratedDbs(): void {}
 
 /**
killedBy: closeMigratedDbs closes every tracked client and is idempotent
statusReason: promise resolved "ResultSetImpl{ columns: [ '1' ], …(4) }" instead of rejecting

[Killed] BlockStatement
lib/server/db/migrationTestUtils.ts:84:76
  *
  * @param client - A migrated in-memory client from applyMigration
  */
-export async function expectTenancyContract(client: Client): Promise<void> {
-	await expect(
-		client.execute(
-			"INSERT INTO channels (id, user_id, title, refresh_token_enc) VALUES ('UCbad', 'user-1', 'Bad', 'enc-b')"
-		)
-	).rejects.toThrow(/channels_org_requires_owner/);
-}
+export async function expectTenancyContract(client: Client): Promise<void> {}
 
killedBy: expectTenancyContract fails loudly when the contract is missing
statusReason: promise resolved "undefined" instead of rejecting
