[Killed] StringLiteral
lib/server/db/schema.ts:45:15
 export const sessions = sqliteTable('sessions', {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: text('id').primaryKey(), // random 32-byte hex token; also the cookie value
-	userId: text('user_id')
+	userId: text("")
 		.notNull()
 		.references(() => users.id, { onDelete: 'cascade' }),
killedBy: sessions table shape
statusReason: expected [ 'id', 'userId', …(3) ] to deeply equal [ 'id', 'user_id', …(3) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:47:15
 	id: text('id').primaryKey(), // random 32-byte hex token; also the cookie value
 	userId: text('user_id')
 		.notNull()
-		.references(() => users.id, { onDelete: 'cascade' }),
+		.references(() => undefined, { onDelete: 'cascade' }),
 	activeOrgId: text('active_org_id'), // tenant the session is acting in; null = resolve to oldest membership
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
killedBy: sessions user_id cascades to users.id and is indexed
statusReason: Cannot read properties of undefined (reading 'table')

[Killed] StringLiteral
lib/server/db/schema.ts:47:43
 	id: text('id').primaryKey(), // random 32-byte hex token; also the cookie value
 	userId: text('user_id')
 		.notNull()
-		.references(() => users.id, { onDelete: 'cascade' }),
+		.references(() => users.id, { onDelete: "" }),
 	activeOrgId: text('active_org_id'), // tenant the session is acting in; null = resolve to oldest membership
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
killedBy: sessions user_id cascades to users.id and is indexed
statusReason: expected undefined to be 'cascade' // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:48:20
 	userId: text('user_id')
 		.notNull()
 		.references(() => users.id, { onDelete: 'cascade' }),
-	activeOrgId: text('active_org_id'), // tenant the session is acting in; null = resolve to oldest membership
+	activeOrgId: text(""), // tenant the session is acting in; null = resolve to oldest membership
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
killedBy: sessions table shape
statusReason: expected [ Array(5) ] to deeply equal [ 'id', 'user_id', …(3) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:51:4
 	activeOrgId: text('active_org_id'), // tenant the session is acting in; null = resolve to oldest membership
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('sessions_user_id_idx').on(table.userId)
-]);
+}, () => undefined);
 
 // Tenant. Every user owns a personal org (personal_for set, UNIQUE), created
killedBy: sessions table shape
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
lib/server/db/schema.ts:51:15
 	activeOrgId: text('active_org_id'), // tenant the session is acting in; null = resolve to oldest membership
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('sessions_user_id_idx').on(table.userId)
-]);
+}, (table) => []);
 
 // Tenant. Every user owns a personal org (personal_for set, UNIQUE), created
killedBy: sessions user_id cascades to users.id and is indexed
statusReason: sessions index sessions_user_id_idx: expected undefined to be defined

[Killed] StringLiteral
lib/server/db/schema.ts:52:8
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; sliding 30-day expiry
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
 }, (table) => [
-	index('sessions_user_id_idx').on(table.userId)
+	index("").on(table.userId)
 ]);
 
killedBy: sessions user_id cascades to users.id and is indexed
statusReason: sessions index sessions_user_id_idx: expected undefined to be defined

[Killed] StringLiteral
lib/server/db/schema.ts:59:42
 // in the signup transaction; shared orgs (personal_for NULL) are created from
 // the Team settings page. `plan` is the Stripe gating hook — billing is
 // per-ORGANIZATION (users.plan is legacy and read nowhere).
-export const organizations = sqliteTable('organizations', {
+export const organizations = sqliteTable("", {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: text('id').primaryKey(), // random hex
killedBy: organizations table shape
statusReason: expected '' to be 'organizations' // Object.is equality

[Killed] ObjectLiteral
lib/server/db/schema.ts:59:59
 // in the signup transaction; shared orgs (personal_for NULL) are created from
 // the Team settings page. `plan` is the Stripe gating hook — billing is
 // per-ORGANIZATION (users.plan is legacy and read nowhere).
-export const organizations = sqliteTable('organizations', {
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	id: text('id').primaryKey(), // random hex
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	name: text('name').notNull(),
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	plan: text('plan').notNull().default('free'), // future Stripe gating hook (hosted plans)
-	personalFor: text('personal_for').unique(), // users.id of the user this is the personal org for; null = shared org
-	// Per-org BYOK OpenAI key (hosted plans), AES-256-GCM via crypto.ts —
-	// owner-managed from the Team page; never serialized to the client.
-	openaiKeyEnc: text('openai_key_enc'),
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-});
+export const organizations = sqliteTable('organizations', {});
 
 export const memberships = sqliteTable('memberships', {
killedBy: organizations table shape
statusReason: expected [] to deeply equal [ 'id', 'name', 'plan', …(3) ]

[Killed] StringLiteral
lib/server/db/schema.ts:70:18
 	// Per-org BYOK OpenAI key (hosted plans), AES-256-GCM via crypto.ts —
 	// owner-managed from the Team page; never serialized to the client.
 	openaiKeyEnc: text('openai_key_enc'),
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
+	createdAt: text("").notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
 });
 
killedBy: organizations table shape
statusReason: expected [ 'id', 'name', 'plan', …(3) ] to deeply equal [ 'id', 'name', 'plan', …(3) ]

[Killed] StringLiteral
lib/server/db/schema.ts:70:53
 	// Per-org BYOK OpenAI key (hosted plans), AES-256-GCM via crypto.ts —
 	// owner-managed from the Team page; never serialized to the client.
 	openaiKeyEnc: text('openai_key_enc'),
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
+	createdAt: text('created_at').notNull().default(sql``)
 });
 
killedBy: organizations table shape
statusReason: expected '' to be '(strftime(\'%Y-%m-%dT%H:%M:%fZ\', \'n…' // Object.is equality

[Killed] ArrowFunction
lib/server/db/schema.ts:79:15
 		.references(() => users.id, { onDelete: 'cascade' }),
 	orgId: text('org_id')
 		.notNull()
-		.references(() => organizations.id, { onDelete: 'cascade' }),
+		.references(() => undefined, { onDelete: 'cascade' }),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	role: text('role').notNull(), // 'owner' | 'admin' | 'member'
killedBy: memberships composite primary key and cascading FKs
statusReason: Cannot read properties of undefined (reading 'table')

[Killed] ObjectLiteral
lib/server/db/schema.ts:79:39
 		.references(() => users.id, { onDelete: 'cascade' }),
 	orgId: text('org_id')
 		.notNull()
-		.references(() => organizations.id, { onDelete: 'cascade' }),
+		.references(() => organizations.id, {}),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	role: text('role').notNull(), // 'owner' | 'admin' | 'member'
killedBy: memberships composite primary key and cascading FKs
statusReason: expected undefined to be 'cascade' // Object.is equality

[Killed] ArrowFunction
lib/server/db/schema.ts:83:4
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	role: text('role').notNull(), // 'owner' | 'admin' | 'member'
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	primaryKey({ columns: [table.userId, table.orgId] }),
-	index('memberships_org_id_idx').on(table.orgId)
-]);
+}, () => undefined);
 
 // Single-use invite link: /invite/<token>. Role is fixed at creation and is
killedBy: memberships composite primary key and cascading FKs
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
lib/server/db/schema.ts:83:15
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	role: text('role').notNull(), // 'owner' | 'admin' | 'member'
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	primaryKey({ columns: [table.userId, table.orgId] }),
-	index('memberships_org_id_idx').on(table.orgId)
-]);
+}, (table) => []);
 
 // Single-use invite link: /invite/<token>. Role is fixed at creation and is
killedBy: memberships composite primary key and cascading FKs
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
lib/server/db/schema.ts:84:24
 	role: text('role').notNull(), // 'owner' | 'admin' | 'member'
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
 }, (table) => [
-	primaryKey({ columns: [table.userId, table.orgId] }),
+	primaryKey({ columns: [] }),
 	index('memberships_org_id_idx').on(table.orgId)
 ]);
killedBy: memberships composite primary key and cascading FKs
statusReason: expected [] to deeply equal [ 'user_id', 'org_id' ]

[Killed] ArrowFunction
lib/server/db/schema.ts:102:15
 	role: text('role').notNull(), // 'admin' | 'member'
 	createdBy: text('created_by')
 		.notNull()
-		.references(() => users.id),
+		.references(() => undefined),
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; 7 days from creation
 	acceptedBy: text('accepted_by'), // users.id of the accepter; null = open
killedBy: invites table shape and FKs
statusReason: Cannot read properties of undefined (reading 'table')

[Killed] StringLiteral
lib/server/db/schema.ts:105:53
 		.references(() => users.id),
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; 7 days from creation
 	acceptedBy: text('accepted_by'), // users.id of the accepter; null = open
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
+	createdAt: text('created_at').notNull().default(sql``)
 }, (table) => [
 	index('invites_org_id_idx').on(table.orgId)
killedBy: invites table shape and FKs
statusReason: expected '' to be '(strftime(\'%Y-%m-%dT%H:%M:%fZ\', \'n…' // Object.is equality

[Killed] ArrowFunction
lib/server/db/schema.ts:106:4
 	expiresAt: text('expires_at').notNull(), // ISO timestamp; 7 days from creation
 	acceptedBy: text('accepted_by'), // users.id of the accepter; null = open
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('invites_org_id_idx').on(table.orgId)
-]);
+}, () => undefined);
 
 export const channels = sqliteTable('channels', {
killedBy: invites table shape and FKs
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
lib/server/db/schema.ts:110:37
 	index('invites_org_id_idx').on(table.orgId)
 ]);
 
-export const channels = sqliteTable('channels', {
+export const channels = sqliteTable("", {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: text('id').primaryKey(), // YouTube channel ID (UC...)
killedBy: channels table shape
statusReason: expected '' to be 'channels' // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:113:15
 export const channels = sqliteTable('channels', {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: text('id').primaryKey(), // YouTube channel ID (UC...)
-	userId: text('user_id'), // connected-by user (whose Google grant this channel uses); null = pre-accounts orphan, claimed on first login
+	userId: text(""), // connected-by user (whose Google grant this channel uses); null = pre-accounts orphan, claimed on first login
 	orgId: text('org_id'), // owning TENANT; null only for pre-accounts orphans (user_id IS NULL) awaiting first-login claim
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
killedBy: channels table shape
statusReason: expected [ 'id', 'userId', 'org_id', …(16) ] to deeply equal [ 'id', 'user_id', 'org_id', …(16) ]

[Killed] StringLiteral
lib/server/db/schema.ts:117:24
 	orgId: text('org_id'), // owning TENANT; null only for pre-accounts orphans (user_id IS NULL) awaiting first-login claim
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	title: text('title').notNull(),
-	refreshTokenEnc: text('refresh_token_enc').notNull(),
+	refreshTokenEnc: text("").notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
killedBy: channels table shape
statusReason: expected [ 'id', 'user_id', 'org_id', …(16) ] to deeply equal [ 'id', 'user_id', 'org_id', …(16) ]

[Killed] StringLiteral
lib/server/db/schema.ts:120:22
 	refreshTokenEnc: text('refresh_token_enc').notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	nextPageToken: text('next_page_token'), // YouTube continuation token for an incomplete scan
+	nextPageToken: text(""), // YouTube continuation token for an incomplete scan
 	scanCursor: text('scan_cursor'), // high-water timestamp to commit once an incomplete scan ends
killedBy: channels table shape
statusReason: expected [ 'id', 'user_id', 'org_id', …(16) ] to deeply equal [ 'id', 'user_id', 'org_id', …(16) ]

[Killed] StringLiteral
lib/server/db/schema.ts:131:26
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	active: integer('active').notNull().default(1),
 	toneLevel: integer('tone_level'), // moderation sensitivity: null or 1 = omni only, 2 = omni + tone pass
-	protectLgbtqia: integer('protect_lgbtqia').notNull().default(0), // protection setting: 1 = heightened protection for comments targeting LGBTQIA+ people
+	protectLgbtqia: integer("").notNull().default(0), // protection setting: 1 = heightened protection for comments targeting LGBTQIA+ people
 	protectWomen: integer('protect_women').notNull().default(0), // protection setting: 1 = heightened protection for comments targeting women
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
killedBy: channels table shape
statusReason: expected [ 'id', 'user_id', 'org_id', …(16) ] to deeply equal [ 'id', 'user_id', 'org_id', …(16) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:134:4
 	protectLgbtqia: integer('protect_lgbtqia').notNull().default(0), // protection setting: 1 = heightened protection for comments targeting LGBTQIA+ people
 	protectWomen: integer('protect_women').notNull().default(0), // protection setting: 1 = heightened protection for comments targeting women
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('channels_user_id_idx').on(table.userId),
-	index('channels_org_id_idx').on(table.orgId),
-	check('channels_org_requires_owner', sql`${table.orgId} IS NOT NULL OR ${table.userId} IS NULL`)
-]);
+}, () => undefined);
 
 export const rules = sqliteTable('rules', {
killedBy: channels table shape
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
lib/server/db/schema.ts:140:34
 	check('channels_org_requires_owner', sql`${table.orgId} IS NOT NULL OR ${table.userId} IS NULL`)
 ]);
 
-export const rules = sqliteTable('rules', {
+export const rules = sqliteTable("", {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: integer('id').primaryKey({ autoIncrement: true }),
killedBy: rules table shape with autoincrement id
statusReason: expected '' to be 'rules' // Object.is equality

[Killed] BooleanLiteral
lib/server/db/schema.ts:142:48
 
 export const rules = sqliteTable('rules', {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	id: integer('id').primaryKey({ autoIncrement: true }),
+	id: integer('id').primaryKey({ autoIncrement: false }),
 	channelId: text('channel_id').notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
killedBy: rules table shape with autoincrement id
statusReason: rules.id autoIncrement: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:143:18
 export const rules = sqliteTable('rules', {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: integer('id').primaryKey({ autoIncrement: true }),
-	channelId: text('channel_id').notNull(),
+	channelId: text("").notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	type: text('type').notNull(), // 'keyword' | 'regex' | 'user'
killedBy: rules table shape with autoincrement id
statusReason: expected [ 'id', 'channelId', 'type', …(3) ] to deeply equal [ 'id', 'channel_id', 'type', …(3) ]

[Killed] StringLiteral
lib/server/db/schema.ts:165:19
 	// authorChannelId the channel owner enters as their own configuration;
 	// no identifier is ever taken from a fetched comment and stored.
 	authorChannelId: text('author_channel_id'),
-	authorName: text('author_name'),
+	authorName: text(""),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	text: text('text').notNull(), // truncated to 500 chars on insert
killedBy: comments table shape
statusReason: expected [ 'id', 'channel_id', …(9) ] to deeply equal [ 'id', 'channel_id', …(9) ]

[Killed] StringLiteral
lib/server/db/schema.ts:168:20
 	authorName: text('author_name'),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	text: text('text').notNull(), // truncated to 500 chars on insert
-	publishedAt: text('published_at').notNull(),
+	publishedAt: text("").notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	status: text('status').notNull(), // 'pending' | 'approved' | 'held' | 'rejected' | 'deleted' | 'restoring' (in-flight undo)
killedBy: comments table shape
statusReason: expected [ 'id', 'channel_id', …(9) ] to deeply equal [ 'id', 'channel_id', …(9) ]

[Killed] StringLiteral
lib/server/db/schema.ts:171:18
 	publishedAt: text('published_at').notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	status: text('status').notNull(), // 'pending' | 'approved' | 'held' | 'rejected' | 'deleted' | 'restoring' (in-flight undo)
-	decidedBy: text('decided_by').notNull(), // 'rule' | 'ai' | 'human' | 'none'
+	decidedBy: text("").notNull(), // 'rule' | 'ai' | 'human' | 'none'
 	matchedRuleId: integer('matched_rule_id'),
 	aiScore: text('ai_score'), // JSON string of the six category scores, or null
killedBy: comments table shape
statusReason: expected [ 'id', 'channel_id', …(9) ] to deeply equal [ 'id', 'channel_id', …(9) ]

[Killed] StringLiteral
lib/server/db/schema.ts:174:53
 	decidedBy: text('decided_by').notNull(), // 'rule' | 'ai' | 'human' | 'none'
 	matchedRuleId: integer('matched_rule_id'),
 	aiScore: text('ai_score'), // JSON string of the six category scores, or null
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
+	createdAt: text('created_at').notNull().default(sql``)
 });
 
killedBy: comments table shape
statusReason: expected '' to be '(strftime(\'%Y-%m-%dT%H:%M:%fZ\', \'n…' // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:177:46
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
 });
 
-export const moderationActions = sqliteTable('moderation_actions', {
+export const moderationActions = sqliteTable("", {
 	commentId: text('comment_id').primaryKey(),
 	channelId: text('channel_id').notNull(),
killedBy: moderation_actions table shape and composite state index
statusReason: expected '' to be 'moderation_actions' // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:187:26
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	state: text('state').notNull(), // 'pending' | 'dispatched' | 'completed' ('manual_review' legacy)
 	lastAttemptAt: text('last_attempt_at'),
-	lastManualRetryAt: text('last_manual_retry_at'),
+	lastManualRetryAt: text(""),
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
 }, (table) => [
killedBy: moderation_actions table shape and composite state index
statusReason: expected [ 'comment_id', 'channel_id', …(6) ] to deeply equal [ 'comment_id', 'channel_id', …(6) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:189:4
 	lastAttemptAt: text('last_attempt_at'),
 	lastManualRetryAt: text('last_manual_retry_at'),
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('moderation_actions_channel_state_idx').on(table.channelId, table.state)
-]);
+}, () => undefined);
 
 export const auditLog = sqliteTable('audit_log', {
killedBy: moderation_actions table shape and composite state index
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
lib/server/db/schema.ts:193:50
 	index('moderation_actions_channel_state_idx').on(table.channelId, table.state)
 ]);
 
-export const auditLog = sqliteTable('audit_log', {
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	id: integer('id').primaryKey({ autoIncrement: true }),
-	channelId: text('channel_id').notNull(),
-	commentId: text('comment_id').notNull(),
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	action: text('action').notNull(), // 'hold' | 'reject' | 'delete' | 'ban' | 'approve' | 'restore' | 'queue' | 'dry-run'
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	reason: text('reason').notNull(), // human-readable, e.g. "rule #4 (keyword)" or "ai score 0.91"
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	actor: text('actor').notNull(), // 'system' | 'user'
-	// Comment text (≤500 chars) on dry-run rows only: a dry run never inserts
-	// into comments (I8), so the audit row is the only place its text survives.
-	// Null for every real-run action — that text lives in comments.text.
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	text: text('text'),
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
+export const auditLog = sqliteTable('audit_log', {}, (table) => [
 	// Dashboard ban counts (action='ban' + channel_id IN, issue #77) and the
 	// per-channel log page both filter by channel_id; the composite serves
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: expected [] to deeply equal [ 'id', 'channel_id', …(6) ]

[Killed] ObjectLiteral
lib/server/db/schema.ts:195:31
 
 export const auditLog = sqliteTable('audit_log', {
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	id: integer('id').primaryKey({ autoIncrement: true }),
+	id: integer('id').primaryKey({}),
 	channelId: text('channel_id').notNull(),
 	commentId: text('comment_id').notNull(),
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: audit_log.id autoIncrement: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/server/db/schema.ts:197:18
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	id: integer('id').primaryKey({ autoIncrement: true }),
 	channelId: text('channel_id').notNull(),
-	commentId: text('comment_id').notNull(),
+	commentId: text("").notNull(),
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	action: text('action').notNull(), // 'hold' | 'reject' | 'delete' | 'ban' | 'approve' | 'restore' | 'queue' | 'dry-run'
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: expected [ 'id', 'channel_id', …(6) ] to deeply equal [ 'id', 'channel_id', …(6) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:210:4
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	text: text('text'),
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	// Dashboard ban counts (action='ban' + channel_id IN, issue #77) and the
-	// per-channel log page both filter by channel_id; the composite serves
-	// the ban query and its leftmost column serves channel-only reads.
-	index('audit_log_channel_action_idx').on(table.channelId, table.action)
-]);
+}, () => undefined);
 
 // Evidentiary consent log (CDC Art. 6º, VIII; LGPD). One row per acceptance
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
lib/server/db/schema.ts:210:15
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	text: text('text'),
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	// Dashboard ban counts (action='ban' + channel_id IN, issue #77) and the
-	// per-channel log page both filter by channel_id; the composite serves
-	// the ban query and its leftmost column serves channel-only reads.
-	index('audit_log_channel_action_idx').on(table.channelId, table.action)
-]);
+}, (table) => []);
 
 // Evidentiary consent log (CDC Art. 6º, VIII; LGPD). One row per acceptance
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: audit_log index audit_log_channel_action_idx: expected undefined to be defined

[Killed] StringLiteral
lib/server/db/schema.ts:214:8
 	// Dashboard ban counts (action='ban' + channel_id IN, issue #77) and the
 	// per-channel log page both filter by channel_id; the composite serves
 	// the ban query and its leftmost column serves channel-only reads.
-	index('audit_log_channel_action_idx').on(table.channelId, table.action)
+	index("").on(table.channelId, table.action)
 ]);
 
killedBy: audit_log table shape with autoincrement id and composite index
statusReason: audit_log index audit_log_channel_action_idx: expected undefined to be defined

[Killed] ObjectLiteral
lib/server/db/schema.ts:224:49
 // e-mail lives HERE, not in the users row, because this log is the only
 // place its retention is justified (Art. 16, III — blocked from any other
 // use by architecture); account deletion wipes users.email entirely.
-export const consents = sqliteTable('consents', {
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	id: integer('id').primaryKey({ autoIncrement: true }),
-	userId: text('user_id')
-		.notNull()
-		.references(() => users.id, { onDelete: 'cascade' }),
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	email: text('email'), // retained consent evidence; nulled by the 10-year sweep
-	docVersion: text('doc_version').notNull(), // LEGAL_VERSION accepted, e.g. 'v1.0'
-	checkboxText: text('checkbox_text').notNull(), // exact text shown at acceptance
-	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
-	ip: text('ip').notNull(), // event.getClientAddress() at acceptance
-	userAgent: text('user_agent').notNull(),
-	marketingOptIn: integer('marketing_opt_in').notNull().default(0), // separate, unbundled LGPD consent
-	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
+export const consents = sqliteTable('consents', {}, (table) => [
 	index('consents_user_id_idx').on(table.userId),
 	// Serves the 10-year retention sweep (email IS NOT NULL AND created_at <
killedBy: consents table shape
statusReason: expected [] to deeply equal [ 'id', 'user_id', 'email', …(6) ]
