[Killed] StringLiteral
lib/server/db/schema.ts:233:21
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	email: text('email'), // retained consent evidence; nulled by the 10-year sweep
 	docVersion: text('doc_version').notNull(), // LEGAL_VERSION accepted, e.g. 'v1.0'
-	checkboxText: text('checkbox_text').notNull(), // exact text shown at acceptance
+	checkboxText: text("").notNull(), // exact text shown at acceptance
 	// Stryker disable next-line StringLiteral: "" equivalent (drizzle falls back to property key)
 	ip: text('ip').notNull(), // event.getClientAddress() at acceptance
killedBy: consents table shape
statusReason: expected [ 'id', 'user_id', 'email', …(6) ] to deeply equal [ 'id', 'user_id', 'email', …(6) ]

[Killed] ArrowFunction
lib/server/db/schema.ts:239:4
 	userAgent: text('user_agent').notNull(),
 	marketingOptIn: integer('marketing_opt_in').notNull().default(0), // separate, unbundled LGPD consent
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('consents_user_id_idx').on(table.userId),
-	// Serves the 10-year retention sweep (email IS NOT NULL AND created_at <
-	// cutoff): partial, so it indexes only rows that still hold an e-mail.
-	index('consents_email_retention_idx').on(table.createdAt).where(sql`${table.email} is not null`)
-]);
+}, () => undefined);
 
killedBy: consents table shape
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
lib/server/db/schema.ts:239:15
 	userAgent: text('user_agent').notNull(),
 	marketingOptIn: integer('marketing_opt_in').notNull().default(0), // separate, unbundled LGPD consent
 	createdAt: text('created_at').notNull().default(sql`(strftime('%Y-%m-%dT%H:%M:%fZ', 'now'))`)
-}, (table) => [
-	index('consents_user_id_idx').on(table.userId),
-	// Serves the 10-year retention sweep (email IS NOT NULL AND created_at <
-	// cutoff): partial, so it indexes only rows that still hold an e-mail.
-	index('consents_email_retention_idx').on(table.createdAt).where(sql`${table.email} is not null`)
-]);
+}, (table) => []);
 
killedBy: consents user FK cascades; retention sweep index is partial on email
statusReason: consents index consents_user_id_idx: expected undefined to be defined
