[Killed] BlockStatement
src/lib/server/deletion.ts:60:18
 	tx: Pick<typeof db, 'delete'>,
 	channelIds: string[],
 	options?: { expectedOrgId?: string }
-): Promise<void> {
-	if (!channelIds.length) return;
-	if (options?.expectedOrgId) {
-		const removed = await tx
-			.delete(channels)
-			.where(and(inArray(channels.id, channelIds), eq(channels.orgId, options.expectedOrgId)))
-			.returning({ id: channels.id });
-		if (removed.length !== channelIds.length) {
-			throw new Error('deleteChannelRecords: channel tenancy changed mid-request — aborting');
-		}
-		await tx.delete(moderationActions).where(inArray(moderationActions.channelId, channelIds));
-		await tx.delete(comments).where(inArray(comments.channelId, channelIds));
-		await tx.delete(auditLog).where(inArray(auditLog.channelId, channelIds));
-		await tx.delete(rules).where(inArray(rules.channelId, channelIds));
-		return;
-	}
-	await tx.delete(moderationActions).where(inArray(moderationActions.channelId, channelIds));
-	await tx.delete(comments).where(inArray(comments.channelId, channelIds));
-	await tx.delete(auditLog).where(inArray(auditLog.channelId, channelIds));
-	await tx.delete(rules).where(inArray(rules.channelId, channelIds));
-	await tx.delete(channels).where(inArray(channels.id, channelIds));
-}
+): Promise<void> {}
 
 /**
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected { channel: 1, rules: 1, …(3) } to deeply equal { channel: +0, rules: +0, …(3) }

[Killed] ConditionalExpression
src/lib/server/deletion.ts:61:6
 	channelIds: string[],
 	options?: { expectedOrgId?: string }
 ): Promise<void> {
-	if (!channelIds.length) return;
+	if (true) return;
 	if (options?.expectedOrgId) {
 		const removed = await tx
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected { channel: 1, rules: 1, …(3) } to deeply equal { channel: +0, rules: +0, …(3) }

[Killed] BooleanLiteral
src/lib/server/deletion.ts:61:6
 	channelIds: string[],
 	options?: { expectedOrgId?: string }
 ): Promise<void> {
-	if (!channelIds.length) return;
+	if (channelIds.length) return;
 	if (options?.expectedOrgId) {
 		const removed = await tx
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/deletion.ts:62:6
 	options?: { expectedOrgId?: string }
 ): Promise<void> {
 	if (!channelIds.length) return;
-	if (options?.expectedOrgId) {
+	if (false) {
 		const removed = await tx
 			.delete(channels)
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/deletion.ts:62:6
 	options?: { expectedOrgId?: string }
 ): Promise<void> {
 	if (!channelIds.length) return;
-	if (options?.expectedOrgId) {
+	if (true) {
 		const removed = await tx
 			.delete(channels)
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Cannot read properties of undefined (reading 'expectedOrgId')

[Killed] ObjectLiteral
src/lib/server/deletion.ts:66:15
 		const removed = await tx
 			.delete(channels)
 			.where(and(inArray(channels.id, channelIds), eq(channels.orgId, options.expectedOrgId)))
-			.returning({ id: channels.id });
+			.returning({});
 		if (removed.length !== channelIds.length) {
 			throw new Error('deleteChannelRecords: channel tenancy changed mid-request — aborting');
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: expected [Function] to throw error including 'deleteChannelRecords: channel tenancy…' but got 'Failed query: delete from "channels" …'

[Killed] BlockStatement
src/lib/server/deletion.ts:67:45
 			.delete(channels)
 			.where(and(inArray(channels.id, channelIds), eq(channels.orgId, options.expectedOrgId)))
 			.returning({ id: channels.id });
-		if (removed.length !== channelIds.length) {
-			throw new Error('deleteChannelRecords: channel tenancy changed mid-request — aborting');
-		}
+		if (removed.length !== channelIds.length) {}
 		await tx.delete(moderationActions).where(inArray(moderationActions.channelId, channelIds));
 		await tx.delete(comments).where(inArray(comments.channelId, channelIds));
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/deletion.ts:67:7
 			.delete(channels)
 			.where(and(inArray(channels.id, channelIds), eq(channels.orgId, options.expectedOrgId)))
 			.returning({ id: channels.id });
-		if (removed.length !== channelIds.length) {
+		if (false) {
 			throw new Error('deleteChannelRecords: channel tenancy changed mid-request — aborting');
 		}
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/lib/server/deletion.ts:68:20
 			.where(and(inArray(channels.id, channelIds), eq(channels.orgId, options.expectedOrgId)))
 			.returning({ id: channels.id });
 		if (removed.length !== channelIds.length) {
-			throw new Error('deleteChannelRecords: channel tenancy changed mid-request — aborting');
+			throw new Error("");
 		}
 		await tx.delete(moderationActions).where(inArray(moderationActions.channelId, channelIds));
killedBy: deleteChannelRecords with an expected org aborts loudly when the channel changed tenancy mid-request
statusReason: expected [Function] to throw error including 'deleteChannelRecords: channel tenancy…' but got ''

[Killed] BlockStatement
src/lib/server/deletion.ts:89:65
  * @param now - The reference time in milliseconds since the Unix epoch
  * @returns The ISO timestamp 10 years before `now`
  */
-export function consentEmailCutoffIso(now = Date.now()): string {
-	return new Date(now - CONSENT_EMAIL_RETENTION_MS).toISOString();
-}
+export function consentEmailCutoffIso(now = Date.now()): string {}
 
 /**
killedBy: nullExpiredConsentEmails erases only the e-mail of consents older than 10 years
statusReason: Failed query: select "id" from "consents" where ("consents"."email" is not null and "consents"."created_at" < ?) limit ?
params: ,50

[Killed] ArithmeticOperator
src/lib/server/deletion.ts:90:18
  * @returns The ISO timestamp 10 years before `now`
  */
 export function consentEmailCutoffIso(now = Date.now()): string {
-	return new Date(now - CONSENT_EMAIL_RETENTION_MS).toISOString();
+	return new Date(now + CONSENT_EMAIL_RETENTION_MS).toISOString();
 }
 
killedBy: nullExpiredConsentEmails erases only the e-mail of consents older than 10 years
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/server/deletion.ts:126:12
 	const promotions: { orgId: string; successorId: string }[] = [];
 	await db.transaction(async (tx) => {
 		const user = await tx
-			.select({ googleSub: users.googleSub })
+			.select({})
 			.from(users)
 			.where(eq(users.id, userId))
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: select  from "users" where "users"."id" = ?
params: gone

[Killed] BlockStatement
src/lib/server/deletion.ts:130:55
 			.from(users)
 			.where(eq(users.id, userId))
 			.get();
-		if (!user || user.googleSub.startsWith('deleted:')) {
-			throw new Error(`deleteUserRecords: user ${userId} not found or already deleted`);
-		}
+		if (!user || user.googleSub.startsWith('deleted:')) {}
 		// Tenancy first: per-org fates (dissolve versus survive) decide which
 		// channels die with the account versus detach (team ones the user only
killedBy: deleteUserRecords rejects re-deleting an already tombstoned user
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/deletion.ts:130:7
 			.from(users)
 			.where(eq(users.id, userId))
 			.get();
-		if (!user || user.googleSub.startsWith('deleted:')) {
+		if (true) {
 			throw new Error(`deleteUserRecords: user ${userId} not found or already deleted`);
 		}
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: deleteUserRecords: user gone not found or already deleted

[Killed] ObjectLiteral
src/lib/server/deletion.ts:139:12
 		// org the user merely belongs to survives (its other members own it) —
 		// only the user's membership row leaves.
 		const personalOrgs = await tx
-			.select({ id: organizations.id })
+			.select({})
 			.from(organizations)
 			.where(eq(organizations.personalFor, userId))
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: select  from "organizations" where "organizations"."personal_for" = ?
params: gone

[Killed] ArrowFunction
src/lib/server/deletion.ts:143:43
 			.from(organizations)
 			.where(eq(organizations.personalFor, userId))
 			.all();
-		const personalOrgIds = personalOrgs.map((o) => o.id);
+		const personalOrgIds = personalOrgs.map(() => undefined);
 		if (personalOrgIds.length) {
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: select "user_id" from "memberships" where "memberships"."org_id" in (?)
params:

[Killed] ObjectLiteral
src/lib/server/deletion.ts:153:13
 			// org would destroy someone else's tenancy and channels. Fail loudly
 			// and abort the whole deletion.
 			const orgMembers = await tx
-				.select({ userId: memberships.userId })
+				.select({})
 				.from(memberships)
 				.where(inArray(memberships.orgId, personalOrgIds))
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: select  from "memberships" where "memberships"."org_id" in (?)
params: org-gone

[Killed] BlockStatement
src/lib/server/deletion.ts:158:100
 				.where(inArray(memberships.orgId, personalOrgIds))
 				.all();
-			if (orgMembers.length !== personalOrgIds.length || orgMembers.some((m) => m.userId !== userId)) {
-				console.error(`user ${userId}'s personal org membership is inconsistent (${orgMembers.length} rows) — refusing account deletion`);
-				throw new Error('personal organization has other members — contact support');
-			}
+			if (orgMembers.length !== personalOrgIds.length || orgMembers.some((m) => m.userId !== userId)) {}
 		}
 		// Every org the user belongs to decides its own fate. A sole-member org
killedBy: deleteUserRecords refuses to erase a personal org that somehow has a second member
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/lib/server/deletion.ts:158:8
 				.where(inArray(memberships.orgId, personalOrgIds))
 				.all();
-			if (orgMembers.length !== personalOrgIds.length || orgMembers.some((m) => m.userId !== userId)) {
+			if (orgMembers.length !== personalOrgIds.length && orgMembers.some(m => m.userId !== userId)) {
 				console.error(`user ${userId}'s personal org membership is inconsistent (${orgMembers.length} rows) — refusing account deletion`);
 				throw new Error('personal organization has other members — contact support');
killedBy: deleteUserRecords refuses when the sole personal-org member is someone else
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/lib/server/deletion.ts:177:44
 			.all();
 		// One batched query for every co-member across all the user's orgs —
 		// no per-org roundtrips (N+1) inside the transaction.
-		const memberOrgIds = userMemberships.map((m) => m.orgId);
+		const memberOrgIds = userMemberships.map(() => undefined);
 		const coMembers = memberOrgIds.length
 			? await tx
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: select "org_id", "user_id", "role", "created_at" from "memberships" where ("memberships"."org_id" in (?) and "memberships"."user_id" <> ?)
params: ,gone

[Killed] LogicalOperator
src/lib/server/deletion.ts:194:17
 		const coMembersByOrg = new Map<string, typeof coMembers>();
 		for (const row of coMembers) {
-			const list = coMembersByOrg.get(row.orgId) ?? [];
+			const list = coMembersByOrg.get(row.orgId) && [];
 			list.push(row);
 			coMembersByOrg.set(row.orgId, list);
killedBy: deleteUserRecords removes only the membership when a plain member of a shared org leaves
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/lib/server/deletion.ts:200:45
 		}
 		const dissolveOrgIds: string[] = [];
-		for (const membership of userMemberships) {
-			const others = coMembersByOrg.get(membership.orgId) ?? [];
-			if (!others.length) {
-				dissolveOrgIds.push(membership.orgId);
-				continue;
-			}
-			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
-				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
-				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
-				const promoted = await tx
-					.update(memberships)
-					.set({ role: 'owner' })
-					.where(and(eq(memberships.orgId, membership.orgId), eq(memberships.userId, successor.userId)))
-					.returning({ userId: memberships.userId });
-				// The row was selected in this same transaction; an empty RETURNING
-				// means the data changed underneath us — fail loudly, never log a
-				// promotion that did not persist.
-				if (!promoted.length) {
-					console.error(`account deletion: successor ${successor.userId} vanished from org ${membership.orgId} mid-transaction`);
-					throw new Error('ownership succession failed — contact support');
-				}
-				promotions.push({ orgId: membership.orgId, successorId: successor.userId });
-			}
-		}
+		for (const membership of userMemberships) {}
 		const chs = dissolveOrgIds.length
 			? await tx.select({ id: channels.id }).from(channels).where(inArray(channels.orgId, dissolveOrgIds)).all()
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: expected [ { id: 'UC-gone', …(18) } ] to deeply equal []

[Killed] LogicalOperator
src/lib/server/deletion.ts:201:19
 		const dissolveOrgIds: string[] = [];
 		for (const membership of userMemberships) {
-			const others = coMembersByOrg.get(membership.orgId) ?? [];
+			const others = coMembersByOrg.get(membership.orgId) && [];
 			if (!others.length) {
 				dissolveOrgIds.push(membership.orgId);
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/server/deletion.ts:202:8
 		const dissolveOrgIds: string[] = [];
 		for (const membership of userMemberships) {
 			const others = coMembersByOrg.get(membership.orgId) ?? [];
-			if (!others.length) {
+			if (true) {
 				dissolveOrgIds.push(membership.orgId);
 				continue;
killedBy: deleteUserRecords removes only the membership when a plain member of a shared org leaves
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/server/deletion.ts:202:24
 		const dissolveOrgIds: string[] = [];
 		for (const membership of userMemberships) {
 			const others = coMembersByOrg.get(membership.orgId) ?? [];
-			if (!others.length) {
-				dissolveOrgIds.push(membership.orgId);
-				continue;
-			}
+			if (!others.length) {}
 			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
 				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] ConditionalExpression
src/lib/server/deletion.ts:206:59
 				dissolveOrgIds.push(membership.orgId);
 				continue;
 			}
-			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
+			if (membership.role === 'owner' && !others.some((m) => true)) {
 				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
 				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/server/deletion.ts:206:59
 				dissolveOrgIds.push(membership.orgId);
 				continue;
 			}
-			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
+			if (membership.role === 'owner' && !others.some((m) => false)) {
 				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
 				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
killedBy: deleteUserRecords leaves roles untouched when another owner survives in a shared org
statusReason: expected [ …(3) ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/lib/server/deletion.ts:207:47
 				continue;
 			}
 			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
-				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
+				const ranked = [...others].sort((a, b) => true);
 				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
 				const promoted = await tx
killedBy: deleteUserRecords breaks succession seniority ties by userId, not insertion order
statusReason: expected 'account deletion: promoted user zz-me…' to contain 'aa-member'

[Killed] ConditionalExpression
src/lib/server/deletion.ts:207:47
 				continue;
 			}
 			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
-				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
+				const ranked = [...others].sort((a, b) => false);
 				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
 				const promoted = await tx
killedBy: deleteUserRecords breaks succession seniority ties by userId, not insertion order
statusReason: expected 'account deletion: promoted user zz-me…' to contain 'aa-member'

[Killed] EqualityOperator
src/lib/server/deletion.ts:208:42
 			}
 			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
 				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
-				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
+				const successor = ranked.find((m) => m.role !== 'admin') ?? ranked[0];
 				const promoted = await tx
 					.update(memberships)
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: expected 'account deletion: promoted user membe…' to contain 'admin-old'

[Killed] ConditionalExpression
src/lib/server/deletion.ts:208:42
 			}
 			if (membership.role === 'owner' && !others.some((m) => m.role === 'owner')) {
 				const ranked = [...others].sort((a, b) => a.createdAt.localeCompare(b.createdAt) || a.userId.localeCompare(b.userId));
-				const successor = ranked.find((m) => m.role === 'admin') ?? ranked[0];
+				const successor = ranked.find((m) => false) ?? ranked[0];
 				const promoted = await tx
 					.update(memberships)
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: expected 'account deletion: promoted user membe…' to contain 'admin-old'

[Killed] ConditionalExpression
src/lib/server/deletion.ts:217:9
 				// The row was selected in this same transaction; an empty RETURNING
 				// means the data changed underneath us — fail loudly, never log a
 				// promotion that did not persist.
-				if (!promoted.length) {
+				if (true) {
 					console.error(`account deletion: successor ${successor.userId} vanished from org ${membership.orgId} mid-transaction`);
 					throw new Error('ownership succession failed — contact support');
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: ownership succession failed — contact support

[Killed] BooleanLiteral
src/lib/server/deletion.ts:217:9
 				// The row was selected in this same transaction; an empty RETURNING
 				// means the data changed underneath us — fail loudly, never log a
 				// promotion that did not persist.
-				if (!promoted.length) {
+				if (promoted.length) {
 					console.error(`account deletion: successor ${successor.userId} vanished from org ${membership.orgId} mid-transaction`);
 					throw new Error('ownership succession failed — contact support');
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: ownership succession failed — contact support

[Killed] StringLiteral
src/lib/server/deletion.ts:219:22
 				// promotion that did not persist.
 				if (!promoted.length) {
 					console.error(`account deletion: successor ${successor.userId} vanished from org ${membership.orgId} mid-transaction`);
-					throw new Error('ownership succession failed — contact support');
+					throw new Error("");
 				}
 				promotions.push({ orgId: membership.orgId, successorId: successor.userId });
killedBy: deleteUserRecords fails loudly when the succession update matches no row
statusReason: expected [Function] to throw error including 'ownership succession failed — contact…' but got ''

[Killed] ArrayDeclaration
src/lib/server/deletion.ts:226:6
 		}
 		const chs = dissolveOrgIds.length
 			? await tx.select({ id: channels.id }).from(channels).where(inArray(channels.orgId, dissolveOrgIds)).all()
-			: [];
+			: ["Stryker was here"];
 		const channelIds = chs.map((ch) => ch.id);
 		// Every channel in a dissolved org dies with it, history included.
killedBy: deleteUserRecords works for a user with no channels
statusReason: Failed query: delete from "moderation_actions" where "moderation_actions"."channel_id" in (?)
params:

[Killed] ArrowFunction
src/lib/server/deletion.ts:227:30
 		const chs = dissolveOrgIds.length
 			? await tx.select({ id: channels.id }).from(channels).where(inArray(channels.orgId, dissolveOrgIds)).all()
 			: [];
-		const channelIds = chs.map((ch) => ch.id);
+		const channelIds = chs.map(() => undefined);
 		// Every channel in a dissolved org dies with it, history included.
 		await deleteChannelRecords(tx, channelIds);
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: Failed query: delete from "moderation_actions" where "moderation_actions"."channel_id" in (?)
params:

[Killed] ObjectLiteral
src/lib/server/deletion.ts:234:9
 		// with the team; the dead grant is wiped so nothing silently moderates.
 		await tx
 			.update(channels)
-			.set({ userId: null, refreshTokenEnc: WIPED_REFRESH_TOKEN })
+			.set({})
 			.where(eq(channels.userId, userId));
 		await tx.delete(sessions).where(eq(sessions.userId, userId));
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: No values to set

[Killed] BlockStatement
src/lib/server/deletion.ts:238:30
 			.where(eq(channels.userId, userId));
 		await tx.delete(sessions).where(eq(sessions.userId, userId));
 		// Stryker disable next-line ConditionalExpression: true equivalent — with zero dissolved orgs the deletes run inArray([]), which drizzle compiles to `false`: no rows match, nothing is deleted.
-		if (dissolveOrgIds.length) {
-			await tx.delete(invites).where(inArray(invites.orgId, dissolveOrgIds));
-			await tx.delete(memberships).where(inArray(memberships.orgId, dissolveOrgIds));
-			await tx.delete(organizations).where(inArray(organizations.id, dissolveOrgIds));
-		}
+		if (dissolveOrgIds.length) {}
 		await tx.delete(invites).where(eq(invites.createdBy, userId));
 		await tx.delete(memberships).where(eq(memberships.userId, userId));
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: expected [ { id: 'org-gone', …(5) } ] to deeply equal []

[Killed] StringLiteral
src/lib/server/deletion.ts:247:50
 		await tx.delete(memberships).where(eq(memberships.userId, userId));
 		await tx
 			.update(users)
-			.set({ googleSub: `deleted:${userId}`, email: '[deleted]', displayName: '[deleted]' })
+			.set({ googleSub: `deleted:${userId}`, email: "", displayName: '[deleted]' })
 			.where(eq(users.id, userId));
 	});
killedBy: deleteUserRecords erases every owned record and tombstones the user fully
statusReason: expected { id: 'gone', …(5) } to match object { googleSub: 'deleted:gone', …(2) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/server/deletion.ts:250:38
 			.set({ googleSub: `deleted:${userId}`, email: '[deleted]', displayName: '[deleted]' })
 			.where(eq(users.id, userId));
 	});
-	for (const promotion of promotions) {
-		console.info(
-			`account deletion: promoted user ${promotion.successorId} to owner of org ${promotion.orgId} (last owner ${userId} was deleted)`
-		);
-	}
+	for (const promotion of promotions) {}
 }
 
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/lib/server/deletion.ts:252:4
 	});
 	for (const promotion of promotions) {
 		console.info(
-			`account deletion: promoted user ${promotion.successorId} to owner of org ${promotion.orgId} (last owner ${userId} was deleted)`
+			``
 		);
 	}
killedBy: deleteUserRecords promotes the oldest admin when the last owner of a shared org deletes their account
statusReason: expected '' to contain 'admin-old'

[Killed] BooleanLiteral
src/lib/server/deletion.ts:275:6
 		.limit(CONSENT_SWEEP_BATCH)
 		.all();
-	if (!expired.length) return 0;
+	if (expired.length) return 0;
 	await db
 		.update(consents)
killedBy: nullExpiredConsentEmails erases only the e-mail of consents older than 10 years
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/server/deletion.ts:282:17
 		.where(
 			inArray(
 				consents.id,
-				expired.map((row) => row.id)
+				expired.map(() => undefined)
 			)
 		);
killedBy: nullExpiredConsentEmails erases only the e-mail of consents older than 10 years
statusReason: Failed query: update "consents" set "email" = ? where "consents"."id" in (?)
params: ,
