[Killed] BlockStatement
src/lib/server/http.ts:23:16
 const MAX_RETRIES = 3;
 
 export class DeadlineExceededError extends Error {
-	constructor() {
-		super('request deadline exceeded');
-	}
+	constructor() {}
 }
 
killedBy: fails before fetching when the deadline has passed
statusReason: expected [Function] to throw error including 'request deadline exceeded' but got 'Must call super constructor in derive…'

[Killed] BlockStatement
src/lib/server/http.ts:36:89
  * @returns The parsed JSON body.
  * @throws If the response status is not OK or the body is not valid JSON.
  */
-export async function jsonResponse(response: Response, label: string): Promise<unknown> {
-	const body = await response.text();
-	if (!response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
-	try {
-		return JSON.parse(body) as unknown;
-	} catch {
-		throw new Error(`${label} returned invalid JSON`);
-	}
-}
+export async function jsonResponse(response: Response, label: string): Promise<unknown> {}
 
 /**
killedBy: returns the maximum score across all moderation categories, including sexual
statusReason: moderation response is missing required category scores

[Killed] BooleanLiteral
src/lib/server/http.ts:38:6
  */
 export async function jsonResponse(response: Response, label: string): Promise<unknown> {
 	const body = await response.text();
-	if (!response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
+	if (response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
 	try {
 		return JSON.parse(body) as unknown;
killedBy: returns the maximum score across all moderation categories, including sexual

[Killed] ConditionalExpression
src/lib/server/http.ts:38:6
  */
 export async function jsonResponse(response: Response, label: string): Promise<unknown> {
 	const body = await response.text();
-	if (!response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
+	if (true) throw new Error(`${label} failed: ${response.status} ${body}`);
 	try {
 		return JSON.parse(body) as unknown;
killedBy: returns the maximum score across all moderation categories, including sexual

[Killed] BlockStatement
src/lib/server/http.ts:39:6
 export async function jsonResponse(response: Response, label: string): Promise<unknown> {
 	const body = await response.text();
 	if (!response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
-	try {
-		return JSON.parse(body) as unknown;
-	} catch {
+	try {} catch {
 		throw new Error(`${label} returned invalid JSON`);
 	}
killedBy: returns the maximum score across all moderation categories, including sexual
statusReason: moderation response is missing required category scores

[Killed] BlockStatement
src/lib/server/http.ts:41:10
 	if (!response.ok) throw new Error(`${label} failed: ${response.status} ${body}`);
 	try {
 		return JSON.parse(body) as unknown;
-	} catch {
-		throw new Error(`${label} returned invalid JSON`);
-	}
+	} catch {}
 }
 
killedBy: fails loudly when the chat response is not JSON
statusReason: expected [Function] to throw error including 'tone returned invalid JSON' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/lib/server/http.ts:55:3
 export function assertBeforeDeadline(deadline?: number) {
 	if (
-		deadline !== undefined &&
+		deadline === undefined &&
 		Date.now() >= deadline
 	) throw new DeadlineExceededError();
killedBy: assertBeforeDeadline throws once the deadline is reached
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/lib/server/http.ts:56:3
 	if (
 		deadline !== undefined &&
-		Date.now() >= deadline
+		true
 	) throw new DeadlineExceededError();
 }
killedBy: assertBeforeDeadline passes with no deadline or a future one
statusReason: expected [Function] to not throw an error but 'Error: request deadline exceeded' was thrown

[Killed] EqualityOperator
src/lib/server/http.ts:56:3
 	if (
 		deadline !== undefined &&
-		Date.now() >= deadline
+		Date.now() > deadline
 	) throw new DeadlineExceededError();
 }
killedBy: assertBeforeDeadline throws once the deadline is reached
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/lib/server/http.ts:67:76
  * @param retry - The zero-based retry attempt number
  * @returns The delay in milliseconds
  */
-function retryDelay(response: Response | undefined, retry: number): number {
-	const retryAfter = response?.headers.get('retry-after');
-	if (retryAfter) {
-		const seconds = Number(retryAfter);
-		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
-		const date = Date.parse(retryAfter);
-		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
-	}
-	return Math.min(1_000 * 2 ** retry, 10_000);
-}
+function retryDelay(response: Response | undefined, retry: number): number {}
 
 /**
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] OptionalChaining
src/lib/server/http.ts:68:21
  * @returns The delay in milliseconds
  */
 function retryDelay(response: Response | undefined, retry: number): number {
-	const retryAfter = response?.headers.get('retry-after');
+	const retryAfter = response.headers.get('retry-after');
 	if (retryAfter) {
 		const seconds = Number(retryAfter);
killedBy: retries server errors and network failures
statusReason: Cannot read properties of undefined (reading 'headers')

[Killed] ConditionalExpression
src/lib/server/http.ts:69:6
  */
 function retryDelay(response: Response | undefined, retry: number): number {
 	const retryAfter = response?.headers.get('retry-after');
-	if (retryAfter) {
+	if (false) {
 		const seconds = Number(retryAfter);
 		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
killedBy: honours Retry-After in seconds
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/server/http.ts:69:18
  */
 function retryDelay(response: Response | undefined, retry: number): number {
 	const retryAfter = response?.headers.get('retry-after');
-	if (retryAfter) {
-		const seconds = Number(retryAfter);
-		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
-		const date = Date.parse(retryAfter);
-		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
-	}
+	if (retryAfter) {}
 	return Math.min(1_000 * 2 ** retry, 10_000);
 }
killedBy: honours Retry-After in seconds
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/server/http.ts:71:40
 	const retryAfter = response?.headers.get('retry-after');
 	if (retryAfter) {
 		const seconds = Number(retryAfter);
-		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
+		if (Number.isFinite(seconds)) return Math.min(0, seconds * 1000);
 		const date = Date.parse(retryAfter);
 		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] ArithmeticOperator
src/lib/server/http.ts:71:52
 	const retryAfter = response?.headers.get('retry-after');
 	if (retryAfter) {
 		const seconds = Number(retryAfter);
-		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
+		if (Number.isFinite(seconds)) return Math.max(0, seconds / 1000);
 		const date = Date.parse(retryAfter);
 		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] ConditionalExpression
src/lib/server/http.ts:73:7
 		const seconds = Number(retryAfter);
 		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
 		const date = Date.parse(retryAfter);
-		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
+		if (true) return Math.max(0, date - Date.now());
 	}
 	return Math.min(1_000 * 2 ** retry, 10_000);
killedBy: honours Retry-After as an HTTP date and ignores an unparseable value
statusReason: expected [ 2000, NaN ] to deeply equal [ 2000, 2000 ]

[Killed] ArithmeticOperator
src/lib/server/http.ts:73:47
 		const seconds = Number(retryAfter);
 		if (Number.isFinite(seconds)) return Math.max(0, seconds * 1000);
 		const date = Date.parse(retryAfter);
-		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
+		if (!Number.isNaN(date)) return Math.max(0, date + Date.now());
 	}
 	return Math.min(1_000 * 2 ** retry, 10_000);
killedBy: honours Retry-After as an HTTP date and ignores an unparseable value
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/lib/server/http.ts:75:9
 		const date = Date.parse(retryAfter);
 		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
 	}
-	return Math.min(1_000 * 2 ** retry, 10_000);
+	return Math.max(1_000 * 2 ** retry, 10_000);
 }
 
killedBy: retries server errors and network failures
statusReason: request deadline exceeded

[Killed] ArithmeticOperator
src/lib/server/http.ts:75:18
 		const date = Date.parse(retryAfter);
 		if (!Number.isNaN(date)) return Math.max(0, date - Date.now());
 	}
-	return Math.min(1_000 * 2 ** retry, 10_000);
+	return Math.min(1_000 / 2 ** retry, 10_000);
 }
 
killedBy: backs off exponentially when a retryable response has no Retry-After header
statusReason: expected [ 1000, 500 ] to deeply equal [ 1000, 2000 ]

[Killed] LogicalOperator
src/lib/server/http.ts:87:3
 function retryable(response: Response | undefined): boolean {
 	return (
-		response === undefined ||
-		response.status === 429 ||
+		response === undefined && response.status === 429 ||
 		response.status >= 500
 	);
killedBy: retries transient responses but not client errors
statusReason: expected 429 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/server/http.ts:87:3
 function retryable(response: Response | undefined): boolean {
 	return (
-		response === undefined ||
+		response !== undefined ||
 		response.status === 429 ||
 		response.status >= 500
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/server/http.ts:88:3
 	return (
 		response === undefined ||
-		response.status === 429 ||
+		response.status !== 429 ||
 		response.status >= 500
 	);
killedBy: retries transient responses but not client errors
statusReason: expected 429 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/server/http.ts:88:3
 	return (
 		response === undefined ||
-		response.status === 429 ||
+		false ||
 		response.status >= 500
 	);
killedBy: retries transient responses but not client errors
statusReason: expected 429 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/server/http.ts:89:3
 		response === undefined ||
 		response.status === 429 ||
-		response.status >= 500
+		response.status < 500
 	);
 }
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/server/http.ts:89:3
 		response === undefined ||
 		response.status === 429 ||
-		response.status >= 500
+		response.status > 500
 	);
 }
killedBy: retries server errors and network failures
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/server/http.ts:93:52
 	);
 }
 
-function requestTimeout(deadline?: number): number {
-	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
-	if (remaining <= 0) throw new DeadlineExceededError();
-	return remaining;
-}
+function requestTimeout(deadline?: number): number {}
 
 type FetchAttempt = { response: Response } | { error: unknown };
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/server/http.ts:94:20
 }
 
 function requestTimeout(deadline?: number): number {
-	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
+	const remaining = true ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
 	if (remaining <= 0) throw new DeadlineExceededError();
 	return remaining;
killedBy: fails before fetching when the deadline has passed
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArithmeticOperator
src/lib/server/http.ts:94:79
 }
 
 function requestTimeout(deadline?: number): number {
-	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
+	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline + Date.now());
 	if (remaining <= 0) throw new DeadlineExceededError();
 	return remaining;
killedBy: fails before fetching when the deadline has passed
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/server/http.ts:95:6
 
 function requestTimeout(deadline?: number): number {
 	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
-	if (remaining <= 0) throw new DeadlineExceededError();
+	if (remaining > 0) throw new DeadlineExceededError();
 	return remaining;
 }
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/server/http.ts:95:6
 
 function requestTimeout(deadline?: number): number {
 	const remaining = deadline === undefined ? TIMEOUT_MS : Math.min(TIMEOUT_MS, deadline - Date.now());
-	if (remaining <= 0) throw new DeadlineExceededError();
+	if (true) throw new DeadlineExceededError();
 	return remaining;
 }
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/lib/server/http.ts:102:6
 type FetchAttempt = { response: Response } | { error: unknown };
 
 async function fetchAttempt(input: RequestInfo | URL, init: RequestInit, deadline?: number): Promise<FetchAttempt> {
-	try {
-		const timeout = AbortSignal.timeout(requestTimeout(deadline));
-		const signal = init.signal ? AbortSignal.any([init.signal, timeout]) : timeout;
-		return { response: await fetch(input, { ...init, signal }) };
-	} catch (error) {
+	try {} catch (error) {
 		if (init.signal?.aborted) throw error;
 		if (
killedBy: returns the maximum score across all moderation categories, including sexual
statusReason: Cannot use 'in' operator to search for 'response' in undefined

[Killed] ArrayDeclaration
src/lib/server/http.ts:104:48
 async function fetchAttempt(input: RequestInfo | URL, init: RequestInit, deadline?: number): Promise<FetchAttempt> {
 	try {
 		const timeout = AbortSignal.timeout(requestTimeout(deadline));
-		const signal = init.signal ? AbortSignal.any([init.signal, timeout]) : timeout;
+		const signal = init.signal ? AbortSignal.any([]) : timeout;
 		return { response: await fetch(input, { ...init, signal }) };
 	} catch (error) {
killedBy: honours a caller-provided abort signal instead of overwriting it
statusReason: promise resolved "Response { status: 200, statusText: '', headers: Headers { 'content-type': 'text/plain;charset=UTF-8' }, body: ReadableStream { locked: false, state: 'closed', supportsBYOB: true }, bodyUsed: false, ok: true, redirected: false, type: 'default', url: '' }" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/http.ts:107:7
 		const signal = init.signal ? AbortSignal.any([init.signal, timeout]) : timeout;
 		return { response: await fetch(input, { ...init, signal }) };
 	} catch (error) {
-		if (init.signal?.aborted) throw error;
+		if (false) throw error;
 		if (
killedBy: honours a caller-provided abort signal instead of overwriting it
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/server/http.ts:107:7
 		const signal = init.signal ? AbortSignal.any([init.signal, timeout]) : timeout;
 		return { response: await fetch(input, { ...init, signal }) };
 	} catch (error) {
-		if (init.signal?.aborted) throw error;
+		if (true) throw error;
 		if (
killedBy: retries server errors and network failures
statusReason: fetch failed

[Killed] EqualityOperator
src/lib/server/http.ts:111:4
 		if (
 			deadline !== undefined &&
-			Date.now() >= deadline
+			Date.now() < deadline
 		) throw new DeadlineExceededError();
 		return { error };
killedBy: retries server errors and network failures
statusReason: request deadline exceeded

[Killed] ObjectLiteral
src/lib/server/http.ts:113:10
 			deadline !== undefined &&
 			Date.now() >= deadline
 		) throw new DeadlineExceededError();
-		return { error };
+		return {};
 	}
 }
killedBy: setOpenAiKey: an unreachable OpenAI fails 502 and logs only a message, never the key or a raw error object
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/server/http.ts:117:102
 	}
 }
 
-function boundedRetryDelay(response: Response | undefined, retry: number, deadline?: number): number {
-	const delay = retryDelay(response, retry);
-	return deadline === undefined ? delay : Math.min(delay, Math.max(0, deadline - Date.now()));
-}
+function boundedRetryDelay(response: Response | undefined, retry: number, deadline?: number): number {}
 
 /**
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] ConditionalExpression
src/lib/server/http.ts:119:9
 
 function boundedRetryDelay(response: Response | undefined, retry: number, deadline?: number): number {
 	const delay = retryDelay(response, retry);
-	return deadline === undefined ? delay : Math.min(delay, Math.max(0, deadline - Date.now()));
+	return true ? delay : Math.min(delay, Math.max(0, deadline - Date.now()));
 }
 
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] ArithmeticOperator
src/lib/server/http.ts:119:70
 
 function boundedRetryDelay(response: Response | undefined, retry: number, deadline?: number): number {
 	const delay = retryDelay(response, retry);
-	return deadline === undefined ? delay : Math.min(delay, Math.max(0, deadline - Date.now()));
+	return deadline === undefined ? delay : Math.min(delay, Math.max(0, deadline + Date.now()));
 }
 
killedBy: caps retry sleeps at the remaining deadline
statusReason: expected last "setTimeout" call to have been called with [ Any<Function>, 10 ]

[Killed] BlockStatement
src/lib/server/http.ts:134:22
 	input: RequestInfo | URL,
 	init: RequestInit = {},
 	deadline?: number
-): Promise<Response> {
-	for (let retry = 0; ; retry++) {
-		const attempt = await fetchAttempt(input, init, deadline);
-		const response = 'response' in attempt ? attempt.response : undefined;
-		if (response && !retryable(response)) return response;
-		if (retry === MAX_RETRIES) {
-			if ('error' in attempt) throw attempt.error;
-			return attempt.response;
-		}
-		await new Promise((resolve) => setTimeout(resolve, boundedRetryDelay(response, retry, deadline)));
-	}
-}
+): Promise<Response> {}
 
killedBy: retries transient responses but not client errors
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/lib/server/http.ts:135:2
 	init: RequestInit = {},
 	deadline?: number
 ): Promise<Response> {
-	for (let retry = 0; ; retry++) {
-		const attempt = await fetchAttempt(input, init, deadline);
-		const response = 'response' in attempt ? attempt.response : undefined;
-		if (response && !retryable(response)) return response;
-		if (retry === MAX_RETRIES) {
-			if ('error' in attempt) throw attempt.error;
-			return attempt.response;
-		}
-		await new Promise((resolve) => setTimeout(resolve, boundedRetryDelay(response, retry, deadline)));
-	}
+	for (let retry = 0; false; retry++) {
+  const attempt = await fetchAttempt(input, init, deadline);
+  const response = 'response' in attempt ? attempt.response : undefined;
+  if (response && !retryable(response)) return response;
+  if (retry === MAX_RETRIES) {
+    if ('error' in attempt) throw attempt.error;
+    return attempt.response;
+  }
+  await new Promise(resolve => setTimeout(resolve, boundedRetryDelay(response, retry, deadline)));
+}
 }
 
killedBy: retries transient responses but not client errors
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] UpdateOperator
src/lib/server/http.ts:135:24
 	init: RequestInit = {},
 	deadline?: number
 ): Promise<Response> {
-	for (let retry = 0; ; retry++) {
+	for (let retry = 0; ; retry--) {
 		const attempt = await fetchAttempt(input, init, deadline);
 		const response = 'response' in attempt ? attempt.response : undefined;
killedBy: backs off exponentially when a retryable response has no Retry-After header
statusReason: expected [ 1000, 500 ] to deeply equal [ 1000, 2000 ]

[Killed] ConditionalExpression
src/lib/server/http.ts:138:7
 	for (let retry = 0; ; retry++) {
 		const attempt = await fetchAttempt(input, init, deadline);
 		const response = 'response' in attempt ? attempt.response : undefined;
-		if (response && !retryable(response)) return response;
+		if (true) return response;
 		if (retry === MAX_RETRIES) {
 			if ('error' in attempt) throw attempt.error;
killedBy: retries transient responses but not client errors
statusReason: expected 429 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/server/http.ts:138:7
 	for (let retry = 0; ; retry++) {
 		const attempt = await fetchAttempt(input, init, deadline);
 		const response = 'response' in attempt ? attempt.response : undefined;
-		if (response && !retryable(response)) return response;
+		if (false) return response;
 		if (retry === MAX_RETRIES) {
 			if ('error' in attempt) throw attempt.error;
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/server/http.ts:139:7
 		const attempt = await fetchAttempt(input, init, deadline);
 		const response = 'response' in attempt ? attempt.response : undefined;
 		if (response && !retryable(response)) return response;
-		if (retry === MAX_RETRIES) {
+		if (false) {
 			if ('error' in attempt) throw attempt.error;
 			return attempt.response;
killedBy: setOpenAiKey: an OpenAI server error fails 502, logs the status, and stores nothing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/server/http.ts:139:7
 		const attempt = await fetchAttempt(input, init, deadline);
 		const response = 'response' in attempt ? attempt.response : undefined;
 		if (response && !retryable(response)) return response;
-		if (retry === MAX_RETRIES) {
+		if (retry !== MAX_RETRIES) {
 			if ('error' in attempt) throw attempt.error;
 			return attempt.response;
killedBy: retries transient responses but not client errors
statusReason: expected 429 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/server/http.ts:140:8
 		const response = 'response' in attempt ? attempt.response : undefined;
 		if (response && !retryable(response)) return response;
 		if (retry === MAX_RETRIES) {
-			if ('error' in attempt) throw attempt.error;
+			if (true) throw attempt.error;
 			return attempt.response;
 		}
killedBy: setOpenAiKey: an OpenAI server error fails 502, logs the status, and stores nothing
statusReason: expected 'Could not reach OpenAI to validate th…' to be 'OpenAI could not validate the key rig…' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/http.ts:140:8
 		const response = 'response' in attempt ? attempt.response : undefined;
 		if (response && !retryable(response)) return response;
 		if (retry === MAX_RETRIES) {
-			if ('error' in attempt) throw attempt.error;
+			if (false) throw attempt.error;
 			return attempt.response;
 		}
killedBy: setOpenAiKey: an unreachable OpenAI fails 502 and logs only a message, never the key or a raw error object
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ArrowFunction
src/lib/server/http.ts:143:21
 			if ('error' in attempt) throw attempt.error;
 			return attempt.response;
 		}
-		await new Promise((resolve) => setTimeout(resolve, boundedRetryDelay(response, retry, deadline)));
+		await new Promise(() => undefined);
 	}
 }
killedBy: retries transient responses but not client errors
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
