[Killed] BlockStatement
src/lib/server/legal.ts:99:56
 
 type PendingEntry = PendingConsent & { state: string; ts: number };
 
-function readEntries(cookies: Cookies): PendingEntry[] {
-	const raw = cookies.get(PENDING_CONSENT_COOKIE);
-	// Stryker disable next-line ConditionalExpression: equivalent — without the guard, decrypt(undefined/'') throws and the catch below returns the same []
-	if (!raw) return [];
-	let parsed: unknown;
-	try {
-		parsed = JSON.parse(decrypt(raw));
-	}
-	// Stryker disable next-line BlockStatement: equivalent — an empty catch leaves parsed undefined, and the Array.isArray check below returns the same []
-	catch {
-		return [];
-	}
-	if (!Array.isArray(parsed)) return [];
-	return parsed.filter(
-		(e): e is PendingEntry =>
-			typeof e === 'object' && e !== null && typeof (e as PendingEntry).state === 'string'
-	) as PendingEntry[];
-}
+function readEntries(cookies: Cookies): PendingEntry[] {}
 
 function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 302 }

[Killed] BooleanLiteral
src/lib/server/legal.ts:102:6
 function readEntries(cookies: Cookies): PendingEntry[] {
 	const raw = cookies.get(PENDING_CONSENT_COOKIE);
 	// Stryker disable next-line ConditionalExpression: equivalent — without the guard, decrypt(undefined/'') throws and the catch below returns the same []
-	if (!raw) return [];
+	if (raw) return [];
 	let parsed: unknown;
 	try {
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ArrayDeclaration
src/lib/server/legal.ts:102:19
 function readEntries(cookies: Cookies): PendingEntry[] {
 	const raw = cookies.get(PENDING_CONSENT_COOKIE);
 	// Stryker disable next-line ConditionalExpression: equivalent — without the guard, decrypt(undefined/'') throws and the catch below returns the same []
-	if (!raw) return [];
+	if (!raw) return ["Stryker was here"];
 	let parsed: unknown;
 	try {
killedBy: clearing with no cookie present deletes rather than writing a new cookie
statusReason: expected [] to deep equally contain { …(2) }

[Killed] BlockStatement
src/lib/server/legal.ts:118:72
 	) as PendingEntry[];
 }
 
-function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {
-	if (entries.length === 0) {
-		cookies.delete(PENDING_CONSENT_COOKIE, { path: '/' });
-		return;
-	}
-	cookies.set(PENDING_CONSENT_COOKIE, encrypt(JSON.stringify(entries)), {
-		path: '/',
-		httpOnly: true,
-		sameSite: 'lax',
-		secure: cookieSecure(),
-		maxAge: PENDING_TTL_MS / 1000
-	});
-}
+function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {}
 
 /**
killedBy: park writes an encrypted httpOnly cookie with path, SameSite=Lax, Secure, and a 600s maxAge
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/lib/server/legal.ts:119:6
 }
 
 function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {
-	if (entries.length === 0) {
+	if (false) {
 		cookies.delete(PENDING_CONSENT_COOKIE, { path: '/' });
 		return;
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected [] to deep equally contain { …(2) }

[Killed] BlockStatement
src/lib/server/legal.ts:119:28
 }
 
 function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {
-	if (entries.length === 0) {
-		cookies.delete(PENDING_CONSENT_COOKIE, { path: '/' });
-		return;
-	}
+	if (entries.length === 0) {}
 	cookies.set(PENDING_CONSENT_COOKIE, encrypt(JSON.stringify(entries)), {
 		path: '/',
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected [] to deep equally contain { …(2) }

[Killed] ObjectLiteral
src/lib/server/legal.ts:120:42
 
 function writeEntries(cookies: Cookies, entries: PendingEntry[]): void {
 	if (entries.length === 0) {
-		cookies.delete(PENDING_CONSENT_COOKIE, { path: '/' });
+		cookies.delete(PENDING_CONSENT_COOKIE, {});
 		return;
 	}
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected [ { …(2) } ] to deep equally contain { …(2) }

[Killed] ObjectLiteral
src/lib/server/legal.ts:123:72
 		cookies.delete(PENDING_CONSENT_COOKIE, { path: '/' });
 		return;
 	}
-	cookies.set(PENDING_CONSENT_COOKIE, encrypt(JSON.stringify(entries)), {
-		path: '/',
-		httpOnly: true,
-		sameSite: 'lax',
-		secure: cookieSecure(),
-		maxAge: PENDING_TTL_MS / 1000
-	});
+	cookies.set(PENDING_CONSENT_COOKIE, encrypt(JSON.stringify(entries)), {});
 }
 
killedBy: callback with a new identity parks a pending consent and redirects to /consent without creating anything
statusReason: expected {} to match object { httpOnly: true, …(2) }

[Killed] StringLiteral
src/lib/server/legal.ts:124:9
 		return;
 	}
 	cookies.set(PENDING_CONSENT_COOKIE, encrypt(JSON.stringify(entries)), {
-		path: '/',
+		path: "",
 		httpOnly: true,
 		sameSite: 'lax',
killedBy: park writes an encrypted httpOnly cookie with path, SameSite=Lax, Secure, and a 600s maxAge
statusReason: expected { path: '', httpOnly: true, …(3) } to deeply equal { path: '/', httpOnly: true, …(3) }

[Killed] ArithmeticOperator
src/lib/server/legal.ts:128:11
 		httpOnly: true,
 		sameSite: 'lax',
 		secure: cookieSecure(),
-		maxAge: PENDING_TTL_MS / 1000
+		maxAge: PENDING_TTL_MS * 1000
 	});
 }
killedBy: park writes an encrypted httpOnly cookie with path, SameSite=Lax, Secure, and a 600s maxAge
statusReason: expected { path: '/', httpOnly: true, …(3) } to deeply equal { path: '/', httpOnly: true, …(3) }

[Killed] BlockStatement
src/lib/server/legal.ts:137:100
  * short-lived encrypted httpOnly cookie. AES-GCM makes the payload tamper-proof
  * and confidential, so account creation claims cannot be forged client-side.
  */
-export function parkPendingConsent(cookies: Cookies, state: string, payload: PendingConsent): void {
-	const now = Date.now();
-	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
-	);
-	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_CONSENTS));
-}
+export function parkPendingConsent(cookies: Cookies, state: string, payload: PendingConsent): void {}
 
 /**
killedBy: park writes an encrypted httpOnly cookie with path, SameSite=Lax, Secure, and a 600s maxAge
statusReason: expected undefined to be truthy

[Killed] MethodExpression
src/lib/server/legal.ts:139:18
  */
 export function parkPendingConsent(cookies: Cookies, state: string, payload: PendingConsent): void {
 	const now = Date.now();
-	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
-	);
+	const entries = readEntries(cookies);
 	entries.push({ ...payload, state, ts: now });
 	writeEntries(cookies, entries.slice(-MAX_PENDING_CONSENTS));
killedBy: parking a state that is already parked replaces the old entry instead of duplicating it
statusReason: expected [ { kind: 'new', …(5) }, …(1) ] to have a length of 1 but got 2

[Killed] EqualityOperator
src/lib/server/legal.ts:140:31
 export function parkPendingConsent(cookies: Cookies, state: string, payload: PendingConsent): void {
 	const now = Date.now();
 	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
+		(e) => e.state !== state && now - e.ts < PENDING_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
killedBy: an entry exactly at the TTL boundary is still inside the window when parking
statusReason: expected [ 'state-new' ] to deeply equal [ 'state-edge', 'state-new' ]

[Killed] ConditionalExpression
src/lib/server/legal.ts:140:10
 export function parkPendingConsent(cookies: Cookies, state: string, payload: PendingConsent): void {
 	const now = Date.now();
 	const entries = readEntries(cookies).filter(
-		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
+		(e) => true
 	);
 	entries.push({ ...payload, state, ts: now });
killedBy: parking a state that is already parked replaces the old entry instead of duplicating it
statusReason: expected [ { kind: 'new', …(5) }, …(1) ] to have a length of 1 but got 2

[Killed] ObjectLiteral
src/lib/server/legal.ts:142:15
 	const entries = readEntries(cookies).filter(
 		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
 	);
-	entries.push({ ...payload, state, ts: now });
+	entries.push({});
 	writeEntries(cookies, entries.slice(-MAX_PENDING_CONSENTS));
 }
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] UnaryOperator
src/lib/server/legal.ts:143:38
 		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_CONSENTS));
+	writeEntries(cookies, entries.slice(+MAX_PENDING_CONSENTS));
 }
 
killedBy: park writes an encrypted httpOnly cookie with path, SameSite=Lax, Secure, and a 600s maxAge
statusReason: expected undefined to be truthy

[Killed] MethodExpression
src/lib/server/legal.ts:143:24
 		(e) => e.state !== state && now - e.ts <= PENDING_TTL_MS
 	);
 	entries.push({ ...payload, state, ts: now });
-	writeEntries(cookies, entries.slice(-MAX_PENDING_CONSENTS));
+	writeEntries(cookies, entries);
 }
 
killedBy: parking keeps only the newest 5 entries, dropping the oldest first
statusReason: expected [ 's1', 's2', 's3', 's4', 's5', 's6' ] to deeply equal [ 's2', 's3', 's4', 's5', 's6' ]

[Killed] BlockStatement
src/lib/server/legal.ts:151:92
  * entry is missing, tampered, malformed, or expired — the caller redirects to
  * /login so the flow restarts cleanly. Other flows' entries are untouched.
  */
-export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
-	const entry = readEntries(cookies).find((e) => e.state === state);
-	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
-	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
-		return { kind: 'existing', userId: entry.userId };
-	}
-	if (
-		entry.kind === 'new' &&
-		typeof entry.sub === 'string' &&
-		entry.sub &&
-		typeof entry.email === 'string' &&
-		entry.email &&
-		typeof entry.displayName === 'string' &&
-		entry.displayName
-	) {
-		return { kind: 'new', sub: entry.sub, email: entry.email, displayName: entry.displayName };
-	}
-	return null;
-}
+export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {}
 
 /** Clears only this flow's parked identity once its consent flow completes. */
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected undefined to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
src/lib/server/legal.ts:152:49
  * /login so the flow restarts cleanly. Other flows' entries are untouched.
  */
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
-	const entry = readEntries(cookies).find((e) => e.state === state);
+	const entry = readEntries(cookies).find((e) => true);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
 	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
killedBy: reading a state that was never parked returns null and leaves the parked entry intact
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] EqualityOperator
src/lib/server/legal.ts:152:49
  * /login so the flow restarts cleanly. Other flows' entries are untouched.
  */
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
-	const entry = readEntries(cookies).find((e) => e.state === state);
+	const entry = readEntries(cookies).find((e) => e.state !== state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
 	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
src/lib/server/legal.ts:153:48
  */
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
-	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
+	if (!entry || typeof entry.ts !== 'number' || false) return null;
 	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
 		return { kind: 'existing', userId: entry.userId };
killedBy: a parked identity expires after the TTL and reads as null
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/legal.ts:153:6
  */
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
-	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
+	if (true) return null;
 	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
 		return { kind: 'existing', userId: entry.userId };
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] LogicalOperator
src/lib/server/legal.ts:154:6
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
-	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
+	if (entry.kind === 'existing' || typeof entry.userId === 'string' && entry.userId) {
 		return { kind: 'existing', userId: entry.userId };
 	}
killedBy: an existing-kind entry with a non-string userId reads as null
statusReason: expected { kind: 'existing', userId: 123 } to be null

[Killed] BlockStatement
src/lib/server/legal.ts:154:85
 export function readPendingConsent(cookies: Cookies, state: string): PendingConsent | null {
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
-	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
-		return { kind: 'existing', userId: entry.userId };
-	}
+	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {}
 	if (
 		entry.kind === 'new' &&
killedBy: a parked existing-user identity round-trips with kind "existing"
statusReason: expected null to deeply equal { kind: 'existing', userId: 'user-1' }

[Killed] ObjectLiteral
src/lib/server/legal.ts:155:10
 	const entry = readEntries(cookies).find((e) => e.state === state);
 	if (!entry || typeof entry.ts !== 'number' || Date.now() - entry.ts > PENDING_TTL_MS) return null;
 	if (entry.kind === 'existing' && typeof entry.userId === 'string' && entry.userId) {
-		return { kind: 'existing', userId: entry.userId };
+		return {};
 	}
 	if (
killedBy: a parked existing-user identity round-trips with kind "existing"
statusReason: expected {} to deeply equal { kind: 'existing', userId: 'user-1' }

[Killed] ConditionalExpression
src/lib/server/legal.ts:158:3
 		return { kind: 'existing', userId: entry.userId };
 	}
 	if (
-		entry.kind === 'new' &&
-		typeof entry.sub === 'string' &&
-		entry.sub &&
-		typeof entry.email === 'string' &&
-		entry.email &&
-		typeof entry.displayName === 'string' &&
-		entry.displayName
+		false
 	) {
 		return { kind: 'new', sub: entry.sub, email: entry.email, displayName: entry.displayName };
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] LogicalOperator
src/lib/server/legal.ts:158:3
 		return { kind: 'existing', userId: entry.userId };
 	}
 	if (
-		entry.kind === 'new' &&
-		typeof entry.sub === 'string' &&
-		entry.sub &&
+		entry.kind === 'new' && typeof entry.sub === 'string' || entry.sub &&
 		typeof entry.email === 'string' &&
 		entry.email &&
killedBy: an existing-kind entry missing a valid userId is not reinterpreted as a new signup
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] EqualityOperator
src/lib/server/legal.ts:159:3
 	}
 	if (
 		entry.kind === 'new' &&
-		typeof entry.sub === 'string' &&
+		typeof entry.sub !== 'string' &&
 		entry.sub &&
 		typeof entry.email === 'string' &&
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
src/lib/server/legal.ts:159:3
 	}
 	if (
 		entry.kind === 'new' &&
-		typeof entry.sub === 'string' &&
+		true &&
 		entry.sub &&
 		typeof entry.email === 'string' &&
killedBy: a new-kind entry with non-string sub reads as null
statusReason: expected { kind: 'new', sub: 123, …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/legal.ts:161:3
 		entry.kind === 'new' &&
 		typeof entry.sub === 'string' &&
 		entry.sub &&
-		typeof entry.email === 'string' &&
+		true &&
 		entry.email &&
 		typeof entry.displayName === 'string' &&
killedBy: a new-kind entry with non-string email reads as null
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] EqualityOperator
src/lib/server/legal.ts:161:3
 		entry.kind === 'new' &&
 		typeof entry.sub === 'string' &&
 		entry.sub &&
-		typeof entry.email === 'string' &&
+		typeof entry.email !== 'string' &&
 		entry.email &&
 		typeof entry.displayName === 'string' &&
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] EqualityOperator
src/lib/server/legal.ts:163:3
 		entry.sub &&
 		typeof entry.email === 'string' &&
 		entry.email &&
-		typeof entry.displayName === 'string' &&
+		typeof entry.displayName !== 'string' &&
 		entry.displayName
 	) {
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ConditionalExpression
src/lib/server/legal.ts:163:3
 		entry.sub &&
 		typeof entry.email === 'string' &&
 		entry.email &&
-		typeof entry.displayName === 'string' &&
+		true &&
 		entry.displayName
 	) {
killedBy: a new-kind entry with non-string displayName reads as null
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] BlockStatement
src/lib/server/legal.ts:165:4
 		entry.email &&
 		typeof entry.displayName === 'string' &&
 		entry.displayName
-	) {
-		return { kind: 'new', sub: entry.sub, email: entry.email, displayName: entry.displayName };
-	}
+	) {}
 	return null;
 }
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected null to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] ObjectLiteral
src/lib/server/legal.ts:166:10
 		typeof entry.displayName === 'string' &&
 		entry.displayName
 	) {
-		return { kind: 'new', sub: entry.sub, email: entry.email, displayName: entry.displayName };
+		return {};
 	}
 	return null;
killedBy: a parked new identity round-trips exactly, without the flow state or timestamp
statusReason: expected {} to deeply equal { kind: 'new', sub: 'sub-1', …(2) }

[Killed] BlockStatement
src/lib/server/legal.ts:172:76
 }
 
 /** Clears only this flow's parked identity once its consent flow completes. */
-export function clearPendingConsent(cookies: Cookies, state: string): void {
-	writeEntries(
-		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
-	);
-}
+export function clearPendingConsent(cookies: Cookies, state: string): void {}
 
 /**
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/legal.ts:175:38
 export function clearPendingConsent(cookies: Cookies, state: string): void {
 	writeEntries(
 		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
+		readEntries(cookies).filter((e) => false)
 	);
 }
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected null to deeply equal { kind: 'existing', userId: 'user-1' }

[Killed] EqualityOperator
src/lib/server/legal.ts:175:38
 export function clearPendingConsent(cookies: Cookies, state: string): void {
 	writeEntries(
 		cookies,
-		readEntries(cookies).filter((e) => e.state !== state)
+		readEntries(cookies).filter((e) => e.state === state)
 	);
 }
killedBy: clearing removes only the target flow; removing the last entry deletes the cookie at path /
statusReason: expected { kind: 'new', sub: 'sub-1', …(2) } to be null

[Killed] BlockStatement
src/lib/server/legal.ts:185:75
  * layout (re-consent redirect for still-active sessions after a doc bump),
  * and /consent itself (a current user goes straight to /dashboard).
  */
-export async function hasCurrentConsent(userId: string): Promise<boolean> {
-	const row = await db
-		.select({ id: consents.id })
-		.from(consents)
-		.where(and(eq(consents.userId, userId), eq(consents.docVersion, LEGAL_VERSION)))
-		.get();
-	return row !== undefined;
-}
+export async function hasCurrentConsent(userId: string): Promise<boolean> {}
 
killedBy: a signed-in user with a current consent row loads normally
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
src/lib/server/legal.ts:187:11
  */
 export async function hasCurrentConsent(userId: string): Promise<boolean> {
 	const row = await db
-		.select({ id: consents.id })
+		.select({})
 		.from(consents)
 		.where(and(eq(consents.userId, userId), eq(consents.docVersion, LEGAL_VERSION)))
killedBy: callback with a consented existing user creates a session and redirects to the dashboard
statusReason: expected Error: Failed query: select  from "consen… { …(2) } to match object { status: 302 }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/legal.ts:191:9
 		.from(consents)
 		.where(and(eq(consents.userId, userId), eq(consents.docVersion, LEGAL_VERSION)))
 		.get();
-	return row !== undefined;
+	return true;
 }
 
killedBy: a signed-in user with no consent row is sent to /consent before any app page
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to match object { status: 302, location: '/consent' }
(10 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/legal.ts:191:9
 		.from(consents)
 		.where(and(eq(consents.userId, userId), eq(consents.docVersion, LEGAL_VERSION)))
 		.get();
-	return row !== undefined;
+	return false;
 }
 
killedBy: a signed-in user with a current consent row loads normally
statusReason: Target cannot be null or undefined.
