[Killed] BlockStatement
src/lib/server/org.ts:39:50
 }
 
 /** Narrows a raw memberships.role string to OrgRole, failing loudly on data bugs. */
-export function asOrgRole(role: string): OrgRole {
-	if (role === 'owner' || role === 'admin' || role === 'member') return role;
-	throw new Error(`unknown membership role: ${role}`);
-}
+export function asOrgRole(role: string): OrgRole {}
 
 /** All of a user's memberships joined to their orgs, oldest membership first (ties by org id), in SQL. */
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/lib/server/org.ts:40:6
 
 /** Narrows a raw memberships.role string to OrgRole, failing loudly on data bugs. */
 export function asOrgRole(role: string): OrgRole {
-	if (role === 'owner' || role === 'admin' || role === 'member') return role;
+	if (role === 'owner' && role === 'admin' || role === 'member') return role;
 	throw new Error(`unknown membership role: ${role}`);
 }
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: unknown membership role: owner

[Killed] EqualityOperator
src/lib/server/org.ts:40:6
 
 /** Narrows a raw memberships.role string to OrgRole, failing loudly on data bugs. */
 export function asOrgRole(role: string): OrgRole {
-	if (role === 'owner' || role === 'admin' || role === 'member') return role;
+	if (role !== 'owner' || role === 'admin' || role === 'member') return role;
 	throw new Error(`unknown membership role: ${role}`);
 }
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: unknown membership role: owner

[Killed] StringLiteral
src/lib/server/org.ts:41:18
 /** Narrows a raw memberships.role string to OrgRole, failing loudly on data bugs. */
 export function asOrgRole(role: string): OrgRole {
 	if (role === 'owner' || role === 'admin' || role === 'member') return role;
-	throw new Error(`unknown membership role: ${role}`);
+	throw new Error(``);
 }
 
killedBy: asOrgRole throws on an unknown membership role instead of returning it
statusReason: expected [Function] to throw error including 'unknown membership role: bogus' but got ''

[Killed] BlockStatement
src/lib/server/org.ts:45:52
 }
 
 /** All of a user's memberships joined to their orgs, oldest membership first (ties by org id), in SQL. */
-async function fetchMembershipRows(userId: string) {
-	return db
-		.select({
-			orgId: organizations.id,
-			orgName: organizations.name,
-			plan: organizations.plan,
-			role: memberships.role,
-			membershipCreatedAt: memberships.createdAt
-		})
-		.from(memberships)
-		.innerJoin(organizations, eq(memberships.orgId, organizations.id))
-		.where(eq(memberships.userId, userId))
-		.orderBy(memberships.createdAt, memberships.orgId)
-		.all();
-}
+async function fetchMembershipRows(userId: string) {}
 
 /**
killedBy: a signed-in user with a current consent row loads normally
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/lib/server/org.ts:72:59
 export async function resolveActiveOrg(
 	userId: string,
 	activeOrgId: string | null
-): Promise<{ org: OrgContext; fellBack: boolean } | null> {
-	const rows = await fetchMembershipRows(userId);
-	if (rows.length === 0) return null;
-	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
-	return {
-		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
-		fellBack: activeOrgId !== null && chosen.orgId !== activeOrgId
-	};
-}
+): Promise<{ org: OrgContext; fellBack: boolean } | null> {}
 
 /** Every org the user belongs to, oldest membership first (ties by org id) — feeds the nav team switcher. */
killedBy: memberships tying on created_at resolve deterministically, consistently with the org list
statusReason: expected undefined to be 'org-a' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/org.ts:74:6
 	activeOrgId: string | null
 ): Promise<{ org: OrgContext; fellBack: boolean } | null> {
 	const rows = await fetchMembershipRows(userId);
-	if (rows.length === 0) return null;
+	if (false) return null;
 	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
 	return {
killedBy: a user with zero memberships makes getSessionUser throw, never sign out
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 500, body: { …(1) } }

[Killed] ConditionalExpression
src/lib/server/org.ts:74:6
 	activeOrgId: string | null
 ): Promise<{ org: OrgContext; fellBack: boolean } | null> {
 	const rows = await fetchMembershipRows(userId);
-	if (rows.length === 0) return null;
+	if (true) return null;
 	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
 	return {
killedBy: memberships tying on created_at resolve deterministically, consistently with the org list
statusReason: expected undefined to be 'org-a' // Object.is equality

[Killed] LogicalOperator
src/lib/server/org.ts:75:17
 ): Promise<{ org: OrgContext; fellBack: boolean } | null> {
 	const rows = await fetchMembershipRows(userId);
 	if (rows.length === 0) return null;
-	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
+	const chosen = rows.find(r => r.orgId === activeOrgId) && rows[0];
 	return {
 		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
killedBy: memberships tying on created_at resolve deterministically, consistently with the org list
statusReason: Cannot read properties of undefined (reading 'orgId')

[Killed] EqualityOperator
src/lib/server/org.ts:75:34
 ): Promise<{ org: OrgContext; fellBack: boolean } | null> {
 	const rows = await fetchMembershipRows(userId);
 	if (rows.length === 0) return null;
-	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
+	const chosen = rows.find((r) => r.orgId !== activeOrgId) ?? rows[0];
 	return {
 		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
killedBy: resolveActiveOrg picks the explicit active org even when it is not the oldest membership
statusReason: expected { orgId: 'org-a', …(3) } to deeply equal { orgId: 'org-b', …(3) }

[Killed] ObjectLiteral
src/lib/server/org.ts:76:9
 	const rows = await fetchMembershipRows(userId);
 	if (rows.length === 0) return null;
 	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
-	return {
-		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
-		fellBack: activeOrgId !== null && chosen.orgId !== activeOrgId
-	};
+	return {};
 }
 
killedBy: creates a session and resolves it back to the user
statusReason: Cannot read properties of undefined (reading 'plan')

[Killed] ConditionalExpression
src/lib/server/org.ts:78:13
 	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
 	return {
 		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
-		fellBack: activeOrgId !== null && chosen.orgId !== activeOrgId
+		fellBack: false
 	};
 }
killedBy: fellBack is false when the session had no explicit active org
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/org.ts:78:13
 	const chosen = rows.find((r) => r.orgId === activeOrgId) ?? rows[0];
 	return {
 		org: { orgId: chosen.orgId, orgName: chosen.orgName, orgRole: asOrgRole(chosen.role), plan: chosen.plan },
-		fellBack: activeOrgId !== null && chosen.orgId !== activeOrgId
+		fellBack: true
 	};
 }
killedBy: fellBack is false when the session had no explicit active org
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/server/org.ts:83:58
 }
 
 /** Every org the user belongs to, oldest membership first (ties by org id) — feeds the nav team switcher. */
-export async function listOrgMemberships(userId: string) {
-	const rows = await fetchMembershipRows(userId);
-	return rows.map(({ orgId, orgName, role }) => ({ orgId, name: orgName, role: asOrgRole(role) }));
-}
+export async function listOrgMemberships(userId: string) {}
 
 /**
killedBy: memberships tying on created_at resolve deterministically, consistently with the org list
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/server/org.ts:85:18
 /** Every org the user belongs to, oldest membership first (ties by org id) — feeds the nav team switcher. */
 export async function listOrgMemberships(userId: string) {
 	const rows = await fetchMembershipRows(userId);
-	return rows.map(({ orgId, orgName, role }) => ({ orgId, name: orgName, role: asOrgRole(role) }));
+	return rows.map(() => undefined);
 }
 
killedBy: memberships tying on created_at resolve deterministically, consistently with the org list
statusReason: Cannot read properties of undefined (reading 'orgId')

[Killed] BlockStatement
src/lib/server/org.ts:99:20
 export async function ensurePersonalOrg(
 	handle: Pick<typeof db, 'insert' | 'select'>,
 	user: { id: string; displayName: string }
-): Promise<string> {
-	const existing = await handle
-		.select({ id: organizations.id })
-		.from(organizations)
-		.where(eq(organizations.personalFor, user.id))
-		.get();
-	if (existing) return existing.id;
-	const orgId = randomBytes(16).toString('hex');
-	await handle.insert(organizations).values({ id: orgId, name: user.displayName, personalFor: user.id });
-	await handle.insert(memberships).values({ userId: user.id, orgId, role: 'owner' });
-	return orgId;
-}
+): Promise<string> {}
 
 export const INVITE_TTL_MS = 7 * 24 * 60 * 60 * 1000; // 7 days
killedBy: ensurePersonalOrg is idempotent when called repeatedly for the same signup
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/lib/server/org.ts:101:11
 	user: { id: string; displayName: string }
 ): Promise<string> {
 	const existing = await handle
-		.select({ id: organizations.id })
+		.select({})
 		.from(organizations)
 		.where(eq(organizations.personalFor, user.id))
killedBy: ensurePersonalOrg is idempotent when called repeatedly for the same signup
statusReason: Failed query: select  from "organizations" where "organizations"."personal_for" = ?
params: user-1

[Killed] ConditionalExpression
src/lib/server/org.ts:105:6
 		.from(organizations)
 		.where(eq(organizations.personalFor, user.id))
 		.get();
-	if (existing) return existing.id;
+	if (true) return existing.id;
 	const orgId = randomBytes(16).toString('hex');
 	await handle.insert(organizations).values({ id: orgId, name: user.displayName, personalFor: user.id });
killedBy: ensurePersonalOrg is idempotent when called repeatedly for the same signup
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/lib/server/org.ts:105:6
 		.from(organizations)
 		.where(eq(organizations.personalFor, user.id))
 		.get();
-	if (existing) return existing.id;
+	if (false) return existing.id;
 	const orgId = randomBytes(16).toString('hex');
 	await handle.insert(organizations).values({ id: orgId, name: user.displayName, personalFor: user.id });
killedBy: ensurePersonalOrg is idempotent when called repeatedly for the same signup
statusReason: Failed query: insert into "organizations" ("id", "name", "plan", "personal_for", "openai_key_enc", "created_at") values (?, ?, ?, ?, null, (strftime('%Y-%m-%dT%H:%M:%fZ', 'now')))
params: c44e7db7d982bda213987e169dc00d1e,user-1,free,user-1

[Killed] StringLiteral
src/lib/server/org.ts:106:41
 		.where(eq(organizations.personalFor, user.id))
 		.get();
 	if (existing) return existing.id;
-	const orgId = randomBytes(16).toString('hex');
+	const orgId = randomBytes(16).toString("");
 	await handle.insert(organizations).values({ id: orgId, name: user.displayName, personalFor: user.id });
 	await handle.insert(memberships).values({ userId: user.id, orgId, role: 'owner' });
killedBy: ensurePersonalOrg is idempotent when called repeatedly for the same signup
statusReason: Unknown encoding:

[Killed] BlockStatement
src/lib/server/org.ts:122:78
  * unknown role ranks below every minimum — fail closed, never open
  * (`undefined < N` is false, which would silently allow).
  */
-export function requireRole(role: OrgRole, minimum: 'admin' | 'owner'): void {
-	if ((ROLE_RANK[role] ?? -1) < ROLE_RANK[minimum]) throw error(403, 'your team role does not allow this');
-}
+export function requireRole(role: OrgRole, minimum: 'admin' | 'owner'): void {}
 
 async function membershipOf(userId: string, orgId: string) {
killedBy: rename: member is a raw 403; owner errors are wrapped as form failures
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:123:6
  * (`undefined < N` is false, which would silently allow).
  */
 export function requireRole(role: OrgRole, minimum: 'admin' | 'owner'): void {
-	if ((ROLE_RANK[role] ?? -1) < ROLE_RANK[minimum]) throw error(403, 'your team role does not allow this');
+	if (true) throw error(403, 'your team role does not allow this');
 }
 
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/lib/server/org.ts:123:7
  * (`undefined < N` is false, which would silently allow).
  */
 export function requireRole(role: OrgRole, minimum: 'admin' | 'owner'): void {
-	if ((ROLE_RANK[role] ?? -1) < ROLE_RANK[minimum]) throw error(403, 'your team role does not allow this');
+	if ((ROLE_RANK[role] && -1) < ROLE_RANK[minimum]) throw error(403, 'your team role does not allow this');
 }
 
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/server/org.ts:126:60
 	if ((ROLE_RANK[role] ?? -1) < ROLE_RANK[minimum]) throw error(403, 'your team role does not allow this');
 }
 
-async function membershipOf(userId: string, orgId: string) {
-	return db
-		.select({ role: memberships.role })
-		.from(memberships)
-		.where(and(eq(memberships.userId, userId), eq(memberships.orgId, orgId)))
-		.get();
-}
+async function membershipOf(userId: string, orgId: string) {}
 
 /** Throws 400 when the org is a personal team — personal teams can never have members or invites. */
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/server/org.ts:135:63
 }
 
 /** Throws 400 when the org is a personal team — personal teams can never have members or invites. */
-async function requireSharedOrg(orgId: string): Promise<void> {
-	const org = await db.select({ personalFor: organizations.personalFor }).from(organizations).where(eq(organizations.id, orgId)).get();
-	if (org && org.personalFor !== null) {
-		throw error(400, "personal teams can't have members — create a shared team to collaborate");
-	}
-}
+async function requireSharedOrg(orgId: string): Promise<void> {}
 
 /** Creates a shared org (personal_for NULL) and makes the creator its owner. */
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: promise resolved "'8332814397860554a208bbab56589ec7853d1…'" instead of rejecting

[Killed] BlockStatement
src/lib/server/org.ts:137:39
 /** Throws 400 when the org is a personal team — personal teams can never have members or invites. */
 async function requireSharedOrg(orgId: string): Promise<void> {
 	const org = await db.select({ personalFor: organizations.personalFor }).from(organizations).where(eq(organizations.id, orgId)).get();
-	if (org && org.personalFor !== null) {
-		throw error(400, "personal teams can't have members — create a shared team to collaborate");
-	}
+	if (org && org.personalFor !== null) {}
 }
 
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: promise resolved "'67cc1857eba4652bc416f8e22fdaac88d9248…'" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:137:13
 /** Throws 400 when the org is a personal team — personal teams can never have members or invites. */
 async function requireSharedOrg(orgId: string): Promise<void> {
 	const org = await db.select({ personalFor: organizations.personalFor }).from(organizations).where(eq(organizations.id, orgId)).get();
-	if (org && org.personalFor !== null) {
+	if (org && true) {
 		throw error(400, "personal teams can't have members — create a shared team to collaborate");
 	}
killedBy: invite: member is 403; bad role is a 400 failure; success returns the token
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/lib/server/org.ts:138:20
 async function requireSharedOrg(orgId: string): Promise<void> {
 	const org = await db.select({ personalFor: organizations.personalFor }).from(organizations).where(eq(organizations.id, orgId)).get();
 	if (org && org.personalFor !== null) {
-		throw error(400, "personal teams can't have members — create a shared team to collaborate");
+		throw error(400, "");
 	}
 }
killedBy: createInvite guard messages: 404 outsider, 403 member, 400 personal, 400 bad role
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] BlockStatement
src/lib/server/org.ts:143:80
 }
 
 /** Creates a shared org (personal_for NULL) and makes the creator its owner. */
-export async function createOrg(userId: string, name: string): Promise<string> {
-	const trimmed = name.trim();
-	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
-	const orgId = randomBytes(16).toString('hex');
-	await db.transaction(async (tx) => {
-		await tx.insert(organizations).values({ id: orgId, name: trimmed });
-		await tx.insert(memberships).values({ userId, orgId, role: 'owner' });
-	});
-	return orgId;
-}
+export async function createOrg(userId: string, name: string): Promise<string> {}
 
 /** Renames an org. Caller must be admin+ in it (checked here, not by the route). */
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: Failed query: select "id", "name", "plan", "personal_for", "openai_key_enc", "created_at" from "organizations" where "organizations"."id" = ?
params:

[Killed] MethodExpression
src/lib/server/org.ts:144:18
 
 /** Creates a shared org (personal_for NULL) and makes the creator its owner. */
 export async function createOrg(userId: string, name: string): Promise<string> {
-	const trimmed = name.trim();
+	const trimmed = name;
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const orgId = randomBytes(16).toString('hex');
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: expected '  Team Rocket  ' to be 'Team Rocket' // Object.is equality

[Killed] LogicalOperator
src/lib/server/org.ts:145:6
 /** Creates a shared org (personal_for NULL) and makes the creator its owner. */
 export async function createOrg(userId: string, name: string): Promise<string> {
 	const trimmed = name.trim();
-	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
+	if (!trimmed && trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const orgId = randomBytes(16).toString('hex');
 	await db.transaction(async (tx) => {
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: promise resolved "'567692f9fe45e02c3f0edcc49de4cc1e'" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:145:18
 /** Creates a shared org (personal_for NULL) and makes the creator its owner. */
 export async function createOrg(userId: string, name: string): Promise<string> {
 	const trimmed = name.trim();
-	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
+	if (!trimmed || false) throw error(400, 'team name must be 1–80 characters');
 	const orgId = randomBytes(16).toString('hex');
 	await db.transaction(async (tx) => {
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: promise resolved "'790891f1e07dc28eb801bf0d8b867ab8'" instead of rejecting

[Killed] BlockStatement
src/lib/server/org.ts:147:37
 	const trimmed = name.trim();
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const orgId = randomBytes(16).toString('hex');
-	await db.transaction(async (tx) => {
-		await tx.insert(organizations).values({ id: orgId, name: trimmed });
-		await tx.insert(memberships).values({ userId, orgId, role: 'owner' });
-	});
+	await db.transaction(async (tx) => {});
 	return orgId;
 }
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: expected undefined to be 'Team Rocket' // Object.is equality

[Killed] StringLiteral
src/lib/server/org.ts:149:62
 	const orgId = randomBytes(16).toString('hex');
 	await db.transaction(async (tx) => {
 		await tx.insert(organizations).values({ id: orgId, name: trimmed });
-		await tx.insert(memberships).values({ userId, orgId, role: 'owner' });
+		await tx.insert(memberships).values({ userId, orgId, role: "" });
 	});
 	return orgId;
killedBy: createOrg makes a shared org and the creator its owner; bad names are 400
statusReason: expected '' to be 'owner' // Object.is equality

[Killed] MethodExpression
src/lib/server/org.ts:156:18
 
 /** Renames an org. Caller must be admin+ in it (checked here, not by the route). */
 export async function renameOrg(userId: string, orgId: string, name: string): Promise<void> {
-	const trimmed = name.trim();
+	const trimmed = name;
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const m = await membershipOf(userId, orgId);
killedBy: renameOrg stores the trimmed name, and whitespace-only is 400
statusReason: expected '  Padded Name  ' to be 'Padded Name' // Object.is equality

[Killed] EqualityOperator
src/lib/server/org.ts:157:18
 /** Renames an org. Caller must be admin+ in it (checked here, not by the route). */
 export async function renameOrg(userId: string, orgId: string, name: string): Promise<void> {
 	const trimmed = name.trim();
-	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
+	if (!trimmed || trimmed.length <= 80) throw error(400, 'team name must be 1–80 characters');
 	const m = await membershipOf(userId, orgId);
 	if (!m) throw error(404, 'team not found');
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: expected { Object (status, body) } to match object { status: 404 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/lib/server/org.ts:159:6
 	const trimmed = name.trim();
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const m = await membershipOf(userId, orgId);
-	if (!m) throw error(404, 'team not found');
+	if (m) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	const updated = await db
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] ConditionalExpression
src/lib/server/org.ts:159:6
 	const trimmed = name.trim();
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const m = await membershipOf(userId, orgId);
-	if (!m) throw error(404, 'team not found');
+	if (false) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	const updated = await db
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] StringLiteral
src/lib/server/org.ts:160:33
 	if (!trimmed || trimmed.length > 80) throw error(400, 'team name must be 1–80 characters');
 	const m = await membershipOf(userId, orgId);
 	if (!m) throw error(404, 'team not found');
-	requireRole(asOrgRole(m.role), 'admin');
+	requireRole(asOrgRole(m.role), "");
 	const updated = await db
 		.update(organizations)
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/lib/server/org.ts:165:14
 		.update(organizations)
 		.set({ name: trimmed })
 		.where(eq(organizations.id, orgId))
-		.returning({ id: organizations.id });
+		.returning({});
 	if (updated.length === 0) throw error(404, 'team not found');
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: Failed query: update "organizations" set "name" = ? where "organizations"."id" = ? returning 
params: Renamed,org-1

[Killed] EqualityOperator
src/lib/server/org.ts:167:6
 		.where(eq(organizations.id, orgId))
 		.returning({ id: organizations.id });
-	if (updated.length === 0) throw error(404, 'team not found');
+	if (updated.length !== 0) throw error(404, 'team not found');
 }
 
killedBy: renameOrg requires admin; 404 for non-members, 403 for members, 400 for bad names
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/server/org.ts:171:110
 }
 
 /** Creates a single-use invite link token. Caller must be admin+; role is admin|member, never owner. */
-export async function createInvite(userId: string, orgId: string, role: 'admin' | 'member'): Promise<string> {
-	const m = await membershipOf(userId, orgId);
-	if (!m) throw error(404, 'team not found');
-	requireRole(asOrgRole(m.role), 'admin');
-	if (role !== 'admin' && role !== 'member') throw error(400, 'invite role must be admin or member');
-	await requireSharedOrg(orgId);
-	const token = randomBytes(32).toString('hex');
-	await db.insert(invites).values({
-		token,
-		orgId,
-		role,
-		createdBy: userId,
-		expiresAt: new Date(Date.now() + INVITE_TTL_MS).toISOString()
-	});
-	return token;
-}
+export async function createInvite(userId: string, orgId: string, role: 'admin' | 'member'): Promise<string> {}
 
 /** Revokes (deletes) an open invite. Caller must be admin+ in the invite's org. */
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:173:6
 /** Creates a single-use invite link token. Caller must be admin+; role is admin|member, never owner. */
 export async function createInvite(userId: string, orgId: string, role: 'admin' | 'member'): Promise<string> {
 	const m = await membershipOf(userId, orgId);
-	if (!m) throw error(404, 'team not found');
+	if (true) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	if (role !== 'admin' && role !== 'member') throw error(400, 'invite role must be admin or member');
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/lib/server/org.ts:175:6
 	const m = await membershipOf(userId, orgId);
 	if (!m) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
-	if (role !== 'admin' && role !== 'member') throw error(400, 'invite role must be admin or member');
+	if (role === 'admin' && role !== 'member') throw error(400, 'invite role must be admin or member');
 	await requireSharedOrg(orgId);
 	const token = randomBytes(32).toString('hex');
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: promise resolved "'01e074621d05cfc280783fbe9b0ea9595fd59…'" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:175:6
 	const m = await membershipOf(userId, orgId);
 	if (!m) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
-	if (role !== 'admin' && role !== 'member') throw error(400, 'invite role must be admin or member');
+	if (false) throw error(400, 'invite role must be admin or member');
 	await requireSharedOrg(orgId);
 	const token = randomBytes(32).toString('hex');
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: promise resolved "'ffb8f2636709b52e019d3815005b64276398b…'" instead of rejecting

[Killed] ArithmeticOperator
src/lib/server/org.ts:183:23
 		orgId,
 		role,
 		createdBy: userId,
-		expiresAt: new Date(Date.now() + INVITE_TTL_MS).toISOString()
+		expiresAt: new Date(Date.now() - INVITE_TTL_MS).toISOString()
 	});
 	return token;
killedBy: createInvite is admin-only, member|admin roles only, and rejects personal orgs
statusReason: expected 1785426851158 to be greater than 1786031651159
