[Killed] BlockStatement
src/lib/server/org.ts:189:82
 }
 
 /** Revokes (deletes) an open invite. Caller must be admin+ in the invite's org. */
-export async function revokeInvite(userId: string, token: string): Promise<void> {
-	const inv = await db.select().from(invites).where(eq(invites.token, token)).get();
-	if (!inv) throw error(404, 'invite not found');
-	const m = await membershipOf(userId, inv.orgId);
-	if (!m) throw error(404, 'invite not found'); // never leak which org an invite serves
-	requireRole(asOrgRole(m.role), 'admin');
-	await db.delete(invites).where(eq(invites.token, token));
-}
+export async function revokeInvite(userId: string, token: string): Promise<void> {}
 
 export interface InvitePreview {
killedBy: revokeInvite deletes the invite, admin of its org only
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/lib/server/org.ts:191:6
 /** Revokes (deletes) an open invite. Caller must be admin+ in the invite's org. */
 export async function revokeInvite(userId: string, token: string): Promise<void> {
 	const inv = await db.select().from(invites).where(eq(invites.token, token)).get();
-	if (!inv) throw error(404, 'invite not found');
+	if (inv) throw error(404, 'invite not found');
 	const m = await membershipOf(userId, inv.orgId);
 	if (!m) throw error(404, 'invite not found'); // never leak which org an invite serves
killedBy: revokeInvite deletes the invite, admin of its org only
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] ConditionalExpression
src/lib/server/org.ts:191:6
 /** Revokes (deletes) an open invite. Caller must be admin+ in the invite's org. */
 export async function revokeInvite(userId: string, token: string): Promise<void> {
 	const inv = await db.select().from(invites).where(eq(invites.token, token)).get();
-	if (!inv) throw error(404, 'invite not found');
+	if (false) throw error(404, 'invite not found');
 	const m = await membershipOf(userId, inv.orgId);
 	if (!m) throw error(404, 'invite not found'); // never leak which org an invite serves
killedBy: revokeInvite deletes the invite, admin of its org only
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] BooleanLiteral
src/lib/server/org.ts:193:6
 	const inv = await db.select().from(invites).where(eq(invites.token, token)).get();
 	if (!inv) throw error(404, 'invite not found');
 	const m = await membershipOf(userId, inv.orgId);
-	if (!m) throw error(404, 'invite not found'); // never leak which org an invite serves
+	if (m) throw error(404, 'invite not found'); // never leak which org an invite serves
 	requireRole(asOrgRole(m.role), 'admin');
 	await db.delete(invites).where(eq(invites.token, token));
killedBy: revokeInvite deletes the invite, admin of its org only
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] ConditionalExpression
src/lib/server/org.ts:193:6
 	const inv = await db.select().from(invites).where(eq(invites.token, token)).get();
 	if (!inv) throw error(404, 'invite not found');
 	const m = await membershipOf(userId, inv.orgId);
-	if (!m) throw error(404, 'invite not found'); // never leak which org an invite serves
+	if (true) throw error(404, 'invite not found'); // never leak which org an invite serves
 	requireRole(asOrgRole(m.role), 'admin');
 	await db.delete(invites).where(eq(invites.token, token));
killedBy: revokeInvite deletes the invite, admin of its org only
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/server/org.ts:206:80
 }
 
 /** Invite row joined to its org. Shared by previewInvite and acceptInvite; pass a transaction as `handle` for atomic check-and-burn. */
-async function inviteWithOrg(handle: Pick<typeof db, 'select'>, token: string) {
-	return handle
-		.select({
-			orgId: invites.orgId,
-			role: invites.role,
-			expiresAt: invites.expiresAt,
-			acceptedBy: invites.acceptedBy,
-			orgName: organizations.name,
-			personalFor: organizations.personalFor
-		})
-		.from(invites)
-		.innerJoin(organizations, eq(invites.orgId, organizations.id))
-		.where(eq(invites.token, token))
-		.get();
-}
+async function inviteWithOrg(handle: Pick<typeof db, 'select'>, token: string) {}
 
 /** Public preview for /invite/[token] — returns null for unknown tokens (never leak org existence). */
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/lib/server/org.ts:208:11
 /** Invite row joined to its org. Shared by previewInvite and acceptInvite; pass a transaction as `handle` for atomic check-and-burn. */
 async function inviteWithOrg(handle: Pick<typeof db, 'select'>, token: string) {
 	return handle
-		.select({
-			orgId: invites.orgId,
-			role: invites.role,
-			expiresAt: invites.expiresAt,
-			acceptedBy: invites.acceptedBy,
-			orgName: organizations.name,
-			personalFor: organizations.personalFor
-		})
+		.select({})
 		.from(invites)
 		.innerJoin(organizations, eq(invites.orgId, organizations.id))
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: Failed query: select  from "invites" inner join "organizations" on "invites"."org_id" = "organizations"."id" where "invites"."token" = ?
params: 9629ca2501e28fc4edf6219dabf27e77e3e14a657bb7c8c28f5af5880472b82d

[Killed] BlockStatement
src/lib/server/org.ts:223:83
 }
 
 /** Public preview for /invite/[token] — returns null for unknown tokens (never leak org existence). */
-export async function previewInvite(token: string): Promise<InvitePreview | null> {
-	const row = await inviteWithOrg(db, token);
-	if (!row) return null;
-	return {
-		orgName: row.orgName,
-		role: asInviteRole(token, row.role),
-		expired: Date.parse(row.expiresAt) <= Date.now(),
-		accepted: row.acceptedBy !== null
-	};
-}
+export async function previewInvite(token: string): Promise<InvitePreview | null> {}
 
 /** Narrows a raw invites.role string, failing loudly on data bugs (never silently drop rows). */
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/server/org.ts:225:6
 /** Public preview for /invite/[token] — returns null for unknown tokens (never leak org existence). */
 export async function previewInvite(token: string): Promise<InvitePreview | null> {
 	const row = await inviteWithOrg(db, token);
-	if (!row) return null;
+	if (false) return null;
 	return {
 		orgName: row.orgName,
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: Cannot read properties of undefined (reading 'orgName')

[Killed] ConditionalExpression
src/lib/server/org.ts:225:6
 /** Public preview for /invite/[token] — returns null for unknown tokens (never leak org existence). */
 export async function previewInvite(token: string): Promise<InvitePreview | null> {
 	const row = await inviteWithOrg(db, token);
-	if (!row) return null;
+	if (true) return null;
 	return {
 		orgName: row.orgName,
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected null to deeply equal { orgName: 'org-1', …(3) }

[Killed] ObjectLiteral
src/lib/server/org.ts:226:9
 export async function previewInvite(token: string): Promise<InvitePreview | null> {
 	const row = await inviteWithOrg(db, token);
 	if (!row) return null;
-	return {
-		orgName: row.orgName,
-		role: asInviteRole(token, row.role),
-		expired: Date.parse(row.expiresAt) <= Date.now(),
-		accepted: row.acceptedBy !== null
-	};
+	return {};
 }
 
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected {} to deeply equal { orgName: 'org-1', …(3) }

[Killed] EqualityOperator
src/lib/server/org.ts:229:12
 	return {
 		orgName: row.orgName,
 		role: asInviteRole(token, row.role),
-		expired: Date.parse(row.expiresAt) <= Date.now(),
+		expired: Date.parse(row.expiresAt) < Date.now(),
 		accepted: row.acceptedBy !== null
 	};
killedBy: an invite expiring exactly now counts as expired in preview and accept
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/org.ts:229:12
 	return {
 		orgName: row.orgName,
 		role: asInviteRole(token, row.role),
-		expired: Date.parse(row.expiresAt) <= Date.now(),
+		expired: false,
 		accepted: row.acceptedBy !== null
 	};
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/server/org.ts:230:13
 		orgName: row.orgName,
 		role: asInviteRole(token, row.role),
 		expired: Date.parse(row.expiresAt) <= Date.now(),
-		accepted: row.acceptedBy !== null
+		accepted: row.acceptedBy === null
 	};
 }
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected { orgName: 'org-1', …(3) } to deeply equal { orgName: 'org-1', …(3) }

[Killed] ConditionalExpression
src/lib/server/org.ts:230:13
 		orgName: row.orgName,
 		role: asInviteRole(token, row.role),
 		expired: Date.parse(row.expiresAt) <= Date.now(),
-		accepted: row.acceptedBy !== null
+		accepted: false
 	};
 }
killedBy: previewInvite returns null for unknown tokens and flags expired/accepted
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/server/org.ts:235:72
 }
 
 /** Narrows a raw invites.role string, failing loudly on data bugs (never silently drop rows). */
-function asInviteRole(token: string, role: string): 'admin' | 'member' {
-	if (role === 'admin' || role === 'member') return role;
-	throw new Error(`invite ${token} has unknown role: ${role}`);
-}
+function asInviteRole(token: string, role: string): 'admin' | 'member' {}
 
 /**
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: Failed query: insert into "memberships" ("user_id", "org_id", "role", "created_at") values (?, ?, null, (strftime('%Y-%m-%dT%H:%M:%fZ', 'now')))
params: joiner-1,org-1

[Killed] ConditionalExpression
src/lib/server/org.ts:236:6
 
 /** Narrows a raw invites.role string, failing loudly on data bugs (never silently drop rows). */
 function asInviteRole(token: string, role: string): 'admin' | 'member' {
-	if (role === 'admin' || role === 'member') return role;
+	if (false) return role;
 	throw new Error(`invite ${token} has unknown role: ${role}`);
 }
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: invite 9bb260775ec202440e21f7beedb6f591b6f3d123a7d008c43dd27f34fdc2d2b6 has unknown role: admin

[Killed] ConditionalExpression
src/lib/server/org.ts:236:6
 
 /** Narrows a raw invites.role string, failing loudly on data bugs (never silently drop rows). */
 function asInviteRole(token: string, role: string): 'admin' | 'member' {
-	if (role === 'admin' || role === 'member') return role;
+	if (false || role === 'member') return role;
 	throw new Error(`invite ${token} has unknown role: ${role}`);
 }
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: invite 2d1a41acb9f4c2af718f21b4ef79e20db3c85c6e4be09bea29280c2ee7e260d9 has unknown role: admin

[Killed] StringLiteral
src/lib/server/org.ts:237:18
 /** Narrows a raw invites.role string, failing loudly on data bugs (never silently drop rows). */
 function asInviteRole(token: string, role: string): 'admin' | 'member' {
 	if (role === 'admin' || role === 'member') return role;
-	throw new Error(`invite ${token} has unknown role: ${role}`);
+	throw new Error(``);
 }
 
killedBy: asInviteRole throws on an unknown invite role instead of returning it
statusReason: expected [Function] to throw error including 'invite tok-bogus has unknown role: bo…' but got ''

[Killed] BooleanLiteral
src/lib/server/org.ts:251:7
 export async function acceptInvite(userId: string, sessionToken: string, token: string): Promise<string> {
 	return db.transaction(async (tx) => {
 		const inv = await inviteWithOrg(tx, token);
-		if (!inv || inv.acceptedBy !== null || Date.parse(inv.expiresAt) <= Date.now()) {
+		if (inv || inv.acceptedBy !== null || Date.parse(inv.expiresAt) <= Date.now()) {
 			throw error(410, 'this invite link is no longer valid — ask for a new one');
 		}
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:251:42
 export async function acceptInvite(userId: string, sessionToken: string, token: string): Promise<string> {
 	return db.transaction(async (tx) => {
 		const inv = await inviteWithOrg(tx, token);
-		if (!inv || inv.acceptedBy !== null || Date.parse(inv.expiresAt) <= Date.now()) {
+		if (!inv || inv.acceptedBy !== null || false) {
 			throw error(410, 'this invite link is no longer valid — ask for a new one');
 		}
killedBy: acceptInvite is 410 for expired and unknown tokens, and rejects personal-org invites
statusReason: promise resolved "'org-1'" instead of rejecting

[Killed] EqualityOperator
src/lib/server/org.ts:256:7
 		}
 		// createInvite blocks personal-org invites at write time; refuse any legacy
 		// or hand-written row here too — personal teams can never gain members.
-		if (inv.personalFor !== null) throw error(400, 'this invite points at a personal team — ask for a shared-team invite');
+		if (inv.personalFor === null) throw error(400, 'this invite points at a personal team — ask for a shared-team invite');
 		const role = asInviteRole(token, inv.role);
 		const existing = await tx
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:256:7
 		}
 		// createInvite blocks personal-org invites at write time; refuse any legacy
 		// or hand-written row here too — personal teams can never gain members.
-		if (inv.personalFor !== null) throw error(400, 'this invite points at a personal team — ask for a shared-team invite');
+		if (false) throw error(400, 'this invite points at a personal team — ask for a shared-team invite');
 		const role = asInviteRole(token, inv.role);
 		const existing = await tx
killedBy: acceptInvite is 410 for expired and unknown tokens, and rejects personal-org invites
statusReason: promise resolved "'org-personal'" instead of rejecting

[Killed] ObjectLiteral
src/lib/server/org.ts:259:12
 		if (inv.personalFor !== null) throw error(400, 'this invite points at a personal team — ask for a shared-team invite');
 		const role = asInviteRole(token, inv.role);
 		const existing = await tx
-			.select({ role: memberships.role })
+			.select({})
 			.from(memberships)
 			.where(and(eq(memberships.userId, userId), eq(memberships.orgId, inv.orgId)))
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: Failed query: select  from "memberships" where ("memberships"."user_id" = ? and "memberships"."org_id" = ?)
params: joiner-1,org-1

[Killed] EqualityOperator
src/lib/server/org.ts:271:7
 			.where(and(eq(invites.token, token), isNull(invites.acceptedBy)))
 			.returning({ token: invites.token });
-		if (claimed.length === 0) throw error(410, 'this invite link is no longer valid — ask for a new one');
+		if (claimed.length !== 0) throw error(410, 'this invite link is no longer valid — ask for a new one');
 		if (!existing) {
 			await tx.insert(memberships).values({ userId, orgId: inv.orgId, role });
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/server/org.ts:272:18
 			.returning({ token: invites.token });
 		if (claimed.length === 0) throw error(410, 'this invite link is no longer valid — ask for a new one');
-		if (!existing) {
-			await tx.insert(memberships).values({ userId, orgId: inv.orgId, role });
-		}
+		if (!existing) {}
 		// Scoped AND verified: the session must be the caller's own (PR #52 review).
 		const switched = await tx
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lib/server/org.ts:272:7
 			.returning({ token: invites.token });
 		if (claimed.length === 0) throw error(410, 'this invite link is no longer valid — ask for a new one');
-		if (!existing) {
+		if (existing) {
 			await tx.insert(memberships).values({ userId, orgId: inv.orgId, role });
 		}
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/lib/server/org.ts:280:15
 			.update(sessions)
 			.set({ activeOrgId: inv.orgId })
 			.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
-			.returning({ id: sessions.id });
+			.returning({});
 		if (switched.length === 0) throw error(401, 'sign-in required');
 		return inv.orgId;
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: Failed query: update "sessions" set "active_org_id" = ? where ("sessions"."id" = ? and "sessions"."user_id" = ?) returning 
params: org-1,sess-1,joiner-1

[Killed] ConditionalExpression
src/lib/server/org.ts:281:7
 			.set({ activeOrgId: inv.orgId })
 			.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
 			.returning({ id: sessions.id });
-		if (switched.length === 0) throw error(401, 'sign-in required');
+		if (false) throw error(401, 'sign-in required');
 		return inv.orgId;
 	});
killedBy: acceptInvite with a mismatched session token is 401 and neither burns nor joins
statusReason: promise resolved "'org-1'" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:281:7
 			.set({ activeOrgId: inv.orgId })
 			.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
 			.returning({ id: sessions.id });
-		if (switched.length === 0) throw error(401, 'sign-in required');
+		if (true) throw error(401, 'sign-in required');
 		return inv.orgId;
 	});
killedBy: acceptInvite joins with the invite role, burns the token, and a second accept is 410
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/server/org.ts:287:107
 }
 
 /** Switches the session's active org. Membership in the target is required. */
-export async function switchActiveOrg(userId: string, sessionToken: string, orgId: string): Promise<void> {
-	const m = await membershipOf(userId, orgId);
-	if (!m) throw error(404, 'team not found');
-	// Scoped AND verified: an unknown or mismatched session token fails loudly
-	// instead of silently updating nothing (PR #52 review).
-	const updated = await db
-		.update(sessions)
-		.set({ activeOrgId: orgId })
-		.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
-		.returning({ id: sessions.id });
-	if (updated.length === 0) throw error(401, 'sign-in required');
-}
+export async function switchActiveOrg(userId: string, sessionToken: string, orgId: string): Promise<void> {}
 
 export interface OrgMember {
killedBy: switchActiveOrg requires membership and updates sessions.active_org_id
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:297:6
 		.set({ activeOrgId: orgId })
 		.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
 		.returning({ id: sessions.id });
-	if (updated.length === 0) throw error(401, 'sign-in required');
+	if (true) throw error(401, 'sign-in required');
 }
 
killedBy: switchActiveOrg requires membership and updates sessions.active_org_id
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:297:6
 		.set({ activeOrgId: orgId })
 		.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId)))
 		.returning({ id: sessions.id });
-	if (updated.length === 0) throw error(401, 'sign-in required');
+	if (false) throw error(401, 'sign-in required');
 }
 
killedBy: switchActiveOrg fails loudly when the session token is not the caller's
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/org.ts:308:94
 }
 
 /** Member roster for the settings page, oldest membership first (ties by user id, in SQL). Caller must belong to the org. */
-export async function listMembers(callerUserId: string, orgId: string): Promise<OrgMember[]> {
-	const caller = await membershipOf(callerUserId, orgId);
-	if (!caller) throw error(404, 'team not found');
-	const rows = await db
-		.select({ userId: users.id, displayName: users.displayName, role: memberships.role })
-		.from(memberships)
-		.innerJoin(users, eq(memberships.userId, users.id))
-		.where(eq(memberships.orgId, orgId))
-		.orderBy(memberships.createdAt, memberships.userId)
-		.all();
-	return rows.map((r) => ({ userId: r.userId, displayName: r.displayName, role: asOrgRole(r.role), isYou: r.userId === callerUserId }));
-}
+export async function listMembers(callerUserId: string, orgId: string): Promise<OrgMember[]> {}
 
 /** Open (unexpired, unaccepted) invites for the settings page. Caller must be admin+. */
killedBy: listMembers requires membership, orders oldest-first (ties by user id), flags isYou
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:310:6
 /** Member roster for the settings page, oldest membership first (ties by user id, in SQL). Caller must belong to the org. */
 export async function listMembers(callerUserId: string, orgId: string): Promise<OrgMember[]> {
 	const caller = await membershipOf(callerUserId, orgId);
-	if (!caller) throw error(404, 'team not found');
+	if (false) throw error(404, 'team not found');
 	const rows = await db
 		.select({ userId: users.id, displayName: users.displayName, role: memberships.role })
killedBy: listMembers requires membership, orders oldest-first (ties by user id), flags isYou
statusReason: promise resolved "[ { userId: 'user-a', …(3) }, …(1) ]" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:310:6
 /** Member roster for the settings page, oldest membership first (ties by user id, in SQL). Caller must belong to the org. */
 export async function listMembers(callerUserId: string, orgId: string): Promise<OrgMember[]> {
 	const caller = await membershipOf(callerUserId, orgId);
-	if (!caller) throw error(404, 'team not found');
+	if (true) throw error(404, 'team not found');
 	const rows = await db
 		.select({ userId: users.id, displayName: users.displayName, role: memberships.role })
killedBy: listMembers requires membership, orders oldest-first (ties by user id), flags isYou
statusReason: StrykerJS: Unknown test failure

[Killed] ArrowFunction
src/lib/server/org.ts:318:18
 		.where(eq(memberships.orgId, orgId))
 		.orderBy(memberships.createdAt, memberships.userId)
 		.all();
-	return rows.map((r) => ({ userId: r.userId, displayName: r.displayName, role: asOrgRole(r.role), isYou: r.userId === callerUserId }));
+	return rows.map(() => undefined);
 }
 
killedBy: listMembers requires membership, orders oldest-first (ties by user id), flags isYou
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] ConditionalExpression
src/lib/server/org.ts:318:106
 		.where(eq(memberships.orgId, orgId))
 		.orderBy(memberships.createdAt, memberships.userId)
 		.all();
-	return rows.map((r) => ({ userId: r.userId, displayName: r.displayName, role: asOrgRole(r.role), isYou: r.userId === callerUserId }));
+	return rows.map((r) => ({ userId: r.userId, displayName: r.displayName, role: asOrgRole(r.role), isYou: true }));
 }
 
killedBy: listMembers requires membership, orders oldest-first (ties by user id), flags isYou
statusReason: expected { userId: 'user-a', …(3) } to match object { role: 'owner', isYou: false }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/server/org.ts:322:76
 }
 
 /** Open (unexpired, unaccepted) invites for the settings page. Caller must be admin+. */
-export async function listOpenInvites(callerUserId: string, orgId: string) {
-	const m = await membershipOf(callerUserId, orgId);
-	if (!m) throw error(404, 'team not found');
-	requireRole(asOrgRole(m.role), 'admin');
-	const rows = await db
-		.select({ token: invites.token, role: invites.role, expiresAt: invites.expiresAt })
-		.from(invites)
-		.where(and(eq(invites.orgId, orgId), isNull(invites.acceptedBy), gt(invites.expiresAt, new Date().toISOString())))
-		.orderBy(invites.createdAt, invites.token)
-		.all();
-	return rows.map((r) => ({ token: r.token, role: asInviteRole(r.token, r.role), expiresAt: r.expiresAt }));
-}
+export async function listOpenInvites(callerUserId: string, orgId: string) {}
 
 /**
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/lib/server/org.ts:324:6
 /** Open (unexpired, unaccepted) invites for the settings page. Caller must be admin+. */
 export async function listOpenInvites(callerUserId: string, orgId: string) {
 	const m = await membershipOf(callerUserId, orgId);
-	if (!m) throw error(404, 'team not found');
+	if (m) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	const rows = await db
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/org.ts:324:6
 /** Open (unexpired, unaccepted) invites for the settings page. Caller must be admin+. */
 export async function listOpenInvites(callerUserId: string, orgId: string) {
 	const m = await membershipOf(callerUserId, orgId);
-	if (!m) throw error(404, 'team not found');
+	if (true) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	const rows = await db
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/server/org.ts:327:11
 	if (!m) throw error(404, 'team not found');
 	requireRole(asOrgRole(m.role), 'admin');
 	const rows = await db
-		.select({ token: invites.token, role: invites.role, expiresAt: invites.expiresAt })
+		.select({})
 		.from(invites)
 		.where(and(eq(invites.orgId, orgId), isNull(invites.acceptedBy), gt(invites.expiresAt, new Date().toISOString())))
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: Failed query: select  from "invites" where ("invites"."org_id" = ? and "invites"."accepted_by" is null and "invites"."expires_at" > ?) order by "invites"."created_at", "invites"."token"
params: org-1,2026-08-06T15:54:21.958Z

[Killed] ArrowFunction
src/lib/server/org.ts:332:18
 		.where(and(eq(invites.orgId, orgId), isNull(invites.acceptedBy), gt(invites.expiresAt, new Date().toISOString())))
 		.orderBy(invites.createdAt, invites.token)
 		.all();
-	return rows.map((r) => ({ token: r.token, role: asInviteRole(r.token, r.role), expiresAt: r.expiresAt }));
+	return rows.map(() => undefined);
 }
 
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: Cannot read properties of undefined (reading 'token')

[Killed] ObjectLiteral
src/lib/server/org.ts:332:26
 		.where(and(eq(invites.orgId, orgId), isNull(invites.acceptedBy), gt(invites.expiresAt, new Date().toISOString())))
 		.orderBy(invites.createdAt, invites.token)
 		.all();
-	return rows.map((r) => ({ token: r.token, role: asInviteRole(r.token, r.role), expiresAt: r.expiresAt }));
+	return rows.map((r) => ({}));
 }
 
killedBy: listOpenInvites is admin-only and returns only unexpired, unaccepted invites
statusReason: expected [ undefined ] to deeply equal [ 'tok-open' ]

[Killed] BooleanLiteral
src/lib/server/org.ts:342:6
  */
 export async function setMemberRole(callerUserId: string, orgId: string, targetUserId: string, role: OrgRole): Promise<void> {
 	const caller = await membershipOf(callerUserId, orgId);
-	if (!caller) throw error(404, 'team not found');
+	if (caller) throw error(404, 'team not found');
 	requireRole(asOrgRole(caller.role), 'owner');
 	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/lib/server/org.ts:343:38
 export async function setMemberRole(callerUserId: string, orgId: string, targetUserId: string, role: OrgRole): Promise<void> {
 	const caller = await membershipOf(callerUserId, orgId);
 	if (!caller) throw error(404, 'team not found');
-	requireRole(asOrgRole(caller.role), 'owner');
+	requireRole(asOrgRole(caller.role), "");
 	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
 	const target = await membershipOf(targetUserId, orgId);
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: promise resolved "undefined" instead of rejecting
