[Killed] LogicalOperator
src/lib/server/org.ts:344:6
 	const caller = await membershipOf(callerUserId, orgId);
 	if (!caller) throw error(404, 'team not found');
 	requireRole(asOrgRole(caller.role), 'owner');
-	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
+	if (role !== 'owner' || role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
src/lib/server/org.ts:344:6
 	const caller = await membershipOf(callerUserId, orgId);
 	if (!caller) throw error(404, 'team not found');
 	requireRole(asOrgRole(caller.role), 'owner');
-	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
+	if (role === 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:346:6
 	requireRole(asOrgRole(caller.role), 'owner');
 	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
 	const target = await membershipOf(targetUserId, orgId);
-	if (!target) throw error(404, 'member not found');
+	if (false) throw error(404, 'member not found');
 	// Demoting an owner is a CONDITIONAL update: the write only lands while
 	// another owner still exists, so concurrent demotions can never strand the
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] ConditionalExpression
src/lib/server/org.ts:346:6
 	requireRole(asOrgRole(caller.role), 'owner');
 	if (role !== 'owner' && role !== 'admin' && role !== 'member') throw error(400, 'unknown role');
 	const target = await membershipOf(targetUserId, orgId);
-	if (!target) throw error(404, 'member not found');
+	if (true) throw error(404, 'member not found');
 	// Demoting an owner is a CONDITIONAL update: the write only lands while
 	// another owner still exists, so concurrent demotions can never strand the
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: expected { Object (status, body) } to match object { status: 400 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/org.ts:350:24
 	// Demoting an owner is a CONDITIONAL update: the write only lands while
 	// another owner still exists, so concurrent demotions can never strand the
 	// org ownerless — no separate check to race with (PR #52 review).
-	const demotingOwner = target.role === 'owner' && role !== 'owner';
+	const demotingOwner = true;
 	const updated = await db
 		.update(memberships)
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:350:24
 	// Demoting an owner is a CONDITIONAL update: the write only lands while
 	// another owner still exists, so concurrent demotions can never strand the
 	// org ownerless — no separate check to race with (PR #52 review).
-	const demotingOwner = target.role === 'owner' && role !== 'owner';
+	const demotingOwner = true && role !== 'owner';
 	const updated = await db
 		.update(memberships)
killedBy: setMemberRole promotes a member to admin with a sole owner, and re-setting owner is a no-op
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/lib/server/org.ts:353:8
 	const demotingOwner = target.role === 'owner' && role !== 'owner';
 	const updated = await db
 		.update(memberships)
-		.set({ role })
+		.set({})
 		.where(
 			and(
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: expected Error: No values to set to match object { status: 400 }

[Killed] ObjectLiteral
src/lib/server/org.ts:363:14
 					: undefined
 			)
 		)
-		.returning({ userId: memberships.userId });
+		.returning({});
 	if (updated.length === 0) throw error(400, 'the last owner cannot be demoted — promote a teammate to owner first');
 }
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: expected Error: Failed query: update "memberships"… { …(2) } to match object { status: 400 }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/org.ts:364:6
 			)
 		)
 		.returning({ userId: memberships.userId });
-	if (updated.length === 0) throw error(400, 'the last owner cannot be demoted — promote a teammate to owner first');
+	if (false) throw error(400, 'the last owner cannot be demoted — promote a teammate to owner first');
 }
 
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/server/org.ts:364:6
 			)
 		)
 		.returning({ userId: memberships.userId });
-	if (updated.length === 0) throw error(400, 'the last owner cannot be demoted — promote a teammate to owner first');
+	if (updated.length !== 0) throw error(400, 'the last owner cannot be demoted — promote a teammate to owner first');
 }
 
killedBy: setMemberRole: owner-only, last owner cannot be demoted, promotion to owner works
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/org.ts:372:110
  * are never removed by others (they leave or the account is deleted). Nobody
  * removes themselves — that is leaveOrg.
  */
-export async function removeMember(callerUserId: string, orgId: string, targetUserId: string): Promise<void> {
-	if (callerUserId === targetUserId) throw error(400, 'use Leave team to remove yourself');
-	const caller = await membershipOf(callerUserId, orgId);
-	if (!caller) throw error(404, 'team not found');
-	requireRole(asOrgRole(caller.role), 'admin');
-	const target = await membershipOf(targetUserId, orgId);
-	if (!target) throw error(404, 'member not found');
-	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
-	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
-	await db.delete(memberships).where(and(eq(memberships.userId, targetUserId), eq(memberships.orgId, orgId)));
-}
+export async function removeMember(callerUserId: string, orgId: string, targetUserId: string): Promise<void> {}
 
 /**
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:373:6
  * removes themselves — that is leaveOrg.
  */
 export async function removeMember(callerUserId: string, orgId: string, targetUserId: string): Promise<void> {
-	if (callerUserId === targetUserId) throw error(400, 'use Leave team to remove yourself');
+	if (false) throw error(400, 'use Leave team to remove yourself');
 	const caller = await membershipOf(callerUserId, orgId);
 	if (!caller) throw error(404, 'team not found');
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: expected { Object (status, body) } to match object { status: 400 }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/lib/server/org.ts:373:6
  * removes themselves — that is leaveOrg.
  */
 export async function removeMember(callerUserId: string, orgId: string, targetUserId: string): Promise<void> {
-	if (callerUserId === targetUserId) throw error(400, 'use Leave team to remove yourself');
+	if (callerUserId !== targetUserId) throw error(400, 'use Leave team to remove yourself');
 	const caller = await membershipOf(callerUserId, orgId);
 	if (!caller) throw error(404, 'team not found');
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: expected { Object (status, body) } to match object { status: 400 }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/lib/server/org.ts:378:6
 	if (!caller) throw error(404, 'team not found');
 	requireRole(asOrgRole(caller.role), 'admin');
 	const target = await membershipOf(targetUserId, orgId);
-	if (!target) throw error(404, 'member not found');
+	if (target) throw error(404, 'member not found');
 	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
 	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: expected { Object (status, body) } to match object { status: 403 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/org.ts:379:6
 	requireRole(asOrgRole(caller.role), 'admin');
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
-	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
+	if (false) throw error(403, 'owners cannot be removed');
 	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
 	await db.delete(memberships).where(and(eq(memberships.userId, targetUserId), eq(memberships.orgId, orgId)));
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/server/org.ts:379:6
 	requireRole(asOrgRole(caller.role), 'admin');
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
-	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
+	if (target.role !== 'owner') throw error(403, 'owners cannot be removed');
 	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
 	await db.delete(memberships).where(and(eq(memberships.userId, targetUserId), eq(memberships.orgId, orgId)));
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/org.ts:380:6
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
 	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
-	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
+	if (false) throw error(403, 'only an owner can remove an admin');
 	await db.delete(memberships).where(and(eq(memberships.userId, targetUserId), eq(memberships.orgId, orgId)));
 }
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/lib/server/org.ts:380:6
 	const target = await membershipOf(targetUserId, orgId);
 	if (!target) throw error(404, 'member not found');
 	if (target.role === 'owner') throw error(403, 'owners cannot be removed');
-	if (target.role === 'admin' && caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
+	if (target.role === 'admin' || caller.role !== 'owner') throw error(403, 'only an owner can remove an admin');
 	await db.delete(memberships).where(and(eq(memberships.userId, targetUserId), eq(memberships.orgId, orgId)));
 }
killedBy: removeMember: hierarchy enforced, owners never removed, no self-removal
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:401:7
 			.from(memberships)
 			.where(and(eq(memberships.orgId, orgId), ne(memberships.userId, userId)))
 			.all();
-		if (others.length === 0) throw error(400, 'you are the only member — delete your account to remove this team');
+		if (true) throw error(400, 'you are the only member — delete your account to remove this team');
 		if (m.role === 'owner' && !others.some((o) => o.role === 'owner')) {
killedBy: leaveOrg: sole member and last-owner-with-members blocked; member leaves, active org cleared
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
src/lib/server/org.ts:401:7
 			.from(memberships)
 			.where(and(eq(memberships.orgId, orgId), ne(memberships.userId, userId)))
 			.all();
-		if (others.length === 0) throw error(400, 'you are the only member — delete your account to remove this team');
+		if (false) throw error(400, 'you are the only member — delete your account to remove this team');
 		if (m.role === 'owner' && !others.some((o) => o.role === 'owner')) {
killedBy: leaveOrg guard messages: outsider 404, sole member 400, last owner 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ArrowFunction
src/lib/server/org.ts:403:42
 			.all();
 		if (others.length === 0) throw error(400, 'you are the only member — delete your account to remove this team');
-		if (m.role === 'owner' && !others.some((o) => o.role === 'owner')) {
+		if (m.role === 'owner' && !others.some(() => undefined)) {
 			throw error(400, 'promote a teammate to owner before leaving');
 		}
killedBy: leaveOrg lets an owner leave when another owner remains
statusReason: StrykerJS: Unknown test failure

[Killed] LogicalOperator
src/lib/server/org.ts:403:7
 			.all();
 		if (others.length === 0) throw error(400, 'you are the only member — delete your account to remove this team');
-		if (m.role === 'owner' && !others.some((o) => o.role === 'owner')) {
+		if (m.role === 'owner' || !others.some(o => o.role === 'owner')) {
 			throw error(400, 'promote a teammate to owner before leaving');
 		}
killedBy: leaveOrg lets an owner leave when another owner remains
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
src/lib/server/org.ts:412:9
 				and(
 					eq(memberships.userId, userId),
 					eq(memberships.orgId, orgId),
-					sql`(${memberships.role} != 'owner' OR (SELECT count(*) FROM memberships AS mo WHERE mo.org_id = ${orgId} AND mo.role = 'owner') > 1)`
+					sql``
 				)
 			)
killedBy: leaveOrg: sole member and last-owner-with-members blocked; member leaves, active org cleared
statusReason: Failed query: delete from "memberships" where ("memberships"."user_id" = ? and "memberships"."org_id" = ? and ) returning "user_id"
params: member-1,org-1

[Killed] EqualityOperator
src/lib/server/org.ts:417:7
 			)
 			.returning({ userId: memberships.userId });
-		if (deleted.length === 0) throw error(400, 'promote a teammate to owner before leaving');
+		if (deleted.length !== 0) throw error(400, 'promote a teammate to owner before leaving');
 		// If the session was acting in the org just left, clear active_org_id so
 		// resolution falls back to the oldest remaining membership. Scoped to the
killedBy: leaveOrg: sole member and last-owner-with-members blocked; member leaves, active org cleared
statusReason: StrykerJS: Unknown test failure

[Killed] ObjectLiteral
src/lib/server/org.ts:423:9
 		// caller's own session (PR #52 review).
 		await tx
 			.update(sessions)
-			.set({ activeOrgId: null })
+			.set({})
 			.where(and(eq(sessions.id, sessionToken), eq(sessions.userId, userId), eq(sessions.activeOrgId, orgId)));
 	});
killedBy: leaveOrg: sole member and last-owner-with-members blocked; member leaves, active org cleared
statusReason: No values to set
