[Killed] BlockStatement
src/lib/server/pipeline.ts:105:42
  *
  * @returns A zero-count result indicating that the channel was skipped
  */
-function emptyResult(): ChannelRunResult {
-	return { fetched: 0, acted: 0, queued: 0, partial: false, skipped: true, dryRun: false };
-}
+function emptyResult(): ChannelRunResult {}
 
 /** Thrown when account deletion deactivates (or removes) the channel mid-run. */
killedBy: skips an inactive channel without fetching or scoring
statusReason: expected undefined to deeply equal { fetched: +0, acted: +0, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:106:69
  * @returns A zero-count result indicating that the channel was skipped
  */
 function emptyResult(): ChannelRunResult {
-	return { fetched: 0, acted: 0, queued: 0, partial: false, skipped: true, dryRun: false };
+	return { fetched: 0, acted: 0, queued: 0, partial: false, skipped: false, dryRun: false };
 }
 
killedBy: skips an inactive channel without fetching or scoring
statusReason: expected { fetched: +0, acted: +0, …(4) } to deeply equal { fetched: +0, acted: +0, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:106:53
  * @returns A zero-count result indicating that the channel was skipped
  */
 function emptyResult(): ChannelRunResult {
-	return { fetched: 0, acted: 0, queued: 0, partial: false, skipped: true, dryRun: false };
+	return { fetched: 0, acted: 0, queued: 0, partial: true, skipped: true, dryRun: false };
 }
 
killedBy: skips an inactive channel without fetching or scoring
statusReason: expected { fetched: +0, acted: +0, …(4) } to deeply equal { fetched: +0, acted: +0, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:118:70
  * in-flight run, so the run must stop at the next boundary instead of writing
  * rows or moderating comments for a deleted account.
  */
-async function assertChannelActive(channelId: string): Promise<void> {
-	const row = await db
-		.select({ active: channels.active })
-		.from(channels)
-		.where(eq(channels.id, channelId))
-		.get();
-	if (!row?.active) throw new ChannelDeactivatedError(`channel deactivated mid-run: ${channelId}`);
-}
+async function assertChannelActive(channelId: string): Promise<void> {}
 
 /**
killedBy: stops without new writes or YouTube calls when account deletion deactivates the channel mid-run
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:124:6
 		.from(channels)
 		.where(eq(channels.id, channelId))
 		.get();
-	if (!row?.active) throw new ChannelDeactivatedError(`channel deactivated mid-run: ${channelId}`);
+	if (true) throw new ChannelDeactivatedError(`channel deactivated mid-run: ${channelId}`);
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:124:6
 		.from(channels)
 		.where(eq(channels.id, channelId))
 		.get();
-	if (!row?.active) throw new ChannelDeactivatedError(`channel deactivated mid-run: ${channelId}`);
+	if (row?.active) throw new ChannelDeactivatedError(`channel deactivated mid-run: ${channelId}`);
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:134:82
  * @param rule - The matched moderation rule.
  * @returns The moderation decision, including its status, rationale, and YouTube action.
  */
-function ruleDecision(comment: NewComment, rule: PreparedRule['rule']): Decision {
-	const outcome = RULE_ACTIONS[rule.action];
-	return {
-		comment,
-		...outcome,
-		decidedBy: 'rule',
-		matchedRuleId: rule.id,
-		aiScore: null,
-		reason: `rule #${rule.id} (${rule.type}: ${rule.pattern.slice(0, 80)})`
-	};
-}
+function ruleDecision(comment: NewComment, rule: PreparedRule['rule']): Decision {}
 
 /** Queues a comment for human review when AI scoring is unavailable (I11). */
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: Cannot read properties of undefined (reading 'auditAction')

[Killed] MethodExpression
src/lib/server/pipeline.ts:142:46
 		decidedBy: 'rule',
 		matchedRuleId: rule.id,
 		aiScore: null,
-		reason: `rule #${rule.id} (${rule.type}: ${rule.pattern.slice(0, 80)})`
+		reason: `rule #${rule.id} (${rule.type}: ${rule.pattern})`
 	};
 }
killedBy: truncates the rule pattern in the stored reason at 80 characters
statusReason: expected { commentId: 'comment', …(7) } to deeply equal ObjectContaining{…}

[Killed] BlockStatement
src/lib/server/pipeline.ts:147:71
 }
 
 /** Queues a comment for human review when AI scoring is unavailable (I11). */
-function aiUnavailable(comment: NewComment, error: unknown): Decision {
-	// I11: a scoring failure never auto-approves, never auto-rejects, and
-	// never aborts the batch — the comment lands in the human review queue.
-	return {
-		comment,
-		status: 'pending',
-		decidedBy: 'none',
-		matchedRuleId: null,
-		aiScore: null,
-		auditAction: 'queue',
-		reason: `ai unavailable: ${error instanceof Error ? error.message : String(error)}`.slice(0, 200),
-		youtubeAction: null
-	};
-}
+function aiUnavailable(comment: NewComment, error: unknown): Decision {}
 
 function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {
killedBy: routes AI scoring failures to the review queue instead of failing the run (I11)
statusReason: Cannot read properties of undefined (reading 'auditAction')

[Killed] StringLiteral
src/lib/server/pipeline.ts:152:11
 	// never aborts the batch — the comment lands in the human review queue.
 	return {
 		comment,
-		status: 'pending',
+		status: "",
 		decidedBy: 'none',
 		matchedRuleId: null,
killedBy: routes AI scoring failures to the review queue instead of failing the run (I11)
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/lib/server/pipeline.ts:157:11
 		matchedRuleId: null,
 		aiScore: null,
 		auditAction: 'queue',
-		reason: `ai unavailable: ${error instanceof Error ? error.message : String(error)}`.slice(0, 200),
+		reason: `ai unavailable: ${error instanceof Error ? error.message : String(error)}`,
 		youtubeAction: null
 	};
killedBy: truncates the ai-unavailable reason at 200 characters
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:162:113
 	};
 }
 
-function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {
-	const reason = `${signal} score ${score.toFixed(2)}`;
-	if (score >= AUTO_BAN) {
-		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
-	}
-	if (score >= AUTO_REJECT) {
-		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
-	}
-	if (score >= QUEUE) {
-		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
-	}
-	return { comment, status: 'approved', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'approve', reason, youtubeAction: null };
-}
+function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {}
 
 async function aiDecision(
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'auditAction')

[Killed] StringLiteral
src/lib/server/pipeline.ts:163:17
 }
 
 function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {
-	const reason = `${signal} score ${score.toFixed(2)}`;
+	const reason = ``;
 	if (score >= AUTO_BAN) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:164:6
 
 function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {
 	const reason = `${signal} score ${score.toFixed(2)}`;
-	if (score >= AUTO_BAN) {
+	if (true) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:164:6
 
 function aiOutcome(comment: NewComment, aiScore: string | null, signal: 'ai' | 'tone', score: number): Decision {
 	const reason = `${signal} score ${score.toFixed(2)}`;
-	if (score >= AUTO_BAN) {
+	if (score > AUTO_BAN) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
killedBy: categorizes score 0.95 as 'rejected'
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:167:6
 	if (score >= AUTO_BAN) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
-	if (score >= AUTO_REJECT) {
+	if (score > AUTO_REJECT) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:167:28
 	if (score >= AUTO_BAN) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
-	if (score >= AUTO_REJECT) {
-		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
-	}
+	if (score >= AUTO_REJECT) {}
 	if (score >= QUEUE) {
 		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] StringLiteral
src/lib/server/pipeline.ts:168:134
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
 	if (score >= AUTO_REJECT) {
-		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
+		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: "" };
 	}
 	if (score >= QUEUE) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'comment' ], 'rejected', …(3) ]

Number of calls: 0

[Killed] StringLiteral
src/lib/server/pipeline.ts:168:29
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'ban', reason, youtubeAction: 'ban' };
 	}
 	if (score >= AUTO_REJECT) {
-		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
+		return { comment, status: "", decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
 	if (score >= QUEUE) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:170:6
 	if (score >= AUTO_REJECT) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
-	if (score >= QUEUE) {
+	if (true) {
 		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
 	}
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:170:6
 	if (score >= AUTO_REJECT) {
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
-	if (score >= QUEUE) {
+	if (score < QUEUE) {
 		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
 	}
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ObjectLiteral
src/lib/server/pipeline.ts:171:10
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
 	if (score >= QUEUE) {
-		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
+		return {};
 	}
 	return { comment, status: 'approved', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'approve', reason, youtubeAction: null };
killedBy: categorizes score 0.51 as 'pending'
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
src/lib/server/pipeline.ts:171:100
 		return { comment, status: 'rejected', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'reject', reason, youtubeAction: 'reject' };
 	}
 	if (score >= QUEUE) {
-		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
+		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: "", reason, youtubeAction: null };
 	}
 	return { comment, status: 'approved', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'approve', reason, youtubeAction: null };
killedBy: categorizes score 0.51 as 'pending'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] StringLiteral
src/lib/server/pipeline.ts:173:100
 	if (score >= QUEUE) {
 		return { comment, status: 'pending', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'queue', reason, youtubeAction: null };
 	}
-	return { comment, status: 'approved', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: 'approve', reason, youtubeAction: null };
+	return { comment, status: 'approved', decidedBy: 'ai', matchedRuleId: null, aiScore, auditAction: "", reason, youtubeAction: null };
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:184:6
 	openAiKey: string | undefined
 ): Promise<Decision> {
 	let moderation: Awaited<ReturnType<typeof scoreComment>>;
-	try {
-		moderation = await scoreComment(comment.text, deadline, openAiKey);
-	} catch (error) {
+	try {} catch (error) {
 		return aiUnavailable(comment, error);
 	}
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 1 comment(s): comment comment: Cannot read properties of undefined (reading 'score')

[Killed] BlockStatement
src/lib/server/pipeline.ts:186:18
 	let moderation: Awaited<ReturnType<typeof scoreComment>>;
 	try {
 		moderation = await scoreComment(comment.text, deadline, openAiKey);
-	} catch (error) {
-		return aiUnavailable(comment, error);
-	}
+	} catch (error) {}
 	// Round to the displayed precision before comparing so a score that reads
 	// as "0.51" in the audit log also behaves as 0.51 against the thresholds.
killedBy: routes AI scoring failures to the review queue instead of failing the run (I11)
statusReason: moderation decision failed for 1 comment(s): comment comment: Cannot read properties of undefined (reading 'score')

[Killed] ArithmeticOperator
src/lib/server/pipeline.ts:191:27
 	}
 	// Round to the displayed precision before comparing so a score that reads
 	// as "0.51" in the audit log also behaves as 0.51 against the thresholds.
-	const score = Math.round(moderation.score * 100) / 100;
+	const score = Math.round(moderation.score / 100) / 100;
 	const aiScore = serializeScores(moderation.scores);
 	// Omni already condemns the comment on its own — no need to spend a tone call.
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArithmeticOperator
src/lib/server/pipeline.ts:191:16
 	}
 	// Round to the displayed precision before comparing so a score that reads
 	// as "0.51" in the audit log also behaves as 0.51 against the thresholds.
-	const score = Math.round(moderation.score * 100) / 100;
+	const score = Math.round(moderation.score * 100) * 100;
 	const aiScore = serializeScores(moderation.scores);
 	// Omni already condemns the comment on its own — no need to spend a tone call.
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:194:6
 	const score = Math.round(moderation.score * 100) / 100;
 	const aiScore = serializeScores(moderation.scores);
 	// Omni already condemns the comment on its own — no need to spend a tone call.
-	if (score >= AUTO_REJECT) return aiOutcome(comment, aiScore, 'ai', score);
+	if (score > AUTO_REJECT) return aiOutcome(comment, aiScore, 'ai', score);
 	// Level 2 ("Edge lord + Ackchyually..."): the tone pass sees demeaning,
 	// condescending, and sarcastic comments the safety classifier cannot. The
killedBy: skips the tone pass at exactly the auto-reject threshold (0.76)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "A comment",

[Killed] EqualityOperator
src/lib/server/pipeline.ts:194:6
 	const score = Math.round(moderation.score * 100) / 100;
 	const aiScore = serializeScores(moderation.scores);
 	// Omni already condemns the comment on its own — no need to spend a tone call.
-	if (score >= AUTO_REJECT) return aiOutcome(comment, aiScore, 'ai', score);
+	if (score < AUTO_REJECT) return aiOutcome(comment, aiScore, 'ai', score);
 	// Level 2 ("Edge lord + Ackchyually..."): the tone pass sees demeaning,
 	// condescending, and sarcastic comments the safety classifier cannot. The
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:198:6
 	// Level 2 ("Edge lord + Ackchyually..."): the tone pass sees demeaning,
 	// condescending, and sarcastic comments the safety classifier cannot. The
 	// stronger of the two signals decides, on identical bands (tone included).
-	if (tone) {
+	if (true) {
 		let toneScore: number;
 		try {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:198:12
 	// Level 2 ("Edge lord + Ackchyually..."): the tone pass sees demeaning,
 	// condescending, and sarcastic comments the safety classifier cannot. The
 	// stronger of the two signals decides, on identical bands (tone included).
-	if (tone) {
-		let toneScore: number;
-		try {
-			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) / 100;
-		} catch (error) {
-			return aiUnavailable(comment, error);
-		}
-		if (toneScore > score) return aiOutcome(comment, aiScore, 'tone', toneScore);
-	}
+	if (tone) {}
 	return aiOutcome(comment, aiScore, 'ai', score);
 }
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/server/pipeline.ts:200:7
 	// stronger of the two signals decides, on identical bands (tone included).
 	if (tone) {
 		let toneScore: number;
-		try {
-			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) / 100;
-		} catch (error) {
+		try {} catch (error) {
 			return aiUnavailable(comment, error);
 		}
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] ArithmeticOperator
src/lib/server/pipeline.ts:201:16
 	if (tone) {
 		let toneScore: number;
 		try {
-			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) / 100;
+			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) * 100;
 		} catch (error) {
 			return aiUnavailable(comment, error);
killedBy: rejects a demeaning comment the omni score alone would approve
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArithmeticOperator
src/lib/server/pipeline.ts:201:27
 	if (tone) {
 		let toneScore: number;
 		try {
-			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) / 100;
+			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score / 100) / 100;
 		} catch (error) {
 			return aiUnavailable(comment, error);
killedBy: rejects a demeaning comment the omni score alone would approve
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:202:19
 		let toneScore: number;
 		try {
 			toneScore = Math.round((await scoreTone(comment.text, tone.context, deadline, protections, openAiKey)).score * 100) / 100;
-		} catch (error) {
-			return aiUnavailable(comment, error);
-		}
+		} catch (error) {}
 		if (toneScore > score) return aiOutcome(comment, aiScore, 'tone', toneScore);
 	}
killedBy: routes tone scoring failures to the review queue (I11)
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:205:7
 		} catch (error) {
 			return aiUnavailable(comment, error);
 		}
-		if (toneScore > score) return aiOutcome(comment, aiScore, 'tone', toneScore);
+		if (toneScore >= score) return aiOutcome(comment, aiScore, 'tone', toneScore);
 	}
 	return aiOutcome(comment, aiScore, 'ai', score);
killedBy: keeps the ai signal when the tone score ties it
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:205:7
 		} catch (error) {
 			return aiUnavailable(comment, error);
 		}
-		if (toneScore > score) return aiOutcome(comment, aiScore, 'tone', toneScore);
+		if (toneScore <= score) return aiOutcome(comment, aiScore, 'tone', toneScore);
 	}
 	return aiOutcome(comment, aiScore, 'ai', score);
killedBy: rejects a demeaning comment the omni score alone would approve
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:217:22
 	deadline: number | undefined,
 	protections: ToneProtections,
 	openAiKey: string | undefined
-): Promise<Decision> {
-	const rule = matchPreparedRule(comment.text, comment.authorChannelId, rules);
-	return rule ? ruleDecision(comment, rule) : aiDecision(comment, tone, deadline, protections, openAiKey);
-}
+): Promise<Decision> {}
 
 function auditRows(channelId: string, decisions: Decision[], dryRun: boolean) {
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'auditAction')

[Killed] BlockStatement
src/lib/server/pipeline.ts:222:79
 	return rule ? ruleDecision(comment, rule) : aiDecision(comment, tone, deadline, protections, openAiKey);
 }
 
-function auditRows(channelId: string, decisions: Decision[], dryRun: boolean) {
-	// Stryker disable next-line MethodExpression: equivalent — every Decision producer (ruleDecision, aiUnavailable, aiOutcome) sets auditAction and reason, so the filter never drops a row
-	return decisions
-		.filter((decision): decision is Decision & { auditAction: string; reason: string } =>
-			// Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent — the predicate is constant true for every Decision the pipeline produces, so the operator choice is unobservable
-			Boolean(decision.auditAction && decision.reason)
-		)
-		.map((decision) => ({
-			channelId,
-			commentId: decision.comment.id,
-			action: dryRun ? 'dry-run' : decision.auditAction,
-			reason: decision.reason,
-			actor: 'system',
-			// Dry run never inserts into comments (I8), so the audit row is the
-			// only place the comment text survives — capped at 500 chars like
-			// comments.text. Real runs leave it null (text lives in comments).
-			...(dryRun ? { text: decision.comment.text.slice(0, 500) } : {}),
-			createdAt: new Date().toISOString()
-		}));
-}
+function auditRows(channelId: string, decisions: Decision[], dryRun: boolean) {}
 
 function commentRows(channelId: string, decisions: Decision[]) {
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/server/pipeline.ts:225:11
 function auditRows(channelId: string, decisions: Decision[], dryRun: boolean) {
 	// Stryker disable next-line MethodExpression: equivalent — every Decision producer (ruleDecision, aiUnavailable, aiOutcome) sets auditAction and reason, so the filter never drops a row
 	return decisions
-		.filter((decision): decision is Decision & { auditAction: string; reason: string } =>
-			// Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent — the predicate is constant true for every Decision the pipeline produces, so the operator choice is unobservable
-			Boolean(decision.auditAction && decision.reason)
+		.filter(() => undefined
 		)
 		.map((decision) => ({
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:229:8
 			// Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent — the predicate is constant true for every Decision the pipeline produces, so the operator choice is unobservable
 			Boolean(decision.auditAction && decision.reason)
 		)
-		.map((decision) => ({
-			channelId,
-			commentId: decision.comment.id,
-			action: dryRun ? 'dry-run' : decision.auditAction,
-			reason: decision.reason,
-			actor: 'system',
-			// Dry run never inserts into comments (I8), so the audit row is the
-			// only place the comment text survives — capped at 500 chars like
-			// comments.text. Real runs leave it null (text lives in comments).
-			...(dryRun ? { text: decision.comment.text.slice(0, 500) } : {}),
-			createdAt: new Date().toISOString()
-		}));
+		.map(() => undefined);
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ undefined ] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/lib/server/pipeline.ts:238:25
 			// Dry run never inserts into comments (I8), so the audit row is the
 			// only place the comment text survives — capped at 500 chars like
 			// comments.text. Real runs leave it null (text lives in comments).
-			...(dryRun ? { text: decision.comment.text.slice(0, 500) } : {}),
+			...(dryRun ? { text: decision.comment.text } : {}),
 			createdAt: new Date().toISOString()
 		}));
killedBy: forceDryRun previews a live deployment: dry-run audit rows carry the comment text and nothing durable changes
statusReason: expected [ { channelId: 'channel', …(6) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:243:64
 		}));
 }
 
-function commentRows(channelId: string, decisions: Decision[]) {
-	// Process-and-discard for author PII: the display name and author channel
-	// ID served their purpose at decision time (rule matching) and are never
-	// persisted. Comment text IS stored (≤500 chars) so the review queue works.
-	return decisions.map((decision) => ({
-		id: decision.comment.id,
-		channelId,
-		text: decision.comment.text.slice(0, 500),
-		publishedAt: decision.comment.publishedAt,
-		status: decision.status,
-		decidedBy: decision.decidedBy,
-		matchedRuleId: decision.matchedRuleId,
-		aiScore: decision.aiScore,
-		createdAt: new Date().toISOString()
-	}));
-}
+function commentRows(channelId: string, decisions: Decision[]) {}
 
 function actionRows(channelId: string, decisions: Decision[]) {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ undefined ] to deeply equal [ ObjectContaining{…} ]
