[Killed] ArrowFunction
src/lib/server/pipeline.ts:247:23
 	// Process-and-discard for author PII: the display name and author channel
 	// ID served their purpose at decision time (rule matching) and are never
 	// persisted. Comment text IS stored (≤500 chars) so the review queue works.
-	return decisions.map((decision) => ({
-		id: decision.comment.id,
-		channelId,
-		text: decision.comment.text.slice(0, 500),
-		publishedAt: decision.comment.publishedAt,
-		status: decision.status,
-		decidedBy: decision.decidedBy,
-		matchedRuleId: decision.matchedRuleId,
-		aiScore: decision.aiScore,
-		createdAt: new Date().toISOString()
-	}));
+	return decisions.map(() => undefined);
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ undefined ] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/lib/server/pipeline.ts:250:9
 	return decisions.map((decision) => ({
 		id: decision.comment.id,
 		channelId,
-		text: decision.comment.text.slice(0, 500),
+		text: decision.comment.text,
 		publishedAt: decision.comment.publishedAt,
 		status: decision.status,
killedBy: scores full comment text but truncates the stored copy
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:260:63
 	}));
 }
 
-function actionRows(channelId: string, decisions: Decision[]) {
-	const createdAt = new Date().toISOString();
-	return decisions.flatMap((decision) => {
-		if (!decision.youtubeAction) return [];
-		// Stryker disable next-line ConditionalExpression, StringLiteral: equivalent — every youtubeAction decision carries a reason (all producers set both), so this guard never fires
-		if (!decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
-		return [{
-			commentId: decision.comment.id,
-			channelId,
-			action: decision.youtubeAction,
-			reason: decision.reason,
-			state: 'pending',
-			lastAttemptAt: null,
-			lastManualRetryAt: null,
-			createdAt
-		}];
-	});
-}
+function actionRows(channelId: string, decisions: Decision[]) {}
 
 async function decideNewComments(
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/lib/server/pipeline.ts:262:41
 
 function actionRows(channelId: string, decisions: Decision[]) {
 	const createdAt = new Date().toISOString();
-	return decisions.flatMap((decision) => {
-		if (!decision.youtubeAction) return [];
-		// Stryker disable next-line ConditionalExpression, StringLiteral: equivalent — every youtubeAction decision carries a reason (all producers set both), so this guard never fires
-		if (!decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
-		return [{
-			commentId: decision.comment.id,
-			channelId,
-			action: decision.youtubeAction,
-			reason: decision.reason,
-			state: 'pending',
-			lastAttemptAt: null,
-			lastManualRetryAt: null,
-			createdAt
-		}];
-	});
+	return decisions.flatMap((decision) => {});
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'channelId')

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:263:7
 function actionRows(channelId: string, decisions: Decision[]) {
 	const createdAt = new Date().toISOString();
 	return decisions.flatMap((decision) => {
-		if (!decision.youtubeAction) return [];
+		if (false) return [];
 		// Stryker disable next-line ConditionalExpression, StringLiteral: equivalent — every youtubeAction decision carries a reason (all producers set both), so this guard never fires
 		if (!decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation action is invalid: null

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:263:7
 function actionRows(channelId: string, decisions: Decision[]) {
 	const createdAt = new Date().toISOString();
 	return decisions.flatMap((decision) => {
-		if (!decision.youtubeAction) return [];
+		if (true) return [];
 		// Stryker disable next-line ConditionalExpression, StringLiteral: equivalent — every youtubeAction decision carries a reason (all producers set both), so this guard never fires
 		if (!decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:265:7
 	return decisions.flatMap((decision) => {
 		if (!decision.youtubeAction) return [];
 		// Stryker disable next-line ConditionalExpression, StringLiteral: equivalent — every youtubeAction decision carries a reason (all producers set both), so this guard never fires
-		if (!decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
+		if (decision.reason) throw new Error(`remote moderation decision ${decision.comment.id} is missing a reason`);
 		return [{
 			commentId: decision.comment.id,
killedBy: categorizes score 0.76 as 'rejected'
statusReason: remote moderation decision comment is missing a reason

[Killed] ArrowFunction
src/lib/server/pipeline.ts:303:55
 							await db
 								.select({ id: comments.id })
 								.from(comments)
-								.where(inArray(comments.id, page.comments.map((comment) => comment.id)))
+								.where(inArray(comments.id, page.comments.map(() => undefined)))
 								.all()
 						).map((comment) => comment.id)
killedBy: queues AI scoring failures for human review and never rescores them (I11)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      "good",

[Killed] ArrowFunction
src/lib/server/pipeline.ts:305:13
 								.from(comments)
 								.where(inArray(comments.id, page.comments.map((comment) => comment.id)))
 								.all()
-						).map((comment) => comment.id)
+						).map(() => undefined)
 					: []
 			);
killedBy: queues AI scoring failures for human review and never rescores them (I11)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      "good",

[Killed] MethodExpression
src/lib/server/pipeline.ts:316:22
 	// KEY, failing the entire staging transaction (I1: one bad item never
 	// aborts the batch).
 	const seen = new Set<string>();
-	const newComments = page.comments.filter((comment) => {
-		if (existingIds.has(comment.id) || seen.has(comment.id)) return false;
-		seen.add(comment.id);
-		return true;
-	});
+	const newComments = page.comments;
 	// Level 2 tone scoring needs each video's title/description as context. One
 	// batched videos.list call per run; videos whose metadata failed validation
killedBy: queues AI scoring failures for human review and never rescores them (I11)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      "good",

[Killed] BlockStatement
src/lib/server/pipeline.ts:316:56
 	// KEY, failing the entire staging transaction (I1: one bad item never
 	// aborts the batch).
 	const seen = new Set<string>();
-	const newComments = page.comments.filter((comment) => {
-		if (existingIds.has(comment.id) || seen.has(comment.id)) return false;
-		seen.add(comment.id);
-		return true;
-	});
+	const newComments = page.comments.filter((comment) => {});
 	// Level 2 tone scoring needs each video's title/description as context. One
 	// batched videos.list call per run; videos whose metadata failed validation
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:317:7
 	// aborts the batch).
 	const seen = new Set<string>();
 	const newComments = page.comments.filter((comment) => {
-		if (existingIds.has(comment.id) || seen.has(comment.id)) return false;
+		if (true) return false;
 		seen.add(comment.id);
 		return true;
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:317:67
 	// aborts the batch).
 	const seen = new Set<string>();
 	const newComments = page.comments.filter((comment) => {
-		if (existingIds.has(comment.id) || seen.has(comment.id)) return false;
+		if (existingIds.has(comment.id) || seen.has(comment.id)) return true;
 		seen.add(comment.id);
 		return true;
killedBy: queues AI scoring failures for human review and never rescores them (I11)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      "good",

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:319:10
 	const newComments = page.comments.filter((comment) => {
 		if (existingIds.has(comment.id) || seen.has(comment.id)) return false;
 		seen.add(comment.id);
-		return true;
+		return false;
 	});
 	// Level 2 tone scoring needs each video's title/description as context. One
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:329:22
 	// aborting the batch or silently scoring omni-only. A ticked protection
 	// flag forces the tone pass on even below level 2: the channel owner asked
 	// for heightened scrutiny, so the checkbox must never be a silent no-op.
-	const toneEnabled = toneLevel >= 2 || Boolean(protections.protectLgbtqia) || Boolean(protections.protectWomen);
+	const toneEnabled = toneLevel < 2 || Boolean(protections.protectLgbtqia) || Boolean(protections.protectWomen);
 	let videoContext: Awaited<ReturnType<typeof fetchVideoMetadata>> | null = null;
 	let metadataError: unknown = null;
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:329:22
 	// aborting the batch or silently scoring omni-only. A ticked protection
 	// flag forces the tone pass on even below level 2: the channel owner asked
 	// for heightened scrutiny, so the checkbox must never be a silent no-op.
-	const toneEnabled = toneLevel >= 2 || Boolean(protections.protectLgbtqia) || Boolean(protections.protectWomen);
+	const toneEnabled = false;
 	let videoContext: Awaited<ReturnType<typeof fetchVideoMetadata>> | null = null;
 	let metadataError: unknown = null;
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:332:6
 	const toneEnabled = toneLevel >= 2 || Boolean(protections.protectLgbtqia) || Boolean(protections.protectWomen);
 	let videoContext: Awaited<ReturnType<typeof fetchVideoMetadata>> | null = null;
 	let metadataError: unknown = null;
-	if (toneEnabled && newComments.length) {
+	if (false) {
 		videoContext = new Map();
 		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/server/pipeline.ts:332:41
 	const toneEnabled = toneLevel >= 2 || Boolean(protections.protectLgbtqia) || Boolean(protections.protectWomen);
 	let videoContext: Awaited<ReturnType<typeof fetchVideoMetadata>> | null = null;
 	let metadataError: unknown = null;
-	if (toneEnabled && newComments.length) {
-		videoContext = new Map();
-		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
-		if (videoIds.length) {
-			try {
-				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
-			} catch (error) {
-				if (error instanceof DeadlineExceededError) throw error;
-				metadataError = error;
-			}
-		}
-	}
+	if (toneEnabled && newComments.length) {}
 	const settled = await Promise.allSettled(
 		newComments.map(async (comment) => {
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/server/pipeline.ts:334:107
 	let metadataError: unknown = null;
 	if (toneEnabled && newComments.length) {
 		videoContext = new Map();
-		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
+		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id === null))];
 		if (videoIds.length) {
 			try {
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] ArrowFunction
src/lib/server/pipeline.ts:334:48
 	let metadataError: unknown = null;
 	if (toneEnabled && newComments.length) {
 		videoContext = new Map();
-		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
+		const videoIds = [...new Set(newComments.map(() => undefined).filter((id): id is string => id !== null))];
 		if (videoIds.length) {
 			try {
killedBy: scores tone with empty context when a comment has no video ID
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:335:7
 	if (toneEnabled && newComments.length) {
 		videoContext = new Map();
 		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
-		if (videoIds.length) {
+		if (false) {
 			try {
 				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:335:7
 	if (toneEnabled && newComments.length) {
 		videoContext = new Map();
 		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
-		if (videoIds.length) {
+		if (true) {
 			try {
 				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
killedBy: scores tone with empty context when a comment has no video ID
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [],

[Killed] BlockStatement
src/lib/server/pipeline.ts:336:8
 		videoContext = new Map();
 		const videoIds = [...new Set(newComments.map((comment) => comment.videoId).filter((id): id is string => id !== null))];
 		if (videoIds.length) {
-			try {
-				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
-			} catch (error) {
+			try {} catch (error) {
 				if (error instanceof DeadlineExceededError) throw error;
 				metadataError = error;
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] BlockStatement
src/lib/server/pipeline.ts:338:20
 		if (videoIds.length) {
 			try {
 				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
-			} catch (error) {
-				if (error instanceof DeadlineExceededError) throw error;
-				metadataError = error;
-			}
+			} catch (error) {}
 		}
 	}
killedBy: routes video metadata failures to the review queue instead of aborting the run (I11)
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:339:9
 			try {
 				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
 			} catch (error) {
-				if (error instanceof DeadlineExceededError) throw error;
+				if (true) throw error;
 				metadataError = error;
 			}
killedBy: routes video metadata failures to the review queue instead of aborting the run (I11)
statusReason: videos.list failed with 500

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:339:9
 			try {
 				videoContext = await fetchVideoMetadata(videoIds, accessToken, deadline);
 			} catch (error) {
-				if (error instanceof DeadlineExceededError) throw error;
+				if (false) throw error;
 				metadataError = error;
 			}
killedBy: returns a partial result when the deadline hits during video metadata fetch
statusReason: expected { fetched: 1, acted: +0, …(4) } to deeply equal { fetched: 1, acted: +0, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:346:8
 	}
 	const settled = await Promise.allSettled(
 		newComments.map(async (comment) => {
-			try {
-				if (metadataError) return aiUnavailable(comment, metadataError);
-				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
-				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
-				const tone = videoContext
-					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta?.description ?? '' } }
-					: null;
-				return await decide(comment, rulesForChannel, tone, deadline, protections, openAiKey);
-			} catch (error) {
+			try {} catch (error) {
 				if (error instanceof DeadlineExceededError) throw error;
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'auditAction')

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:347:9
 	const settled = await Promise.allSettled(
 		newComments.map(async (comment) => {
 			try {
-				if (metadataError) return aiUnavailable(comment, metadataError);
+				if (false) return aiUnavailable(comment, metadataError);
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
 				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
killedBy: routes video metadata failures to the review queue instead of aborting the run (I11)
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:347:9
 	const settled = await Promise.allSettled(
 		newComments.map(async (comment) => {
 			try {
-				if (metadataError) return aiUnavailable(comment, metadataError);
+				if (true) return aiUnavailable(comment, metadataError);
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
 				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [ { id: 'comment', …(8) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:349:18
 			try {
 				if (metadataError) return aiUnavailable(comment, metadataError);
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
-				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
+				const meta = comment.videoId !== null ? undefined : videoContext?.get(comment.videoId);
 				const tone = videoContext
 					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta?.description ?? '' } }
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] OptionalChaining
src/lib/server/pipeline.ts:349:57
 			try {
 				if (metadataError) return aiUnavailable(comment, metadataError);
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
-				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
+				const meta = comment.videoId === null ? undefined : videoContext.get(comment.videoId);
 				const tone = videoContext
 					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta?.description ?? '' } }
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 1 comment(s): comment comment: Cannot read properties of null (reading 'get')

[Killed] OptionalChaining
src/lib/server/pipeline.ts:351:70
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
 				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
 				const tone = videoContext
-					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta?.description ?? '' } }
+					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta.description ?? '' } }
 					: null;
 				return await decide(comment, rulesForChannel, tone, deadline, protections, openAiKey);
killedBy: scores tone with empty context when a comment has no video ID
statusReason: moderation decision failed for 1 comment(s): comment comment: Cannot read properties of undefined (reading 'description')

[Killed] LogicalOperator
src/lib/server/pipeline.ts:351:33
 				// Stryker disable next-line ConditionalExpression: equivalent — for a null videoId both branches yield undefined (Map.get(null) misses), and a non-null id takes the false branch anyway
 				const meta = comment.videoId === null ? undefined : videoContext?.get(comment.videoId);
 				const tone = videoContext
-					? { context: { videoTitle: meta?.title ?? '', videoDescription: meta?.description ?? '' } }
+					? { context: { videoTitle: meta?.title && '', videoDescription: meta?.description ?? '' } }
 					: null;
 				return await decide(comment, rulesForChannel, tone, deadline, protections, openAiKey);
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] ArrayDeclaration
src/lib/server/pipeline.ts:362:29
 		})
 	);
 	const decisions: Decision[] = [];
-	const failures: string[] = [];
+	const failures: string[] = ["Stryker was here"];
 	for (const result of settled) {
 		if (result.status === 'fulfilled') {
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 1 comment(s): Stryker was here

[Killed] BlockStatement
src/lib/server/pipeline.ts:363:32
 	);
 	const decisions: Decision[] = [];
 	const failures: string[] = [];
-	for (const result of settled) {
-		if (result.status === 'fulfilled') {
-			decisions.push(result.value);
-			continue;
-		}
-		// Stryker disable next-line ConditionalExpression: equivalent — rejection reasons only ever come from the wrapped Error in the catch above, never a DeadlineExceededError
-		if (result.reason instanceof DeadlineExceededError) throw result.reason;
-		failures.push(result.reason instanceof Error ? result.reason.message : String(result.reason));
-	}
+	for (const result of settled) {}
 	return { decisions, failures };
 }
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:364:38
 	const decisions: Decision[] = [];
 	const failures: string[] = [];
 	for (const result of settled) {
-		if (result.status === 'fulfilled') {
-			decisions.push(result.value);
-			continue;
-		}
+		if (result.status === 'fulfilled') {}
 		// Stryker disable next-line ConditionalExpression: equivalent — rejection reasons only ever come from the wrapped Error in the catch above, never a DeadlineExceededError
 		if (result.reason instanceof DeadlineExceededError) throw result.reason;
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 1 comment(s): undefined

[Killed] EqualityOperator
src/lib/server/pipeline.ts:364:7
 	const decisions: Decision[] = [];
 	const failures: string[] = [];
 	for (const result of settled) {
-		if (result.status === 'fulfilled') {
+		if (result.status !== 'fulfilled') {
 			decisions.push(result.value);
 			continue;
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 1 comment(s): undefined

[Killed] BlockStatement
src/lib/server/pipeline.ts:375:73
 	return { decisions, failures };
 }
 
-async function stageDecisions(channelId: string, decisions: Decision[]) {
-	if (!decisions.length) return;
-	const actions = actionRows(channelId, decisions);
-	await db.transaction(async (transaction) => {
-		await transaction.insert(comments).values(commentRows(channelId, decisions));
-		if (actions.length) await transaction.insert(moderationActions).values(actions);
-		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
-		if (audits.length) await transaction.insert(auditLog).values(audits);
-	});
-}
+async function stageDecisions(channelId: string, decisions: Decision[]) {}
 
 function validAction(action: string): YoutubeAction {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:376:6
 }
 
 async function stageDecisions(channelId: string, decisions: Decision[]) {
-	if (!decisions.length) return;
+	if (true) return;
 	const actions = actionRows(channelId, decisions);
 	await db.transaction(async (transaction) => {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:376:6
 }
 
 async function stageDecisions(channelId: string, decisions: Decision[]) {
-	if (!decisions.length) return;
+	if (false) return;
 	const actions = actionRows(channelId, decisions);
 	await db.transaction(async (transaction) => {
killedBy: keeps the existing cursor when the fetched page is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      [Function anonymous],

[Killed] BlockStatement
src/lib/server/pipeline.ts:378:46
 async function stageDecisions(channelId: string, decisions: Decision[]) {
 	if (!decisions.length) return;
 	const actions = actionRows(channelId, decisions);
-	await db.transaction(async (transaction) => {
-		await transaction.insert(comments).values(commentRows(channelId, decisions));
-		if (actions.length) await transaction.insert(moderationActions).values(actions);
-		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
-		if (audits.length) await transaction.insert(auditLog).values(audits);
-	});
+	await db.transaction(async (transaction) => {});
 }
 
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:380:7
 	const actions = actionRows(channelId, decisions);
 	await db.transaction(async (transaction) => {
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
-		if (actions.length) await transaction.insert(moderationActions).values(actions);
+		if (false) await transaction.insert(moderationActions).values(actions);
 		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
 		if (audits.length) await transaction.insert(auditLog).values(audits);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:380:7
 	const actions = actionRows(channelId, decisions);
 	await db.transaction(async (transaction) => {
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
-		if (actions.length) await transaction.insert(moderationActions).values(actions);
+		if (true) await transaction.insert(moderationActions).values(actions);
 		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
 		if (audits.length) await transaction.insert(auditLog).values(audits);
killedBy: staging inserts no empty action batch for an approved comment
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times
