[Killed] BooleanLiteral
src/lib/server/pipeline.ts:381:70
 	await db.transaction(async (transaction) => {
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
 		if (actions.length) await transaction.insert(moderationActions).values(actions);
-		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
+		const audits = auditRows(channelId, decisions.filter((decision) => decision.youtubeAction), false);
 		if (audits.length) await transaction.insert(auditLog).values(audits);
 	});
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:381:56
 	await db.transaction(async (transaction) => {
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
 		if (actions.length) await transaction.insert(moderationActions).values(actions);
-		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
+		const audits = auditRows(channelId, decisions.filter(() => undefined), false);
 		if (audits.length) await transaction.insert(auditLog).values(audits);
 	});
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:382:7
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
 		if (actions.length) await transaction.insert(moderationActions).values(actions);
 		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
-		if (audits.length) await transaction.insert(auditLog).values(audits);
+		if (false) await transaction.insert(auditLog).values(audits);
 	});
 }
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:382:7
 		await transaction.insert(comments).values(commentRows(channelId, decisions));
 		if (actions.length) await transaction.insert(moderationActions).values(actions);
 		const audits = auditRows(channelId, decisions.filter((decision) => !decision.youtubeAction), false);
-		if (audits.length) await transaction.insert(auditLog).values(audits);
+		if (true) await transaction.insert(auditLog).values(audits);
 	});
 }
killedBy: truncates the rule pattern in the stored reason at 80 characters
statusReason: expected [ Array(2) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/lib/server/pipeline.ts:386:53
 	});
 }
 
-function validAction(action: string): YoutubeAction {
-	if (action === 'hold' || action === 'reject' || action === 'delete' || action === 'ban') return action;
-	throw new Error(`moderation action is invalid: ${action}`);
-}
+function validAction(action: string): YoutubeAction {}
 
 function outstandingAction(action: typeof moderationActions.$inferSelect): OutstandingAction {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:387:50
 }
 
 function validAction(action: string): YoutubeAction {
-	if (action === 'hold' || action === 'reject' || action === 'delete' || action === 'ban') return action;
+	if (action === 'hold' || action === 'reject' || action !== 'delete' || action === 'ban') return action;
 	throw new Error(`moderation action is invalid: ${action}`);
 }
killedBy: rule delete action enforces deleteComment end-to-end
statusReason: moderation action is invalid: delete

[Killed] EqualityOperator
src/lib/server/pipeline.ts:387:73
 }
 
 function validAction(action: string): YoutubeAction {
-	if (action === 'hold' || action === 'reject' || action === 'delete' || action === 'ban') return action;
+	if (action === 'hold' || action === 'reject' || action === 'delete' || action !== 'ban') return action;
 	throw new Error(`moderation action is invalid: ${action}`);
 }
killedBy: categorizes score 0.95 as 'rejected'
statusReason: moderation action is invalid: ban

[Killed] StringLiteral
src/lib/server/pipeline.ts:388:18
 
 function validAction(action: string): YoutubeAction {
 	if (action === 'hold' || action === 'reject' || action === 'delete' || action === 'ban') return action;
-	throw new Error(`moderation action is invalid: ${action}`);
+	throw new Error(``);
 }
 
killedBy: fails loudly on an unknown stored moderation action
statusReason: expected [Function] to throw error including 'moderation action is invalid: explode' but got ''

[Killed] BlockStatement
src/lib/server/pipeline.ts:391:94
 	throw new Error(`moderation action is invalid: ${action}`);
 }
 
-function outstandingAction(action: typeof moderationActions.$inferSelect): OutstandingAction {
-	// Stryker disable next-line ConditionalExpression, BlockStatement: equivalent — the only caller queries with inArray(state, ['pending','dispatched']), so no other state can reach this guard
-	if (action.state !== 'pending' && action.state !== 'dispatched') {
-		// Stryker disable next-line StringLiteral: equivalent — unreachable for the same reason as the guard above
-		throw new Error(`moderation action ${action.commentId} has invalid outstanding state: ${action.state}`);
-	}
-	return { ...action, action: validAction(action.action), state: action.state };
-}
+function outstandingAction(action: typeof moderationActions.$inferSelect): OutstandingAction {}
 
 async function markDispatched(actions: OutstandingAction[]) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] EqualityOperator
src/lib/server/pipeline.ts:393:6
 
 function outstandingAction(action: typeof moderationActions.$inferSelect): OutstandingAction {
 	// Stryker disable next-line ConditionalExpression, BlockStatement: equivalent — the only caller queries with inArray(state, ['pending','dispatched']), so no other state can reach this guard
-	if (action.state !== 'pending' && action.state !== 'dispatched') {
+	if (action.state === 'pending' && action.state !== 'dispatched') {
 		// Stryker disable next-line StringLiteral: equivalent — unreachable for the same reason as the guard above
 		throw new Error(`moderation action ${action.commentId} has invalid outstanding state: ${action.state}`);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: moderation action comment has invalid outstanding state: pending

[Killed] EqualityOperator
src/lib/server/pipeline.ts:393:36
 
 function outstandingAction(action: typeof moderationActions.$inferSelect): OutstandingAction {
 	// Stryker disable next-line ConditionalExpression, BlockStatement: equivalent — the only caller queries with inArray(state, ['pending','dispatched']), so no other state can reach this guard
-	if (action.state !== 'pending' && action.state !== 'dispatched') {
+	if (action.state !== 'pending' && action.state === 'dispatched') {
 		// Stryker disable next-line StringLiteral: equivalent — unreachable for the same reason as the guard above
 		throw new Error(`moderation action ${action.commentId} has invalid outstanding state: ${action.state}`);
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: moderation action comment has invalid outstanding state: dispatched

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:402:6
 
 async function markDispatched(actions: OutstandingAction[]) {
-	if (!actions.length) return;
+	if (actions.length) return;
 	await db
 		.update(moderationActions)
killedBy: rule delete action enforces deleteComment end-to-end
statusReason: expected null to deeply equal Any<String>

[Killed] StringLiteral
src/lib/server/pipeline.ts:405:17
 	if (!actions.length) return;
 	await db
 		.update(moderationActions)
-		.set({ state: 'dispatched', lastAttemptAt: new Date().toISOString() })
+		.set({ state: "", lastAttemptAt: new Date().toISOString() })
 		.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
 }
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected [ { commentId: 'comment', …(7) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:406:59
 	await db
 		.update(moderationActions)
 		.set({ state: 'dispatched', lastAttemptAt: new Date().toISOString() })
-		.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
+		.where(inArray(moderationActions.commentId, actions.map(() => undefined)));
 }
 
killedBy: rule delete action enforces deleteComment end-to-end
statusReason: expected null to deeply equal Any<String>

[Killed] BlockStatement
src/lib/server/pipeline.ts:409:88
 		.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
 }
 
-async function claimPendingActions(actions: OutstandingAction[]): Promise<Set<string>> {
-	if (!actions.length) return new Set();
-	const claimed = await db
-		.update(moderationActions)
-		.set({ state: 'dispatched' })
-		.where(and(
-			inArray(moderationActions.commentId, actions.map((action) => action.commentId)),
-			eq(moderationActions.state, 'pending')
-		))
-		.returning({ commentId: moderationActions.commentId });
-	return new Set(claimed.map((row) => row.commentId));
-}
+async function claimPendingActions(actions: OutstandingAction[]): Promise<Set<string>> {}
 
 async function completeActions(actions: OutstandingAction[]) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:410:6
 }
 
 async function claimPendingActions(actions: OutstandingAction[]): Promise<Set<string>> {
-	if (!actions.length) return new Set();
+	if (actions.length) return new Set();
 	const claimed = await db
 		.update(moderationActions)
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:410:6
 }
 
 async function claimPendingActions(actions: OutstandingAction[]): Promise<Set<string>> {
-	if (!actions.length) return new Set();
+	if (false) return new Set();
 	const claimed = await db
 		.update(moderationActions)
killedBy: does not run the claim update when there is nothing pending to claim
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArrowFunction
src/lib/server/pipeline.ts:415:53
 		.update(moderationActions)
 		.set({ state: 'dispatched' })
 		.where(and(
-			inArray(moderationActions.commentId, actions.map((action) => action.commentId)),
+			inArray(moderationActions.commentId, actions.map(() => undefined)),
 			eq(moderationActions.state, 'pending')
 		))
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ObjectLiteral
src/lib/server/pipeline.ts:418:14
 			inArray(moderationActions.commentId, actions.map((action) => action.commentId)),
 			eq(moderationActions.state, 'pending')
 		))
-		.returning({ commentId: moderationActions.commentId });
+		.returning({});
 	return new Set(claimed.map((row) => row.commentId));
 }
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:419:29
 			eq(moderationActions.state, 'pending')
 		))
 		.returning({ commentId: moderationActions.commentId });
-	return new Set(claimed.map((row) => row.commentId));
+	return new Set(claimed.map(() => undefined));
 }
 
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:422:62
 	return new Set(claimed.map((row) => row.commentId));
 }
 
-async function completeActions(actions: OutstandingAction[]) {
-	// Stryker disable next-line ConditionalExpression: equivalent — all callers pass a non-empty array (applyModerationAction batches of ≥1, single verified or deleted actions)
-	if (!actions.length) return;
-	await db.transaction(async (transaction) => {
-		await transaction
-			.update(moderationActions)
-			.set({ state: 'completed' })
-			.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
-		await transaction.insert(auditLog).values(actions.map((action) => ({
-			channelId: action.channelId,
-			commentId: action.commentId,
-			action: action.action,
-			reason: action.reason,
-			actor: 'system',
-			createdAt: new Date().toISOString()
-		})));
-	});
-}
+async function completeActions(actions: OutstandingAction[]) {}
 
 async function verificationResult(
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:424:6
 
 async function completeActions(actions: OutstandingAction[]) {
 	// Stryker disable next-line ConditionalExpression: equivalent — all callers pass a non-empty array (applyModerationAction batches of ≥1, single verified or deleted actions)
-	if (!actions.length) return;
+	if (actions.length) return;
 	await db.transaction(async (transaction) => {
 		await transaction
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:425:46
 async function completeActions(actions: OutstandingAction[]) {
 	// Stryker disable next-line ConditionalExpression: equivalent — all callers pass a non-empty array (applyModerationAction batches of ≥1, single verified or deleted actions)
 	if (!actions.length) return;
-	await db.transaction(async (transaction) => {
-		await transaction
-			.update(moderationActions)
-			.set({ state: 'completed' })
-			.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
-		await transaction.insert(auditLog).values(actions.map((action) => ({
-			channelId: action.channelId,
-			commentId: action.commentId,
-			action: action.action,
-			reason: action.reason,
-			actor: 'system',
-			createdAt: new Date().toISOString()
-		})));
-	});
+	await db.transaction(async (transaction) => {});
 }
 
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:429:60
 		await transaction
 			.update(moderationActions)
 			.set({ state: 'completed' })
-			.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
+			.where(inArray(moderationActions.commentId, actions.map(() => undefined)));
 		await transaction.insert(auditLog).values(actions.map((action) => ({
 			channelId: action.channelId,
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected [ { commentId: 'comment', …(7) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:430:57
 			.update(moderationActions)
 			.set({ state: 'completed' })
 			.where(inArray(moderationActions.commentId, actions.map((action) => action.commentId)));
-		await transaction.insert(auditLog).values(actions.map((action) => ({
-			channelId: action.channelId,
-			commentId: action.commentId,
-			action: action.action,
-			reason: action.reason,
-			actor: 'system',
-			createdAt: new Date().toISOString()
-		})));
+		await transaction.insert(auditLog).values(actions.map(() => undefined));
 	});
 }
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [ undefined ] to deeply equal [ ObjectContaining{…} ]

[Killed] StringLiteral
src/lib/server/pipeline.ts:435:11
 			commentId: action.commentId,
 			action: action.action,
 			reason: action.reason,
-			actor: 'system',
+			actor: "",
 			createdAt: new Date().toISOString()
 		})));
killedBy: truncates the rule pattern in the stored reason at 80 characters
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:445:35
 	action: OutstandingAction,
 	accessToken: string,
 	deadline: number | undefined
-): Promise<'completed' | 'retry'> {
-	assertBeforeDeadline(deadline);
-	const status = await getCommentModerationStatus(action.commentId, accessToken, deadline);
-	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — the caller only compares result === 'completed', so every other string takes the identical retry path
-	if (action.action === 'delete') return status === null ? 'completed' : 'retry';
-	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
-	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'reject') return status === 'rejected' ? 'completed' : 'retry';
-	// Ban is a single atomic API call (reject + banAuthor), so a comment already
-	// in a terminal state after dispatch means the call landed — complete it
-	// rather than stranding the action in manual review.
-	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	return status === 'rejected' || status === null ? 'completed' : 'retry';
-}
+): Promise<'completed' | 'retry'> {}
 
 async function applyModerationAction(
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:449:6
 	assertBeforeDeadline(deadline);
 	const status = await getCommentModerationStatus(action.commentId, accessToken, deadline);
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — the caller only compares result === 'completed', so every other string takes the identical retry path
-	if (action.action === 'delete') return status === null ? 'completed' : 'retry';
+	if (false) return status === null ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
killedBy: verifies a dispatched 'delete' action (observed: 'rejected', completed: false)
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/server/pipeline.ts:449:41
 	assertBeforeDeadline(deadline);
 	const status = await getCommentModerationStatus(action.commentId, accessToken, deadline);
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — the caller only compares result === 'completed', so every other string takes the identical retry path
-	if (action.action === 'delete') return status === null ? 'completed' : 'retry';
+	if (action.action === 'delete') return status !== null ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
killedBy: verifies a dispatched 'delete' action (observed: null, completed: true)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "comment",

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:451:39
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — the caller only compares result === 'completed', so every other string takes the identical retry path
 	if (action.action === 'delete') return status === null ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
+	if (action.action === 'hold') return true ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'reject') return status === 'rejected' ? 'completed' : 'retry';
killedBy: verifies a dispatched 'hold' action (observed: 'published', completed: false)
statusReason: expected "vi.fn()" to be called with arguments: [ Array(5) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:451:6
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — the caller only compares result === 'completed', so every other string takes the identical retry path
 	if (action.action === 'delete') return status === null ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
+	if (false) return status === 'heldForReview' ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'reject') return status === 'rejected' ? 'completed' : 'retry';
killedBy: verifies a dispatched 'hold' action (observed: 'heldForReview', completed: true)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] EqualityOperator
src/lib/server/pipeline.ts:453:6
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'reject') return status === 'rejected' ? 'completed' : 'retry';
+	if (action.action !== 'reject') return status === 'rejected' ? 'completed' : 'retry';
 	// Ban is a single atomic API call (reject + banAuthor), so a comment already
 	// in a terminal state after dispatch means the call landed — complete it
killedBy: completes a dispatched ban when the comment is already terminal (null)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:453:6
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
 	if (action.action === 'hold') return status === 'heldForReview' ? 'completed' : 'retry';
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	if (action.action === 'reject') return status === 'rejected' ? 'completed' : 'retry';
+	if (true) return status === 'rejected' ? 'completed' : 'retry';
 	// Ban is a single atomic API call (reject + banAuthor), so a comment already
 	// in a terminal state after dispatch means the call landed — complete it
killedBy: completes a dispatched ban when the comment is already terminal (null)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] EqualityOperator
src/lib/server/pipeline.ts:458:34
 	// in a terminal state after dispatch means the call landed — complete it
 	// rather than stranding the action in manual review.
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	return status === 'rejected' || status === null ? 'completed' : 'retry';
+	return status === 'rejected' || status !== null ? 'completed' : 'retry';
 }
 
killedBy: completes a dispatched ban when the comment is already terminal (null)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] LogicalOperator
src/lib/server/pipeline.ts:458:9
 	// in a terminal state after dispatch means the call landed — complete it
 	// rather than stranding the action in manual review.
 	// Stryker disable next-line StringLiteral: 'retry'→"" equivalent — same reasoning as the delete branch above
-	return status === 'rejected' || status === null ? 'completed' : 'retry';
+	return status === 'rejected' && status === null ? 'completed' : 'retry';
 }
 
killedBy: completes a dispatched ban when the comment is already terminal ('rejected')
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] BlockStatement
src/lib/server/pipeline.ts:467:20
 	banAuthor: boolean,
 	accessToken: string,
 	deadline: number | undefined
-): Promise<number> {
-	let acted = 0;
-	for (let index = 0; index < actions.length; index += 50) {
-		const batch = actions.slice(index, index + 50);
-		await markDispatched(batch);
-		assertBeforeDeadline(deadline);
-		await setModerationStatus(batch.map((action) => action.commentId), status, banAuthor, accessToken, deadline);
-		await completeActions(batch);
-		acted += batch.length;
-	}
-	return acted;
-}
+): Promise<number> {}
 
 async function applyYoutubeActions(
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: NaN, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:469:59
 	deadline: number | undefined
 ): Promise<number> {
 	let acted = 0;
-	for (let index = 0; index < actions.length; index += 50) {
-		const batch = actions.slice(index, index + 50);
-		await markDispatched(batch);
-		assertBeforeDeadline(deadline);
-		await setModerationStatus(batch.map((action) => action.commentId), status, banAuthor, accessToken, deadline);
-		await completeActions(batch);
-		acted += batch.length;
-	}
+	for (let index = 0; index < actions.length; index += 50) {}
 	return acted;
 }
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:469:22
 	deadline: number | undefined
 ): Promise<number> {
 	let acted = 0;
-	for (let index = 0; index < actions.length; index += 50) {
+	for (let index = 0; false; index += 50) {
 		const batch = actions.slice(index, index + 50);
 		await markDispatched(batch);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArithmeticOperator
src/lib/server/pipeline.ts:470:38
 ): Promise<number> {
 	let acted = 0;
 	for (let index = 0; index < actions.length; index += 50) {
-		const batch = actions.slice(index, index + 50);
+		const batch = actions.slice(index, index - 50);
 		await markDispatched(batch);
 		assertBeforeDeadline(deadline);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/lib/server/pipeline.ts:470:17
 ): Promise<number> {
 	let acted = 0;
 	for (let index = 0; index < actions.length; index += 50) {
-		const batch = actions.slice(index, index + 50);
+		const batch = actions;
 		await markDispatched(batch);
 		assertBeforeDeadline(deadline);
killedBy: applies YouTube moderation in batches of 50
statusReason: expected [ 'c0', 'c1', 'c2', 'c3', 'c4', …(46) ] to have a length of 50 but got 51

[Killed] ArrowFunction
src/lib/server/pipeline.ts:473:39
 		const batch = actions.slice(index, index + 50);
 		await markDispatched(batch);
 		assertBeforeDeadline(deadline);
-		await setModerationStatus(batch.map((action) => action.commentId), status, banAuthor, accessToken, deadline);
+		await setModerationStatus(batch.map(() => undefined), status, banAuthor, accessToken, deadline);
 		await completeActions(batch);
 		acted += batch.length;
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'comment' ], 'rejected', …(3) ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] AssignmentOperator
src/lib/server/pipeline.ts:475:3
 		assertBeforeDeadline(deadline);
 		await setModerationStatus(batch.map((action) => action.commentId), status, banAuthor, accessToken, deadline);
 		await completeActions(batch);
-		acted += batch.length;
+		acted -= batch.length;
 	}
 	return acted;
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected { fetched: 1, acted: -1, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:484:20
 	actions: OutstandingAction[],
 	accessToken: string,
 	deadline: number | undefined
-): Promise<number> {
-	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
-	let acted = 0;
-	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
-	for (const action of selected('delete')) {
-		await markDispatched([action]);
-		assertBeforeDeadline(deadline);
-		await deleteComment(action.commentId, accessToken, deadline);
-		await completeActions([action]);
-		acted += 1;
-	}
-	return acted;
-}
+): Promise<number> {}
 
 async function processOutstandingActions(channelId: string, accessToken: string, deadline?: number): Promise<number> {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: undefined, …(4) } to match object { fetched: 1, acted: +0, …(4) }
