[Killed] ArrowFunction
src/lib/server/pipeline.ts:485:61
 	accessToken: string,
 	deadline: number | undefined
 ): Promise<number> {
-	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
+	const selected = (action: YoutubeAction) => actions.filter(() => undefined);
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrowFunction
src/lib/server/pipeline.ts:485:19
 	accessToken: string,
 	deadline: number | undefined
 ): Promise<number> {
-	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
+	const selected = () => undefined;
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
killedBy: categorizes score 0.5 as 'approved'
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:487:74
 ): Promise<number> {
 	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
 	let acted = 0;
-	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
+	acted += await applyModerationAction(selected('hold'), 'heldForReview', true, accessToken, deadline);
 	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
killedBy: rule hold action dispatches heldForReview to YouTube
statusReason: expected "vi.fn()" to be called with arguments: [ Array(5) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] AssignmentOperator
src/lib/server/pipeline.ts:487:2
 ): Promise<number> {
 	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
 	let acted = 0;
-	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
+	acted -= await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
killedBy: rule hold action dispatches heldForReview to YouTube
statusReason: expected { fetched: 1, acted: -1, …(4) } to match object { fetched: 1, acted: 1, dryRun: false }
(3 matching properties omitted from actual)

[Killed] AssignmentOperator
src/lib/server/pipeline.ts:488:2
 	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
+	acted -= await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
 	for (const action of selected('delete')) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected { fetched: 1, acted: -1, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:488:71
 	const selected = (action: YoutubeAction) => actions.filter((item) => item.action === action);
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
+	acted += await applyModerationAction(selected('reject'), 'rejected', true, accessToken, deadline);
 	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
 	for (const action of selected('delete')) {
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'comment' ], 'rejected', …(3) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:489:68
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
+	acted += await applyModerationAction(selected('ban'), 'rejected', false, accessToken, deadline);
 	for (const action of selected('delete')) {
 		await markDispatched([action]);
killedBy: categorizes score 0.95 as 'rejected'
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'comment' ], 'rejected', …(3) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] AssignmentOperator
src/lib/server/pipeline.ts:489:2
 	let acted = 0;
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
-	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
+	acted -= await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
 	for (const action of selected('delete')) {
 		await markDispatched([action]);
killedBy: categorizes score 0.95 as 'rejected'
statusReason: expected { fetched: 1, acted: -1, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:490:43
 	acted += await applyModerationAction(selected('hold'), 'heldForReview', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('reject'), 'rejected', false, accessToken, deadline);
 	acted += await applyModerationAction(selected('ban'), 'rejected', true, accessToken, deadline);
-	for (const action of selected('delete')) {
-		await markDispatched([action]);
-		assertBeforeDeadline(deadline);
-		await deleteComment(action.commentId, accessToken, deadline);
-		await completeActions([action]);
-		acted += 1;
-	}
+	for (const action of selected('delete')) {}
 	return acted;
 }
killedBy: rule delete action enforces deleteComment end-to-end
statusReason: expected [ { commentId: 'comment', …(7) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] AssignmentOperator
src/lib/server/pipeline.ts:495:3
 		assertBeforeDeadline(deadline);
 		await deleteComment(action.commentId, accessToken, deadline);
 		await completeActions([action]);
-		acted += 1;
+		acted -= 1;
 	}
 	return acted;
killedBy: rule delete action enforces deleteComment end-to-end
statusReason: expected { fetched: 1, acted: -1, …(4) } to match object { fetched: 1, acted: 1, dryRun: false }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/server/pipeline.ts:510:59
 		))
 		.all()).map(outstandingAction);
 	// Stryker disable next-line MethodExpression, ConditionalExpression: equivalent — claimPendingActions' SQL still guards eq(state, 'pending'), so handing it dispatched rows too claims nothing extra
-	const claimed = await claimPendingActions(actions.filter((action) => action.state === 'pending'));
+	const claimed = await claimPendingActions(actions.filter(() => undefined));
 	// Stryker disable next-line ArrayDeclaration: equivalent — applyYoutubeActions selects entries by their action field, so a foreign element in the array is never selected
 	const ready: OutstandingAction[] = [];
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:510:71
 		))
 		.all()).map(outstandingAction);
 	// Stryker disable next-line MethodExpression, ConditionalExpression: equivalent — claimPendingActions' SQL still guards eq(state, 'pending'), so handing it dispatched rows too claims nothing extra
-	const claimed = await claimPendingActions(actions.filter((action) => action.state === 'pending'));
+	const claimed = await claimPendingActions(actions.filter((action) => action.state !== 'pending'));
 	// Stryker disable next-line ArrayDeclaration: equivalent — applyYoutubeActions selects entries by their action field, so a foreign element in the array is never selected
 	const ready: OutstandingAction[] = [];
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:513:32
 	const claimed = await claimPendingActions(actions.filter((action) => action.state === 'pending'));
 	// Stryker disable next-line ArrayDeclaration: equivalent — applyYoutubeActions selects entries by their action field, so a foreign element in the array is never selected
 	const ready: OutstandingAction[] = [];
-	for (const action of actions) {
-		if (action.state === 'pending') {
-			// Only actions this run claimed may be applied; an empty claim means a
-			// concurrent run owns the action, so skip it to avoid duplicate enforcement.
-			// Stryker disable next-line StringLiteral: equivalent — a ready entry's state field is never read again; applyYoutubeActions groups by action only
-			if (claimed.has(action.commentId)) ready.push({ ...action, state: 'dispatched' });
-			continue;
-		}
-		let result: 'completed' | 'retry';
-		try {
-			result = await verificationResult(action, accessToken, deadline);
-		} catch (error) {
-			// Transient verification failures must not strand the action: leave it
-			// 'dispatched' so the next run re-verifies, and fail loudly.
-			if (error instanceof DeadlineExceededError) throw error;
-			throw new Error(
-				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
-			);
-		}
-		if (result === 'completed') {
-			await completeActions([action]);
-			continue;
-		}
-		ready.push(action);
-	}
+	for (const action of actions) {}
 	return applyYoutubeActions(ready, accessToken, deadline);
 }
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:514:7
 	// Stryker disable next-line ArrayDeclaration: equivalent — applyYoutubeActions selects entries by their action field, so a foreign element in the array is never selected
 	const ready: OutstandingAction[] = [];
 	for (const action of actions) {
-		if (action.state === 'pending') {
+		if (true) {
 			// Only actions this run claimed may be applied; an empty claim means a
 			// concurrent run owns the action, so skip it to avoid duplicate enforcement.
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:514:7
 	// Stryker disable next-line ArrayDeclaration: equivalent — applyYoutubeActions selects entries by their action field, so a foreign element in the array is never selected
 	const ready: OutstandingAction[] = [];
 	for (const action of actions) {
-		if (action.state === 'pending') {
+		if (false) {
 			// Only actions this run claimed may be applied; an empty claim means a
 			// concurrent run owns the action, so skip it to avoid duplicate enforcement.
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'comment' ], 'rejected', …(3) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:518:8
 			// Only actions this run claimed may be applied; an empty claim means a
 			// concurrent run owns the action, so skip it to avoid duplicate enforcement.
 			// Stryker disable next-line StringLiteral: equivalent — a ready entry's state field is never read again; applyYoutubeActions groups by action only
-			if (claimed.has(action.commentId)) ready.push({ ...action, state: 'dispatched' });
+			if (false) ready.push({ ...action, state: 'dispatched' });
 			continue;
 		}
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:518:8
 			// Only actions this run claimed may be applied; an empty claim means a
 			// concurrent run owns the action, so skip it to avoid duplicate enforcement.
 			// Stryker disable next-line StringLiteral: equivalent — a ready entry's state field is never read again; applyYoutubeActions groups by action only
-			if (claimed.has(action.commentId)) ready.push({ ...action, state: 'dispatched' });
+			if (true) ready.push({ ...action, state: 'dispatched' });
 			continue;
 		}
killedBy: skips a pending action already claimed by a concurrent run
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] BlockStatement
src/lib/server/pipeline.ts:522:7
 			continue;
 		}
 		let result: 'completed' | 'retry';
-		try {
-			result = await verificationResult(action, accessToken, deadline);
-		} catch (error) {
+		try {} catch (error) {
 			// Transient verification failures must not strand the action: leave it
 			// 'dispatched' so the next run re-verifies, and fail loudly.
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/server/pipeline.ts:524:19
 		let result: 'completed' | 'retry';
 		try {
 			result = await verificationResult(action, accessToken, deadline);
-		} catch (error) {
-			// Transient verification failures must not strand the action: leave it
-			// 'dispatched' so the next run re-verifies, and fail loudly.
-			if (error instanceof DeadlineExceededError) throw error;
-			throw new Error(
-				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
-			);
-		}
+		} catch (error) {}
 		if (result === 'completed') {
 			await completeActions([action]);
killedBy: keeps a dispatched action retriable when verification fails transiently
statusReason: promise resolved "{ fetched: 1, acted: 1, …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:527:8
 		} catch (error) {
 			// Transient verification failures must not strand the action: leave it
 			// 'dispatched' so the next run re-verifies, and fail loudly.
-			if (error instanceof DeadlineExceededError) throw error;
+			if (false) throw error;
 			throw new Error(
 				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
killedBy: returns a partial result when the deadline hits during dispatched-action verification
statusReason: moderation action comment verification failed: out of time

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:527:8
 		} catch (error) {
 			// Transient verification failures must not strand the action: leave it
 			// 'dispatched' so the next run re-verifies, and fail loudly.
-			if (error instanceof DeadlineExceededError) throw error;
+			if (true) throw error;
 			throw new Error(
 				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
killedBy: keeps a dispatched action retriable when verification fails transiently
statusReason: expected [Function] to throw error including 'verification failed' but got 'socket hang up'

[Killed] BlockStatement
src/lib/server/pipeline.ts:532:31
 				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
 			);
 		}
-		if (result === 'completed') {
-			await completeActions([action]);
-			continue;
-		}
+		if (result === 'completed') {}
 		ready.push(action);
 	}
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:532:7
 				`moderation action ${action.commentId} verification failed: ${error instanceof Error ? error.message : String(error)}`
 			);
 		}
-		if (result === 'completed') {
+		if (false) {
 			await completeActions([action]);
 			continue;
killedBy: verifies a dispatched action after its completion transaction fails
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/lib/server/pipeline.ts:545:3
 	channelId: string,
 	channel: typeof channels.$inferSelect,
 	page: CommentPage
-) {
-	// Compare instants, not strings: timestamps may carry different UTC offsets,
-	// so lexicographic order can select an older comment and move the cursor back.
-	const newest = page.comments.reduce<string | null>(
-		(best, comment) =>
-			best === null || Date.parse(comment.publishedAt) > Date.parse(best)
-				? comment.publishedAt
-				: best,
-		null
-	) ?? channel.cursor;
-	const scanCursor = channel.scanCursor ?? newest;
-	const complete = page.reachedCursor || !page.nextPageToken;
-	await db
-		.update(channels)
-		.set(
-			complete
-				? { cursor: scanCursor, nextPageToken: null, scanCursor: null }
-				: { nextPageToken: page.nextPageToken, scanCursor }
-		)
-		.where(eq(channels.id, channelId));
-}
+) {}
 
 /**
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [] to deep equally contain ObjectContaining{…}

[Killed] LogicalOperator
src/lib/server/pipeline.ts:548:17
 ) {
 	// Compare instants, not strings: timestamps may carry different UTC offsets,
 	// so lexicographic order can select an older comment and move the cursor back.
-	const newest = page.comments.reduce<string | null>(
-		(best, comment) =>
-			best === null || Date.parse(comment.publishedAt) > Date.parse(best)
-				? comment.publishedAt
-				: best,
-		null
-	) ?? channel.cursor;
+	const newest = page.comments.reduce<string | null>((best, comment) => best === null || Date.parse(comment.publishedAt) > Date.parse(best) ? comment.publishedAt : best, null) && channel.cursor;
 	const scanCursor = channel.scanCursor ?? newest;
 	const complete = page.reachedCursor || !page.nextPageToken;
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [ { cursor: null, …(2) } ] to deep equally contain ObjectContaining{…}

[Killed] ArrowFunction
src/lib/server/pipeline.ts:549:3
 	// Compare instants, not strings: timestamps may carry different UTC offsets,
 	// so lexicographic order can select an older comment and move the cursor back.
 	const newest = page.comments.reduce<string | null>(
-		(best, comment) =>
-			best === null || Date.parse(comment.publishedAt) > Date.parse(best)
-				? comment.publishedAt
-				: best,
+		() => undefined,
 		null
 	) ?? channel.cursor;
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [ { cursor: null, …(2) } ] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/lib/server/pipeline.ts:550:21
 	// so lexicographic order can select an older comment and move the cursor back.
 	const newest = page.comments.reduce<string | null>(
 		(best, comment) =>
-			best === null || Date.parse(comment.publishedAt) > Date.parse(best)
+			best === null || Date.parse(comment.publishedAt) <= Date.parse(best)
 				? comment.publishedAt
 				: best,
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [ { …(3) } ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:550:4
 	// so lexicographic order can select an older comment and move the cursor back.
 	const newest = page.comments.reduce<string | null>(
 		(best, comment) =>
-			best === null || Date.parse(comment.publishedAt) > Date.parse(best)
+			true
 				? comment.publishedAt
 				: best,
killedBy: keeps the newest timestamp even when it appears first on the page
statusReason: expected [ { …(3) } ] to deep equally contain ObjectContaining{…}

[Killed] LogicalOperator
src/lib/server/pipeline.ts:555:21
 				: best,
 		null
 	) ?? channel.cursor;
-	const scanCursor = channel.scanCursor ?? newest;
+	const scanCursor = channel.scanCursor && newest;
 	const complete = page.reachedCursor || !page.nextPageToken;
 	await db
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [ { cursor: null, …(2) } ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:556:19
 		null
 	) ?? channel.cursor;
 	const scanCursor = channel.scanCursor ?? newest;
-	const complete = page.reachedCursor || !page.nextPageToken;
+	const complete = false;
 	await db
 		.update(channels)
killedBy: persists the chronologically newest timestamp when UTC offsets differ
statusReason: expected [ { nextPageToken: null, …(1) } ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:556:19
 		null
 	) ?? channel.cursor;
 	const scanCursor = channel.scanCursor ?? newest;
-	const complete = page.reachedCursor || !page.nextPageToken;
+	const complete = true;
 	await db
 		.update(channels)
killedBy: persists the next page token when the scan is incomplete
statusReason: expected [ { …(3) } ] to deep equally contain ObjectContaining{…}

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:587:7
 	let dryRun = false;
 	try {
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
-		if (!channel) throw new Error(`channel not found: ${channelId}`);
+		if (channel) throw new Error(`channel not found: ${channelId}`);
 		if (!channel.active) return emptyResult();
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
killedBy: categorizes score 0.5 as 'approved'
statusReason: channel not found: channel

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:587:7
 	let dryRun = false;
 	try {
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
-		if (!channel) throw new Error(`channel not found: ${channelId}`);
+		if (true) throw new Error(`channel not found: ${channelId}`);
 		if (!channel.active) return emptyResult();
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
killedBy: categorizes score 0.5 as 'approved'
statusReason: channel not found: channel

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:588:7
 	try {
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
 		if (!channel) throw new Error(`channel not found: ${channelId}`);
-		if (!channel.active) return emptyResult();
+		if (true) return emptyResult();
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
 			throw new Error('DRY_RUN must be true or false');
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:588:7
 	try {
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
 		if (!channel) throw new Error(`channel not found: ${channelId}`);
-		if (!channel.active) return emptyResult();
+		if (channel.active) return emptyResult();
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
 			throw new Error('DRY_RUN must be true or false');
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:589:7
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
 		if (!channel) throw new Error(`channel not found: ${channelId}`);
 		if (!channel.active) return emptyResult();
-		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
+		if (true) {
 			throw new Error('DRY_RUN must be true or false');
 		}
killedBy: categorizes score 0.5 as 'approved'
statusReason: DRY_RUN must be true or false

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:589:7
 		const channel = await db.select().from(channels).where(eq(channels.id, channelId)).get();
 		if (!channel) throw new Error(`channel not found: ${channelId}`);
 		if (!channel.active) return emptyResult();
-		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
+		if (true && env.DRY_RUN !== 'false') {
 			throw new Error('DRY_RUN must be true or false');
 		}
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: DRY_RUN must be true or false

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:592:12
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
 			throw new Error('DRY_RUN must be true or false');
 		}
-		dryRun = forceDryRun === true || env.DRY_RUN === 'true';
+		dryRun = true;
 		// The window rescore skips the stored-IDs dedupe, so a live window run
 		// would stage duplicate decisions and enforce on re-fetched comments —
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/lib/server/pipeline.ts:592:36
 		if (env.DRY_RUN !== 'true' && env.DRY_RUN !== 'false') {
 			throw new Error('DRY_RUN must be true or false');
 		}
-		dryRun = forceDryRun === true || env.DRY_RUN === 'true';
+		dryRun = forceDryRun === true || env.DRY_RUN !== 'true';
 		// The window rescore skips the stored-IDs dedupe, so a live window run
 		// would stage duplicate decisions and enforce on re-fetched comments —
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:596:7
 		// The window rescore skips the stored-IDs dedupe, so a live window run
 		// would stage duplicate decisions and enforce on re-fetched comments —
 		// the combination is refused loudly, before any fetch or write.
-		if (window && !dryRun) throw new Error('window mode requires dry-run semantics (pass forceDryRun)');
+		if (true) throw new Error('window mode requires dry-run semantics (pass forceDryRun)');
 		const accessToken = await refreshAccessToken(decrypt(channel.refreshTokenEnc), deadline);
 		// Window mode (on-demand dry-run drain): one page bounded by the window,
killedBy: categorizes score 0.5 as 'approved'
statusReason: window mode requires dry-run semantics (pass forceDryRun)

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:596:17
 		// The window rescore skips the stored-IDs dedupe, so a live window run
 		// would stage duplicate decisions and enforce on re-fetched comments —
 		// the combination is refused loudly, before any fetch or write.
-		if (window && !dryRun) throw new Error('window mode requires dry-run semantics (pass forceDryRun)');
+		if (window && dryRun) throw new Error('window mode requires dry-run semantics (pass forceDryRun)');
 		const accessToken = await refreshAccessToken(decrypt(channel.refreshTokenEnc), deadline);
 		// Window mode (on-demand dry-run drain): one page bounded by the window,
killedBy: window mode fetches one page bounded by the window, ignoring the live cursor and checkpoint
statusReason: window mode requires dry-run semantics (pass forceDryRun)

[Killed] LogicalOperator
src/lib/server/pipeline.ts:610:15
 
 		const { decisions, failures } = await decideNewComments(channelId, page, {
 			accessToken,
-			toneLevel: channel.toneLevel ?? 1,
+			toneLevel: channel.toneLevel && 1,
 			protections: {
 				protectLgbtqia: channel.protectLgbtqia ?? 0,
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Number of calls: 0

[Killed] LogicalOperator
src/lib/server/pipeline.ts:612:21
 			accessToken,
 			toneLevel: channel.toneLevel ?? 1,
 			protections: {
-				protectLgbtqia: channel.protectLgbtqia ?? 0,
+				protectLgbtqia: channel.protectLgbtqia && 0,
 				protectWomen: channel.protectWomen ?? 0
 			},
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -4,10 +4,10 @@
      "videoDescription": "Video description",

[Killed] LogicalOperator
src/lib/server/pipeline.ts:613:19
 			toneLevel: channel.toneLevel ?? 1,
 			protections: {
 				protectLgbtqia: channel.protectLgbtqia ?? 0,
-				protectWomen: channel.protectWomen ?? 0
+				protectWomen: channel.protectWomen && 0
 			},
 			// Per-org BYOK (hosted plans): the org's own OpenAI key when stored,
killedBy: scores with the org-resolved OpenAI key (BYOK), threaded to both scorers
statusReason: expected "vi.fn()" to be called with arguments: [ 'A comment', { …(2) }, …(3) ]

Received:

  1st vi.fn() call:

@@ -5,9 +5,9 @@
      "videoTitle": "Video title",

[Killed] EqualityOperator
src/lib/server/pipeline.ts:619:13
 			// the deployment's env key otherwise (openaiKey.ts).
 			openAiKey: await resolveOpenAiKey(channel.orgId),
 			deadline,
-			rescore: window !== undefined
+			rescore: window === undefined
 		});
 		queued = decisions.filter((decision) => decision.auditAction === 'queue').length;
killedBy: window mode rescores comments already stored by real runs
statusReason: expected "vi.fn()" to be called at least once
