[Killed] ConditionalExpression
src/lib/server/pipeline.ts:619:13
 			// the deployment's env key otherwise (openaiKey.ts).
 			openAiKey: await resolveOpenAiKey(channel.orgId),
 			deadline,
-			rescore: window !== undefined
+			rescore: false
 		});
 		queued = decisions.filter((decision) => decision.auditAction === 'queue').length;
killedBy: window mode rescores comments already stored by real runs
statusReason: expected "vi.fn()" to be called at least once

[Killed] MethodExpression
src/lib/server/pipeline.ts:621:12
 			deadline,
 			rescore: window !== undefined
 		});
-		queued = decisions.filter((decision) => decision.auditAction === 'queue').length;
+		queued = decisions.length;
 
 		// Deletion may have committed during the YouTube/AI calls above: re-check
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:621:43
 			deadline,
 			rescore: window !== undefined
 		});
-		queued = decisions.filter((decision) => decision.auditAction === 'queue').length;
+		queued = decisions.filter((decision) => true).length;
 
 		// Deletion may have committed during the YouTube/AI calls above: re-check
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:626:7
 		// Deletion may have committed during the YouTube/AI calls above: re-check
 		// before any durable write (I3) so a deleted account gets no new rows.
 		await assertChannelActive(channelId);
-		if (dryRun) {
+		if (false) {
 			acted = decisions.filter((decision) => decision.youtubeAction).length;
 			const audits = auditRows(channelId, decisions, true);
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      [Function anonymous],

[Killed] BlockStatement
src/lib/server/pipeline.ts:626:15
 		// Deletion may have committed during the YouTube/AI calls above: re-check
 		// before any durable write (I3) so a deleted account gets no new rows.
 		await assertChannelActive(channelId);
-		if (dryRun) {
-			acted = decisions.filter((decision) => decision.youtubeAction).length;
-			const audits = auditRows(channelId, decisions, true);
-			if (audits.length) await db.insert(auditLog).values(audits);
-		} else {
+		if (dryRun) {} else {
 			await stageDecisions(channelId, decisions);
 		}
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/lib/server/pipeline.ts:627:12
 		// before any durable write (I3) so a deleted account gets no new rows.
 		await assertChannelActive(channelId);
 		if (dryRun) {
-			acted = decisions.filter((decision) => decision.youtubeAction).length;
+			acted = decisions.length;
 			const audits = auditRows(channelId, decisions, true);
 			if (audits.length) await db.insert(auditLog).values(audits);
killedBy: a dry run counts only enforceable decisions as acted
statusReason: expected { fetched: 1, acted: 1, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] ArrowFunction
src/lib/server/pipeline.ts:627:29
 		// before any durable write (I3) so a deleted account gets no new rows.
 		await assertChannelActive(channelId);
 		if (dryRun) {
-			acted = decisions.filter((decision) => decision.youtubeAction).length;
+			acted = decisions.filter(() => undefined).length;
 			const audits = auditRows(channelId, decisions, true);
 			if (audits.length) await db.insert(auditLog).values(audits);
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:628:51
 		await assertChannelActive(channelId);
 		if (dryRun) {
 			acted = decisions.filter((decision) => decision.youtubeAction).length;
-			const audits = auditRows(channelId, decisions, true);
+			const audits = auditRows(channelId, decisions, false);
 			if (audits.length) await db.insert(auditLog).values(audits);
 		} else {
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected [ { channelId: 'channel', …(5) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:629:8
 		if (dryRun) {
 			acted = decisions.filter((decision) => decision.youtubeAction).length;
 			const audits = auditRows(channelId, decisions, true);
-			if (audits.length) await db.insert(auditLog).values(audits);
+			if (true) await db.insert(auditLog).values(audits);
 		} else {
 			await stageDecisions(channelId, decisions);
killedBy: a dry run with no new comments writes nothing at all
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      SQLiteTable {

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:629:8
 		if (dryRun) {
 			acted = decisions.filter((decision) => decision.youtubeAction).length;
 			const audits = auditRows(channelId, decisions, true);
-			if (audits.length) await db.insert(auditLog).values(audits);
+			if (false) await db.insert(auditLog).values(audits);
 		} else {
 			await stageDecisions(channelId, decisions);
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:630:10
 			acted = decisions.filter((decision) => decision.youtubeAction).length;
 			const audits = auditRows(channelId, decisions, true);
 			if (audits.length) await db.insert(auditLog).values(audits);
-		} else {
-			await stageDecisions(channelId, decisions);
-		}
+		} else {}
 		// Fail loudly only after successful decisions are staged, and before the
 		// cursor advances, so the next run retries just the failed comments.
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:635:7
 		}
 		// Fail loudly only after successful decisions are staged, and before the
 		// cursor advances, so the next run retries just the failed comments.
-		if (failures.length) {
+		if (true) {
 			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join('; ')}`);
 		}
killedBy: categorizes score 0.5 as 'approved'
statusReason: moderation decision failed for 0 comment(s):

[Killed] BlockStatement
src/lib/server/pipeline.ts:635:24
 		}
 		// Fail loudly only after successful decisions are staged, and before the
 		// cursor advances, so the next run retries just the failed comments.
-		if (failures.length) {
-			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join('; ')}`);
-		}
+		if (failures.length) {}
 		if (dryRun) {
 			// Window-mode continuation is reported, never persisted here — the
killedBy: fails the run after staging when a comment decision throws, without advancing the cursor
statusReason: promise resolved "{ fetched: 2, acted: +0, …(4) }" instead of rejecting

[Killed] StringLiteral
src/lib/server/pipeline.ts:636:99
 		// Fail loudly only after successful decisions are staged, and before the
 		// cursor advances, so the next run retries just the failed comments.
 		if (failures.length) {
-			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join('; ')}`);
+			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join("")}`);
 		}
 		if (dryRun) {
killedBy: fails the run with every per-comment failure joined, each naming its comment
statusReason: expected [Function] to throw error including 'moderation decision failed for 2 comm…' but got 'moderation decision failed for 2 comm…'

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:638:7
 		if (failures.length) {
 			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join('; ')}`);
 		}
-		if (dryRun) {
+		if (true) {
 			// Window-mode continuation is reported, never persisted here — the
 			// caller owns the drain state (I8: a dry run touches no checkpoint).
killedBy: categorizes score 0.76 as 'rejected'
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/lib/server/pipeline.ts:638:15
 		if (failures.length) {
 			throw new Error(`moderation decision failed for ${failures.length} comment(s): ${failures.join('; ')}`);
 		}
-		if (dryRun) {
-			// Window-mode continuation is reported, never persisted here — the
-			// caller owns the drain state (I8: a dry run touches no checkpoint).
-			const windowState = window
-				? {
-						windowComplete: page.reachedCursor || !page.nextPageToken,
-						windowNextPageToken: page.reachedCursor ? null : page.nextPageToken
-					}
-				: {};
-			return { fetched, acted, queued, partial: false, skipped: false, dryRun, ...windowState };
-		}
+		if (dryRun) {}
 
 		// ... and again before any YouTube enforcement call.
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:643:45
 			// caller owns the drain state (I8: a dry run touches no checkpoint).
 			const windowState = window
 				? {
-						windowComplete: page.reachedCursor || !page.nextPageToken,
+						windowComplete: page.reachedCursor || page.nextPageToken,
 						windowNextPageToken: page.reachedCursor ? null : page.nextPageToken
 					}
killedBy: window mode reports continuation when the window has more pages, and persists nothing itself
statusReason: expected { fetched: 1, acted: +0, …(6) } to match object { windowComplete: false, …(1) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:643:23
 			// caller owns the drain state (I8: a dry run touches no checkpoint).
 			const windowState = window
 				? {
-						windowComplete: page.reachedCursor || !page.nextPageToken,
+						windowComplete: true,
 						windowNextPageToken: page.reachedCursor ? null : page.nextPageToken
 					}
killedBy: window mode reports continuation when the window has more pages, and persists nothing itself
statusReason: expected { fetched: 1, acted: +0, …(6) } to match object { windowComplete: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:647:62
 						windowNextPageToken: page.reachedCursor ? null : page.nextPageToken
 					}
 				: {};
-			return { fetched, acted, queued, partial: false, skipped: false, dryRun, ...windowState };
+			return { fetched, acted, queued, partial: false, skipped: true, dryRun, ...windowState };
 		}
 
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected { fetched: 1, acted: 1, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:647:46
 						windowNextPageToken: page.reachedCursor ? null : page.nextPageToken
 					}
 				: {};
-			return { fetched, acted, queued, partial: false, skipped: false, dryRun, ...windowState };
+			return { fetched, acted, queued, partial: true, skipped: false, dryRun, ...windowState };
 		}
 
killedBy: does not call YouTube moderation or deletion APIs during a dry run
statusReason: expected { fetched: 1, acted: 1, …(4) } to match object { fetched: 1, acted: 1, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:654:61
 		await assertChannelActive(channelId);
 		acted = await processOutstandingActions(channelId, accessToken, deadline);
 		await persistResults(channelId, channel, page);
-		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
+		return { fetched, acted, queued, partial: false, skipped: true, dryRun };
 	} catch (error) {
 		if (error instanceof DeadlineExceededError) {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:654:45
 		await assertChannelActive(channelId);
 		acted = await processOutstandingActions(channelId, accessToken, deadline);
 		await persistResults(channelId, channel, page);
-		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
+		return { fetched, acted, queued, partial: true, skipped: false, dryRun };
 	} catch (error) {
 		if (error instanceof DeadlineExceededError) {
killedBy: categorizes score 0.5 as 'approved'
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, acted: +0, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:655:18
 		acted = await processOutstandingActions(channelId, accessToken, deadline);
 		await persistResults(channelId, channel, page);
 		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
-	} catch (error) {
-		if (error instanceof DeadlineExceededError) {
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
-		}
-		if (error instanceof ChannelDeactivatedError) {
-			console.info(`stopping run for ${channelId}: ${error.message}`);
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
-		}
-		throw error;
-	}
+	} catch (error) {}
 }
 
killedBy: records successful remote actions before a later action fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/pipeline.ts:656:47
 		await persistResults(channelId, channel, page);
 		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 	} catch (error) {
-		if (error instanceof DeadlineExceededError) {
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
-		}
+		if (error instanceof DeadlineExceededError) {}
 		if (error instanceof ChannelDeactivatedError) {
 			console.info(`stopping run for ${channelId}: ${error.message}`);
killedBy: returns a partial result when the deadline hits during comment fetch
statusReason: out of time

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:656:7
 		await persistResults(channelId, channel, page);
 		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 	} catch (error) {
-		if (error instanceof DeadlineExceededError) {
+		if (false) {
 			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
 		}
killedBy: returns a partial result when the deadline hits during comment fetch
statusReason: out of time

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:657:61
 		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 	} catch (error) {
 		if (error instanceof DeadlineExceededError) {
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
+			return { fetched, acted, queued, partial: true, skipped: true, dryRun };
 		}
 		if (error instanceof ChannelDeactivatedError) {
killedBy: returns a partial result when the deadline hits during comment fetch
statusReason: expected { fetched: +0, acted: +0, …(4) } to deeply equal { fetched: +0, acted: +0, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:657:46
 		return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 	} catch (error) {
 		if (error instanceof DeadlineExceededError) {
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
+			return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 		}
 		if (error instanceof ChannelDeactivatedError) {
killedBy: returns a partial result when the deadline hits during comment fetch
statusReason: expected { fetched: +0, acted: +0, …(4) } to deeply equal { fetched: +0, acted: +0, …(4) }

[Killed] BlockStatement
src/lib/server/pipeline.ts:659:49
 		if (error instanceof DeadlineExceededError) {
 			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
 		}
-		if (error instanceof ChannelDeactivatedError) {
-			console.info(`stopping run for ${channelId}: ${error.message}`);
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
-		}
+		if (error instanceof ChannelDeactivatedError) {}
 		throw error;
 	}
killedBy: stops without new writes or YouTube calls when account deletion deactivates the channel mid-run
statusReason: channel deactivated mid-run: channel

[Killed] ConditionalExpression
src/lib/server/pipeline.ts:659:7
 		if (error instanceof DeadlineExceededError) {
 			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
 		}
-		if (error instanceof ChannelDeactivatedError) {
+		if (false) {
 			console.info(`stopping run for ${channelId}: ${error.message}`);
 			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
killedBy: stops without new writes or YouTube calls when account deletion deactivates the channel mid-run
statusReason: channel deactivated mid-run: channel

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:661:61
 		}
 		if (error instanceof ChannelDeactivatedError) {
 			console.info(`stopping run for ${channelId}: ${error.message}`);
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
+			return { fetched, acted, queued, partial: true, skipped: true, dryRun };
 		}
 		throw error;
killedBy: treats a vanished channel row as deactivated mid-run, logging and stopping loudly
statusReason: expected { fetched: 1, acted: +0, …(4) } to deeply equal { fetched: 1, acted: +0, …(4) }

[Killed] BooleanLiteral
src/lib/server/pipeline.ts:661:46
 		}
 		if (error instanceof ChannelDeactivatedError) {
 			console.info(`stopping run for ${channelId}: ${error.message}`);
-			return { fetched, acted, queued, partial: true, skipped: false, dryRun };
+			return { fetched, acted, queued, partial: false, skipped: false, dryRun };
 		}
 		throw error;
killedBy: stops without new writes or YouTube calls when account deletion deactivates the channel mid-run
statusReason: expected { fetched: 1, acted: +0, …(4) } to match object { fetched: 1, partial: true, …(1) }
(3 matching properties omitted from actual)
