[Killed] BooleanLiteral
src/lib/server/rules.ts:45:16
 function duplicateAlternation(body: string): boolean {
 	const alternatives = new Set<string>();
 	let depth = 0;
-	let escaped = false;
+	let escaped = true;
 	let characterClass = false;
 	let start = 0;
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: rule #30 has an unsafe regex

[Killed] BooleanLiteral
src/lib/server/rules.ts:46:23
 	const alternatives = new Set<string>();
 	let depth = 0;
 	let escaped = false;
-	let characterClass = false;
+	let characterClass = true;
 	let start = 0;
 	for (let index = 0; index <= body.length; index++) {
killedBy: unsafeRegexArb is always rejected by validateRule — never accepted-unsafe (I6)
statusReason: Property failed after 7 tests
{ seed: -108444556, path: "6", endOnFailure: true }
Counterexample: ["(foo|foo)"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/server/rules.ts:48:22
 	let escaped = false;
 	let characterClass = false;
 	let start = 0;
-	for (let index = 0; index <= body.length; index++) {
+	for (let index = 0; false; index++) {
 		const character = body[index];
 		if (index < body.length) {
killedBy: unsafeRegexArb is always rejected by validateRule — never accepted-unsafe (I6)
statusReason: Property failed after 1 tests
{ seed: 279229159, path: "0", endOnFailure: true }
Counterexample: ["(foo|foo)"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/lib/server/rules.ts:48:22
 	let escaped = false;
 	let characterClass = false;
 	let start = 0;
-	for (let index = 0; index <= body.length; index++) {
+	for (let index = 0; index > body.length; index++) {
 		const character = body[index];
 		if (index < body.length) {
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/server/rules.ts:50:7
 	let start = 0;
 	for (let index = 0; index <= body.length; index++) {
 		const character = body[index];
-		if (index < body.length) {
+		if (index <= body.length) {
 			if (escaped) {
 				escaped = false;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:50:7
 	let start = 0;
 	for (let index = 0; index <= body.length; index++) {
 		const character = body[index];
-		if (index < body.length) {
+		if (true) {
 			if (escaped) {
 				escaped = false;
killedBy: unsafeRegexArb is always rejected by validateRule — never accepted-unsafe (I6)
statusReason: Property failed after 1 tests
{ seed: 1265378916, path: "0", endOnFailure: true }
Counterexample: ["(foo|foo)"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/lib/server/rules.ts:51:17
 	for (let index = 0; index <= body.length; index++) {
 		const character = body[index];
 		if (index < body.length) {
-			if (escaped) {
-				escaped = false;
-				continue;
-			}
+			if (escaped) {}
 			if (character === '\\') {
 				escaped = true;
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: rule #30 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:51:8
 	for (let index = 0; index <= body.length; index++) {
 		const character = body[index];
 		if (index < body.length) {
-			if (escaped) {
+			if (false) {
 				escaped = false;
 				continue;
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: rule #30 has an unsafe regex

[Killed] BooleanLiteral
src/lib/server/rules.ts:52:15
 		const character = body[index];
 		if (index < body.length) {
 			if (escaped) {
-				escaped = false;
+				escaped = true;
 				continue;
 			}
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:55:28
 				escaped = false;
 				continue;
 			}
-			if (character === '\\') {
-				escaped = true;
-				continue;
-			}
+			if (character === '\\') {}
 			if (character === '[') {
 				characterClass = true;
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: rule #30 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:55:8
 				escaped = false;
 				continue;
 			}
-			if (character === '\\') {
+			if (true) {
 				escaped = true;
 				continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/server/rules.ts:56:15
 				continue;
 			}
 			if (character === '\\') {
-				escaped = true;
+				escaped = false;
 				continue;
 			}
killedBy: an escaped pipe does not split alternatives in duplicate detection
statusReason: rule #30 has an unsafe regex

[Killed] EqualityOperator
src/lib/server/rules.ts:59:8
 				escaped = true;
 				continue;
 			}
-			if (character === '[') {
+			if (character !== '[') {
 				characterClass = true;
 				continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:59:8
 				escaped = true;
 				continue;
 			}
-			if (character === '[') {
+			if (false) {
 				characterClass = true;
 				continue;
killedBy: pipes inside character classes do not split alternatives
statusReason: rule #32 has an unsafe regex

[Killed] BooleanLiteral
src/lib/server/rules.ts:60:22
 				continue;
 			}
 			if (character === '[') {
-				characterClass = true;
+				characterClass = false;
 				continue;
 			}
killedBy: pipes inside character classes do not split alternatives
statusReason: rule #32 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:63:8
 				characterClass = true;
 				continue;
 			}
-			if (character === ']') {
+			if (false) {
 				characterClass = false;
 				continue;
killedBy: duplicate alternatives inside a character class are still compared as whole alternatives
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:63:27
 				characterClass = true;
 				continue;
 			}
-			if (character === ']') {
-				characterClass = false;
-				continue;
-			}
+			if (character === ']') {}
 			if (characterClass) continue;
 			if (character === '(') {
killedBy: duplicate alternatives inside a character class are still compared as whole alternatives
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/server/rules.ts:64:22
 				continue;
 			}
 			if (character === ']') {
-				characterClass = false;
+				characterClass = true;
 				continue;
 			}
killedBy: duplicate alternatives inside a character class are still compared as whole alternatives
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:67:8
 				characterClass = false;
 				continue;
 			}
-			if (characterClass) continue;
+			if (true) continue;
 			if (character === '(') {
 				depth++;
killedBy: unsafeRegexArb is always rejected by validateRule — never accepted-unsafe (I6)
statusReason: Property failed after 1 tests
{ seed: -1613096381, path: "0", endOnFailure: true }
Counterexample: ["(foo|foo)"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/server/rules.ts:67:8
 				characterClass = false;
 				continue;
 			}
-			if (characterClass) continue;
+			if (false) continue;
 			if (character === '(') {
 				depth++;
killedBy: pipes inside character classes do not split alternatives
statusReason: rule #32 has an unsafe regex

[Killed] EqualityOperator
src/lib/server/rules.ts:68:8
 				continue;
 			}
 			if (characterClass) continue;
-			if (character === '(') {
+			if (character !== '(') {
 				depth++;
 				continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:68:27
 				continue;
 			}
 			if (characterClass) continue;
-			if (character === '(') {
-				depth++;
-				continue;
-			}
+			if (character === '(') {}
 			if (character === ')') {
 				depth--;
killedBy: pipes inside nested groups do not split alternatives
statusReason: rule #35 has an unsafe regex

[Killed] UpdateOperator
src/lib/server/rules.ts:69:5
 			}
 			if (characterClass) continue;
 			if (character === '(') {
-				depth++;
+				depth--;
 				continue;
 			}
killedBy: pipes inside nested groups do not split alternatives
statusReason: rule #35 has an unsafe regex

[Killed] EqualityOperator
src/lib/server/rules.ts:72:8
 				depth++;
 				continue;
 			}
-			if (character === ')') {
+			if (character !== ')') {
 				depth--;
 				continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:72:27
 				depth++;
 				continue;
 			}
-			if (character === ')') {
-				depth--;
-				continue;
-			}
+			if (character === ')') {}
 			if (character !== '|' || depth > 0) continue;
 		}
killedBy: nested group pipes do not split top-level alternatives
statusReason: expected [Function] to throw an error

[Killed] UpdateOperator
src/lib/server/rules.ts:73:5
 				continue;
 			}
 			if (character === ')') {
-				depth--;
+				depth++;
 				continue;
 			}
killedBy: nested group pipes do not split top-level alternatives
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/server/rules.ts:76:8
 				depth--;
 				continue;
 			}
-			if (character !== '|' || depth > 0) continue;
+			if (character !== '|' && depth > 0) continue;
 		}
 		const alternative = body.slice(start, index);
killedBy: accepts regex rules without overlapping alternation
statusReason: rule #9 has an unsafe regex

[Killed] EqualityOperator
src/lib/server/rules.ts:76:29
 				depth--;
 				continue;
 			}
-			if (character !== '|' || depth > 0) continue;
+			if (character !== '|' || depth >= 0) continue;
 		}
 		const alternative = body.slice(start, index);
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/lib/server/rules.ts:78:23
 			}
 			if (character !== '|' || depth > 0) continue;
 		}
-		const alternative = body.slice(start, index);
+		const alternative = body;
 		if (alternatives.has(alternative)) return true;
 		alternatives.add(alternative);
killedBy: accepts regex rules without overlapping alternation
statusReason: rule #9 has an unsafe regex

[Killed] BooleanLiteral
src/lib/server/rules.ts:79:45
 			if (character !== '|' || depth > 0) continue;
 		}
 		const alternative = body.slice(start, index);
-		if (alternatives.has(alternative)) return true;
+		if (alternatives.has(alternative)) return false;
 		alternatives.add(alternative);
 		start = index + 1;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:79:7
 			if (character !== '|' || depth > 0) continue;
 		}
 		const alternative = body.slice(start, index);
-		if (alternatives.has(alternative)) return true;
+		if (true) return true;
 		alternatives.add(alternative);
 		start = index + 1;
killedBy: accepts regex rules without overlapping alternation
statusReason: rule #9 has an unsafe regex

[Killed] ArithmeticOperator
src/lib/server/rules.ts:81:11
 		const alternative = body.slice(start, index);
 		if (alternatives.has(alternative)) return true;
 		alternatives.add(alternative);
-		start = index + 1;
+		start = index - 1;
 	}
 	return false;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/server/rules.ts:90:16
 function unsafeSyntax(pattern: string): boolean {
 	// Stryker disable next-line ArrayDeclaration: the sentinel is never popped — regex() compiles the pattern before unsafeRegex runs, so pops never exceed pushes for compilable patterns
 	const starts: number[] = [];
-	let escaped = false;
+	let escaped = true;
 	let characterClass = false;
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:93:22
 	let escaped = false;
 	let characterClass = false;
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
-	for (let index = 0; index < pattern.length; index++) {
+	for (let index = 0; false; index++) {
 		const character = pattern.charAt(index);
 		if (escaped) {
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Timeout] UpdateOperator
src/lib/server/rules.ts:93:46
 	let escaped = false;
 	let characterClass = false;
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
-	for (let index = 0; index < pattern.length; index++) {
+	for (let index = 0; index < pattern.length; index--) {
 		const character = pattern.charAt(index);
 		if (escaped) {

[Killed] MethodExpression
src/lib/server/rules.ts:94:21
 	let characterClass = false;
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
 	for (let index = 0; index < pattern.length; index++) {
-		const character = pattern.charAt(index);
+		const character = pattern;
 		if (escaped) {
 			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:95:16
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
 	for (let index = 0; index < pattern.length; index++) {
 		const character = pattern.charAt(index);
-		if (escaped) {
-			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
-			escaped = false;
-			continue;
-		}
+		if (escaped) {}
 		if (character === '\\') {
 			escaped = true;
killedBy: rejects numeric backreferences
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:95:7
 	// Stryker disable next-line EqualityOperator: `<=` only adds an iteration where charAt returns '', which matches no branch and is a no-op
 	for (let index = 0; index < pattern.length; index++) {
 		const character = pattern.charAt(index);
-		if (escaped) {
+		if (true) {
 			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
 			escaped = false;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/server/rules.ts:96:48
 	for (let index = 0; index < pattern.length; index++) {
 		const character = pattern.charAt(index);
 		if (escaped) {
-			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
+			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' || pattern[index + 1] === '<')) return true;
 			escaped = false;
 			continue;
killedBy: escaped character classes are not backreferences
statusReason: rule #61 has an unsafe regex

[Killed] EqualityOperator
src/lib/server/rules.ts:96:69
 	for (let index = 0; index < pattern.length; index++) {
 		const character = pattern.charAt(index);
 		if (escaped) {
-			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
+			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] !== '<')) return true;
 			escaped = false;
 			continue;
killedBy: an escaped k without a following < is not a backreference
statusReason: rule #39 has an unsafe regex

[Killed] BooleanLiteral
src/lib/server/rules.ts:97:14
 		const character = pattern.charAt(index);
 		if (escaped) {
 			if (BACKREFERENCE_DIGIT.test(character) || (character === 'k' && pattern[index + 1] === '<')) return true;
-			escaped = false;
+			escaped = true;
 			continue;
 		}
killedBy: safeRegexArb always passes validateRule
statusReason: Property failed after 4 tests
{ seed: 761507680, path: "3", endOnFailure: true }
Counterexample: ["\\bclick\\b|[aeiou]{2}"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/lib/server/rules.ts:100:7
 			escaped = false;
 			continue;
 		}
-		if (character === '\\') {
+		if (character !== '\\') {
 			escaped = true;
 			continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:100:7
 			escaped = false;
 			continue;
 		}
-		if (character === '\\') {
+		if (false) {
 			escaped = true;
 			continue;
killedBy: unsafeRegexArb is always rejected by validateRule — never accepted-unsafe (I6)
statusReason: Property failed after 3 tests
{ seed: 1282405467, path: "2", endOnFailure: true }
Counterexample: ["(spam)\\1"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/server/rules.ts:104:7
 			escaped = true;
 			continue;
 		}
-		if (character === '[') {
+		if (true) {
 			characterClass = true;
 			continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:104:26
 			escaped = true;
 			continue;
 		}
-		if (character === '[') {
-			characterClass = true;
-			continue;
-		}
+		if (character === '[') {}
 		if (character === ']') {
 			characterClass = false;
killedBy: unbalanced group closers inside character classes do not pair with real groups
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/server/rules.ts:108:7
 			characterClass = true;
 			continue;
 		}
-		if (character === ']') {
+		if (character !== ']') {
 			characterClass = false;
 			continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:113:26
 			continue;
 		}
 		if (characterClass) continue;
-		if (character === '(') {
-			starts.push(index);
-			continue;
-		}
+		if (character === '(') {}
 		if (character === ')') {
 			const start = starts.pop();
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:113:7
 			continue;
 		}
 		if (characterClass) continue;
-		if (character === '(') {
+		if (false) {
 			starts.push(index);
 			continue;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:117:26
 			starts.push(index);
 			continue;
 		}
-		if (character === ')') {
-			const start = starts.pop();
-			// Stryker disable next-line ConditionalExpression: unreachable — the pattern compiled in regex() before this runs, so every `)` pairs with a pushed `(`
-			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
-			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
-			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
-			if (duplicateAlternation(body)) return true;
-		}
+		if (character === ')') {}
 	}
 	return false;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:117:7
 			starts.push(index);
 			continue;
 		}
-		if (character === ')') {
+		if (true) {
 			const start = starts.pop();
 			// Stryker disable next-line ConditionalExpression: unreachable — the pattern compiled in regex() before this runs, so every `)` pairs with a pushed `(`
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/server/rules.ts:120:8
 		if (character === ')') {
 			const start = starts.pop();
 			// Stryker disable next-line ConditionalExpression: unreachable — the pattern compiled in regex() before this runs, so every `)` pairs with a pushed `(`
-			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
+			if (start !== undefined) continue; // unbalanced: new RegExp reports the pattern invalid
 			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
 			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/lib/server/rules.ts:122:31
 			// Stryker disable next-line ConditionalExpression: unreachable — the pattern compiled in regex() before this runs, so every `)` pairs with a pushed `(`
 			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
 			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
-			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
+			const body = pattern.slice(start - 1, index).replace(GROUP_PREFIX, '');
 			if (duplicateAlternation(body)) return true;
 		}
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/lib/server/rules.ts:122:17
 			// Stryker disable next-line ConditionalExpression: unreachable — the pattern compiled in regex() before this runs, so every `)` pairs with a pushed `(`
 			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
 			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
-			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
+			const body = pattern.replace(GROUP_PREFIX, '');
 			if (duplicateAlternation(body)) return true;
 		}
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:123:8
 			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
 			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
 			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
-			if (duplicateAlternation(body)) return true;
+			if (false) return true;
 		}
 	}
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/server/rules.ts:123:43
 			if (start === undefined) continue; // unbalanced: new RegExp reports the pattern invalid
 			// Strip the group prefix (`?:`, `?=`, `?!`, `?<=`, `?<!`, `?<name>`, `?flags:`) before comparing alternatives.
 			const body = pattern.slice(start + 1, index).replace(GROUP_PREFIX, '');
-			if (duplicateAlternation(body)) return true;
+			if (duplicateAlternation(body)) return false;
 		}
 	}
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:129:48
 	return false;
 }
 
-function unsafeRegex(pattern: string): boolean {
-	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
-	if (unsafeSyntax(pattern)) return true;
-	try {
-		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
-		return checkSync(pattern, 'i').status !== 'safe';
-	} catch (error) {
-		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
-		return true;
-	}
-}
+function unsafeRegex(pattern: string): boolean {}
 
 function regex(rule: RuleRow): RegExp {
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/server/rules.ts:130:6
 }
 
 function unsafeRegex(pattern: string): boolean {
-	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
+	if (pattern.length <= MAX_REGEX_PATTERN_LENGTH) return true;
 	if (unsafeSyntax(pattern)) return true;
 	try {
killedBy: matches keyword, user ID, and regex rules
statusReason: rule #3 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:130:6
 }
 
 function unsafeRegex(pattern: string): boolean {
-	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
+	if (true) return true;
 	if (unsafeSyntax(pattern)) return true;
 	try {
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: rule #1 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:131:6
 
 function unsafeRegex(pattern: string): boolean {
 	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
-	if (unsafeSyntax(pattern)) return true;
+	if (true) return true;
 	try {
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: rule #1 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:131:6
 
 function unsafeRegex(pattern: string): boolean {
 	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
-	if (unsafeSyntax(pattern)) return true;
+	if (false) return true;
 	try {
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:132:6
 function unsafeRegex(pattern: string): boolean {
 	if (pattern.length > MAX_REGEX_PATTERN_LENGTH) return true;
 	if (unsafeSyntax(pattern)) return true;
-	try {
-		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
-		return checkSync(pattern, 'i').status !== 'safe';
-	} catch (error) {
+	try {} catch (error) {
 		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
 		return true;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:134:10
 	if (unsafeSyntax(pattern)) return true;
 	try {
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
-		return checkSync(pattern, 'i').status !== 'safe';
+		return false;
 	} catch (error) {
 		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/lib/server/rules.ts:134:10
 	if (unsafeSyntax(pattern)) return true;
 	try {
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
-		return checkSync(pattern, 'i').status !== 'safe';
+		return checkSync(pattern, 'i').status === 'safe';
 	} catch (error) {
 		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
killedBy: matches keyword, user ID, and regex rules
statusReason: rule #3 has an unsafe regex

[Killed] BlockStatement
src/lib/server/rules.ts:135:18
 	try {
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
 		return checkSync(pattern, 'i').status !== 'safe';
-	} catch (error) {
-		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
-		return true;
-	}
+	} catch (error) {}
 }
 
killedBy: a recheck failure rejects the pattern loudly as unsafe
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/server/rules.ts:136:16
 		// 'unknown' means recheck could not prove the pattern safe; reject it loudly rather than risk ReDoS.
 		return checkSync(pattern, 'i').status !== 'safe';
 	} catch (error) {
-		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
+		console.warn(``, error);
 		return true;
 	}
killedBy: a recheck failure rejects the pattern loudly as unsafe
statusReason: expected "warn" to be called with arguments: [ …(2) ]

Received:

  1st warn call:

  [
-   "recheck could not analyze a rule pattern; rejecting it as unsafe:",

[Killed] BooleanLiteral
src/lib/server/rules.ts:137:10
 		return checkSync(pattern, 'i').status !== 'safe';
 	} catch (error) {
 		console.warn(`recheck could not analyze a rule pattern; rejecting it as unsafe:`, error);
-		return true;
+		return false;
 	}
 }
killedBy: a recheck failure rejects the pattern loudly as unsafe
statusReason: expected [Function] to throw an error
