[Killed] BlockStatement
src/lib/server/rules.ts:141:39
 	}
 }
 
-function regex(rule: RuleRow): RegExp {
-	let compiled: RegExp;
-	try {
-		// nosemgrep: unsafeRegex below rejects overly long, backreferencing, duplicate-alternation, and ReDoS-prone patterns.
-		compiled = new RegExp(rule.pattern, 'i');
-	} catch (error) {
-		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
-	}
-	if (unsafeRegex(rule.pattern)) throw new Error(`rule #${rule.id} has an unsafe regex`);
-	return compiled;
-}
+function regex(rule: RuleRow): RegExp {}
 
 function assertShape(rule: RuleRow): void {
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: moderation decision failed for 2 comment(s): comment a: Cannot read properties of undefined (reading 'score'); comment b: Cannot read properties of undefined (reading 'score')

[Killed] BlockStatement
src/lib/server/rules.ts:143:6
 
 function regex(rule: RuleRow): RegExp {
 	let compiled: RegExp;
-	try {
-		// nosemgrep: unsafeRegex below rejects overly long, backreferencing, duplicate-alternation, and ReDoS-prone patterns.
-		compiled = new RegExp(rule.pattern, 'i');
-	} catch (error) {
+	try {} catch (error) {
 		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
 	}
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 3, type: 'regex', …(2) } // Object.is equality

[Killed] StringLiteral
src/lib/server/rules.ts:145:39
 	let compiled: RegExp;
 	try {
 		// nosemgrep: unsafeRegex below rejects overly long, backreferencing, duplicate-alternation, and ReDoS-prone patterns.
-		compiled = new RegExp(rule.pattern, 'i');
+		compiled = new RegExp(rule.pattern, "");
 	} catch (error) {
 		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 3, type: 'regex', …(2) } // Object.is equality

[Killed] BlockStatement
src/lib/server/rules.ts:146:18
 	try {
 		// nosemgrep: unsafeRegex below rejects overly long, backreferencing, duplicate-alternation, and ReDoS-prone patterns.
 		compiled = new RegExp(rule.pattern, 'i');
-	} catch (error) {
-		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
-	}
+	} catch (error) {}
 	if (unsafeRegex(rule.pattern)) throw new Error(`rule #${rule.id} has an unsafe regex`);
 	return compiled;
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw error matching /rule #2 has an invalid regex/ but got 'rule #2 has an unsafe regex'

[Killed] ConditionalExpression
src/lib/server/rules.ts:149:6
 	} catch (error) {
 		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
 	}
-	if (unsafeRegex(rule.pattern)) throw new Error(`rule #${rule.id} has an unsafe regex`);
+	if (true) throw new Error(`rule #${rule.id} has an unsafe regex`);
 	return compiled;
 }
killedBy: validates and compiles each regex rule once per run, not per comment
statusReason: rule #1 has an unsafe regex

[Killed] ConditionalExpression
src/lib/server/rules.ts:149:6
 	} catch (error) {
 		throw new Error(`rule #${rule.id} has an invalid regex: ${error instanceof Error ? error.message : String(error)}`);
 	}
-	if (unsafeRegex(rule.pattern)) throw new Error(`rule #${rule.id} has an unsafe regex`);
+	if (false) throw new Error(`rule #${rule.id} has an unsafe regex`);
 	return compiled;
 }
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:153:43
 	return compiled;
 }
 
-function assertShape(rule: RuleRow): void {
-	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {
-		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
-	}
-	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
-		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
-	}
-	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
-}
+function assertShape(rule: RuleRow): void {}
 
 export function validateRule(rule: RuleRow): asserts rule is RuleRow & { type: (typeof RULE_TYPES)[number]; action: RuleAction } {
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:154:6
 }
 
 function assertShape(rule: RuleRow): void {
-	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {
+	if (false) {
 		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
 	}
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:154:70
 }
 
 function assertShape(rule: RuleRow): void {
-	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {
-		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
-	}
+	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {}
 	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
 		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/rules.ts:157:57
 	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {
 		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
 	}
-	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
-		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
-	}
+	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {}
 	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
 }
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/server/rules.ts:157:6
 	if (!RULE_TYPES.includes(rule.type as (typeof RULE_TYPES)[number])) {
 		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
 	}
-	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
+	if (RULE_ACTIONS.includes(rule.action as RuleAction)) {
 		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
 	}
killedBy: matches keyword, user ID, and regex rules
statusReason: rule #1 has an unsupported action: hold

[Killed] StringLiteral
src/lib/server/rules.ts:158:19
 		throw new Error(`rule #${rule.id} has an unsupported type: ${rule.type}`);
 	}
 	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
-		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
+		throw new Error(``);
 	}
 	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
killedBy: rejects invalid stored rules
statusReason: expected [Function] to throw error matching /rule #4 has an unsupported action/ but got ''

[Killed] ConditionalExpression
src/lib/server/rules.ts:160:6
 	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
 		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
 	}
-	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
+	if (false) throw new Error(`rule #${rule.id} has an empty pattern`);
 }
 
killedBy: validates malformed rows before touching their pattern during ordering
statusReason: expected [Function] to throw error matching /rule #12 has an empty pattern/ but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
src/lib/server/rules.ts:160:6
 	if (!RULE_ACTIONS.includes(rule.action as RuleAction)) {
 		throw new Error(`rule #${rule.id} has an unsupported action: ${rule.action}`);
 	}
-	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
+	if (rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
 }
 
killedBy: matches keyword, user ID, and regex rules
statusReason: rule #1 has an empty pattern

[Killed] BlockStatement
src/lib/server/rules.ts:163:130
 	if (!rule.pattern) throw new Error(`rule #${rule.id} has an empty pattern`);
 }
 
-export function validateRule(rule: RuleRow): asserts rule is RuleRow & { type: (typeof RULE_TYPES)[number]; action: RuleAction } {
-	assertShape(rule);
-	if (rule.type === 'regex') regex(rule);
-}
+export function validateRule(rule: RuleRow): asserts rule is RuleRow & { type: (typeof RULE_TYPES)[number]; action: RuleAction } {}
 
 /** A validated rule with its regex (if any) compiled, ready for matching. */
killedBy: validateRule accepts valid rules and validates regex patterns only for regex rules
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/server/rules.ts:165:6
 
 export function validateRule(rule: RuleRow): asserts rule is RuleRow & { type: (typeof RULE_TYPES)[number]; action: RuleAction } {
 	assertShape(rule);
-	if (rule.type === 'regex') regex(rule);
+	if (rule.type !== 'regex') regex(rule);
 }
 
killedBy: validateRule accepts valid rules and validates regex patterns only for regex rules
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/server/rules.ts:165:6
 
 export function validateRule(rule: RuleRow): asserts rule is RuleRow & { type: (typeof RULE_TYPES)[number]; action: RuleAction } {
 	assertShape(rule);
-	if (rule.type === 'regex') regex(rule);
+	if (true) regex(rule);
 }
 
killedBy: validateRule accepts valid rules and validates regex patterns only for regex rules
statusReason: expected [Function] to not throw an error but 'Error: rule #54 has an invalid regex:…' was thrown

[Killed] BlockStatement
src/lib/server/rules.ts:184:64
  *
  * @throws If a stored rule is invalid.
  */
-export function prepareRules(rules: RuleRow[]): PreparedRule[] {
-	const prepared = rules.map((rule) => {
-		assertShape(rule);
-		const valid = rule as PreparedRule['rule'];
-		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
-	});
-	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
-	return prepared;
-}
+export function prepareRules(rules: RuleRow[]): PreparedRule[] {}
 
 /** Finds the prepared rule that matches the comment or its author. */
killedBy: matches keyword, user ID, and regex rules
statusReason: prepared is not iterable

[Killed] BlockStatement
src/lib/server/rules.ts:185:39
  * @throws If a stored rule is invalid.
  */
 export function prepareRules(rules: RuleRow[]): PreparedRule[] {
-	const prepared = rules.map((rule) => {
-		assertShape(rule);
-		const valid = rule as PreparedRule['rule'];
-		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
-	});
+	const prepared = rules.map((rule) => {});
 	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
 	return prepared;
killedBy: matches keyword, user ID, and regex rules
statusReason: Cannot destructure property 'rule' of '.for' as it is undefined.

[Killed] ConditionalExpression
src/lib/server/rules.ts:188:35
 	const prepared = rules.map((rule) => {
 		assertShape(rule);
 		const valid = rule as PreparedRule['rule'];
-		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
+		return { rule: valid, compiled: false ? regex(rule) : null };
 	});
 	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 3, type: 'regex', …(2) } // Object.is equality

[Killed] EqualityOperator
src/lib/server/rules.ts:188:35
 	const prepared = rules.map((rule) => {
 		assertShape(rule);
 		const valid = rule as PreparedRule['rule'];
-		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
+		return { rule: valid, compiled: rule.type !== 'regex' ? regex(rule) : null };
 	});
 	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 3, type: 'regex', …(2) } // Object.is equality

[Killed] ArithmeticOperator
src/lib/server/rules.ts:190:26
 		const valid = rule as PreparedRule['rule'];
 		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
 	});
-	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
+	prepared.sort((a, b) => b.rule.pattern.length + a.rule.pattern.length);
 	return prepared;
 }
killedBy: most specific pattern wins regardless of stored order
statusReason: expected { id: 10, type: 'keyword', …(2) } to be { id: 11, type: 'keyword', …(2) } // Object.is equality

[Killed] ArrowFunction
src/lib/server/rules.ts:190:16
 		const valid = rule as PreparedRule['rule'];
 		return { rule: valid, compiled: rule.type === 'regex' ? regex(rule) : null };
 	});
-	prepared.sort((a, b) => b.rule.pattern.length - a.rule.pattern.length);
+	prepared.sort(() => undefined);
 	return prepared;
 }
killedBy: most specific pattern wins regardless of stored order
statusReason: expected { id: 10, type: 'keyword', …(2) } to be { id: 11, type: 'keyword', …(2) } // Object.is equality

[Killed] BlockStatement
src/lib/server/rules.ts:195:129
 }
 
 /** Finds the prepared rule that matches the comment or its author. */
-export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {
-	const lower = text.toLowerCase();
-	for (const { rule, compiled } of prepared) {
-		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
-		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
-		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
-		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
-		if (compiled?.test(text)) return rule;
-	}
-	return null;
-}
+export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {}
 
 /**
killedBy: matches keyword, user ID, and regex rules
statusReason: expected undefined to be { id: 1, type: 'keyword', …(2) } // Object.is equality

[Killed] MethodExpression
src/lib/server/rules.ts:196:16
 
 /** Finds the prepared rule that matches the comment or its author. */
 export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {
-	const lower = text.toLowerCase();
+	const lower = text.toUpperCase();
 	for (const { rule, compiled } of prepared) {
 		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 1, type: 'keyword', …(2) } // Object.is equality

[Killed] BlockStatement
src/lib/server/rules.ts:197:45
 /** Finds the prepared rule that matches the comment or its author. */
 export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {
 	const lower = text.toLowerCase();
-	for (const { rule, compiled } of prepared) {
-		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
-		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
-		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
-		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
-		if (compiled?.test(text)) return rule;
-	}
+	for (const { rule, compiled } of prepared) {}
 	return null;
 }
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 1, type: 'keyword', …(2) } // Object.is equality

[Killed] LogicalOperator
src/lib/server/rules.ts:198:7
 export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {
 	const lower = text.toLowerCase();
 	for (const { rule, compiled } of prepared) {
-		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
+		if (rule.type === 'keyword' || lower.includes(rule.pattern.toLowerCase())) return rule;
 		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
killedBy: matches keyword, user ID, and regex rules
statusReason: expected { id: 1, type: 'keyword', …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/rules.ts:198:7
 export function matchPreparedRule(text: string, authorChannelId: string, prepared: PreparedRule[]): PreparedRule['rule'] | null {
 	const lower = text.toLowerCase();
 	for (const { rule, compiled } of prepared) {
-		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
+		if (false) return rule;
 		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 1, type: 'keyword', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/lib/server/rules.ts:199:7
 	const lower = text.toLowerCase();
 	for (const { rule, compiled } of prepared) {
 		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
-		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
+		if (false) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
 		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 2, type: 'user', …(2) } // Object.is equality

[Killed] EqualityOperator
src/lib/server/rules.ts:199:7
 	const lower = text.toLowerCase();
 	for (const { rule, compiled } of prepared) {
 		if (rule.type === 'keyword' && lower.includes(rule.pattern.toLowerCase())) return rule;
-		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
+		if (rule.type !== 'user' && authorChannelId === rule.pattern) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
 		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 2, type: 'user', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/lib/server/rules.ts:202:7
 		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
 		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
-		if (compiled?.test(text)) return rule;
+		if (false) return rule;
 	}
 	return null;
killedBy: matches keyword, user ID, and regex rules
statusReason: expected null to be { id: 3, type: 'regex', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/lib/server/rules.ts:202:7
 		if (rule.type === 'user' && authorChannelId === rule.pattern) return rule;
 		// nosemgrep: `compiled` only ever comes from regex() above, which rejects overly long,
 		// backreferencing, duplicate-alternation, and recheck-unprovable patterns (I6).
-		if (compiled?.test(text)) return rule;
+		if (true) return rule;
 	}
 	return null;
killedBy: matches keyword, user ID, and regex rules
statusReason: expected { id: 2, type: 'user', …(2) } to be null

[Killed] BlockStatement
src/lib/server/rules.ts:215:100
  *
  * @throws If a stored rule is invalid.
  */
-export function matchRule(text: string, authorChannelId: string, rules: RuleRow[]): RuleRow | null {
-	return matchPreparedRule(text, authorChannelId, prepareRules(rules));
-}
+export function matchRule(text: string, authorChannelId: string, rules: RuleRow[]): RuleRow | null {}
 
killedBy: matches keyword, user ID, and regex rules
statusReason: expected undefined to be { id: 1, type: 'keyword', …(2) } // Object.is equality
