[Killed] BlockStatement
src/lib/server/session.ts:61:50
 	userId: string,
 	handle: Pick<typeof db, 'delete' | 'insert'> = db,
 	activeOrgId: string | null = null
-): Promise<{ token: string; expiresAt: string }> {
-	// Opportunistic cleanup: logins are infrequent, so this bounds the expired-row
-	// buildup for users who never come back (lazy per-token delete can't catch those).
-	const now = new Date();
-	await handle.delete(sessions).where(lte(sessions.expiresAt, now.toISOString()));
-	const token = randomBytes(32).toString('hex');
-	const expiresAt = new Date(now.getTime() + SESSION_TTL_MS).toISOString();
-	await handle.insert(sessions).values({ id: token, userId, expiresAt, activeOrgId });
-	return { token, expiresAt };
-}
+): Promise<{ token: string; expiresAt: string }> {}
 
 /**
killedBy: a new user is created only at acceptance, with a full evidentiary consent record
statusReason: expected TypeError: Cannot destructure property 't… to match object { status: 302, location: '/dashboard' }

[Killed] ArithmeticOperator
src/lib/server/session.ts:67:29
 	const now = new Date();
 	await handle.delete(sessions).where(lte(sessions.expiresAt, now.toISOString()));
 	const token = randomBytes(32).toString('hex');
-	const expiresAt = new Date(now.getTime() + SESSION_TTL_MS).toISOString();
+	const expiresAt = new Date(now.getTime() - SESSION_TTL_MS).toISOString();
 	await handle.insert(sessions).values({ id: token, userId, expiresAt, activeOrgId });
 	return { token, expiresAt };
killedBy: a repeat login with the same sub reuses the account
statusReason: expected [ { …(5) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/lib/server/session.ts:79:6
  * the caller can refresh the cookie.
  */
 export async function getSessionUser(token: string | undefined): Promise<SessionResolution | null> {
-	if (!token) return null;
+	if (true) return null;
 	const row = await db
 		.select({
killedBy: creates a session and resolves it back to the user
statusReason: expected null to match object { renewed: false, user: { …(2) } }

[Killed] ConditionalExpression
src/lib/server/session.ts:79:6
  * the caller can refresh the cookie.
  */
 export async function getSessionUser(token: string | undefined): Promise<SessionResolution | null> {
-	if (!token) return null;
+	if (false) return null;
 	const row = await db
 		.select({
killedBy: returns null for an unknown or malformed token
statusReason: params:

[Killed] ConditionalExpression
src/lib/server/session.ts:90:6
 		.innerJoin(users, eq(sessions.userId, users.id))
 		.where(eq(sessions.id, token))
 		.get();
-	if (!row) return null;
+	if (false) return null;
 	// A session that outlives account deletion (e.g. a login callback read the
 	// user just before the deletion transaction committed, then created this
killedBy: returns null for an unknown or malformed token
statusReason: Cannot read properties of undefined (reading 'userGoogleSub')

[Killed] BooleanLiteral
src/lib/server/session.ts:90:6
 		.innerJoin(users, eq(sessions.userId, users.id))
 		.where(eq(sessions.id, token))
 		.get();
-	if (!row) return null;
+	if (row) return null;
 	// A session that outlives account deletion (e.g. a login callback read the
 	// user just before the deletion transaction committed, then created this
killedBy: creates a session and resolves it back to the user
statusReason: expected null to match object { renewed: false, user: { …(2) } }

[Killed] ConditionalExpression
src/lib/server/session.ts:96:6
 	// session after every session was deleted) must never resolve: destroy it
 	// so a deleted account has no working credentials. The tombstone marker is
 	// googleSub = 'deleted:<id>'.
-	if (row.userGoogleSub.startsWith('deleted:')) {
+	if (false) {
 		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
 		console.info(`session for deleted account ${row.user.id} destroyed on resolution`);
killedBy: a session whose user was deleted after creation resolves null and its row is destroyed
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/session.ts:96:6
 	// session after every session was deleted) must never resolve: destroy it
 	// so a deleted account has no working credentials. The tombstone marker is
 	// googleSub = 'deleted:<id>'.
-	if (row.userGoogleSub.startsWith('deleted:')) {
+	if (true) {
 		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
 		console.info(`session for deleted account ${row.user.id} destroyed on resolution`);
killedBy: creates a session and resolves it back to the user
statusReason: expected null to match object { renewed: false, user: { …(2) } }

[Killed] LogicalOperator
src/lib/server/session.ts:103:6
 		return null;
 	}
 	const expiresMs = Date.parse(row.session.expiresAt);
-	if (Number.isNaN(expiresMs) || expiresMs <= Date.now()) {
+	if (Number.isNaN(expiresMs) && expiresMs <= Date.now()) {
 		await db.delete(sessions).where(eq(sessions.id, token));
 		return null;
killedBy: expires sessions lazily: an expired token resolves null and its row is deleted
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to be null

[Killed] ConditionalExpression
src/lib/server/session.ts:103:6
 		return null;
 	}
 	const expiresMs = Date.parse(row.session.expiresAt);
-	if (Number.isNaN(expiresMs) || expiresMs <= Date.now()) {
+	if (true) {
 		await db.delete(sessions).where(eq(sessions.id, token));
 		return null;
killedBy: creates a session and resolves it back to the user
statusReason: expected null to match object { renewed: false, user: { …(2) } }

[Killed] ConditionalExpression
src/lib/server/session.ts:111:6
 	// exists, else the user's oldest membership (and the session row is
 	// repaired). Zero memberships is a data bug — fail loudly, never sign out.
 	const resolved = await resolveActiveOrg(row.user.id, row.session.activeOrgId);
-	if (!resolved) {
+	if (false) {
 		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
 		console.error(`user ${row.user.id} has no organization membership`);
killedBy: a user with zero memberships makes getSessionUser throw, never sign out
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 500, body: { …(1) } }

[Killed] BlockStatement
src/lib/server/session.ts:111:17
 	// exists, else the user's oldest membership (and the session row is
 	// repaired). Zero memberships is a data bug — fail loudly, never sign out.
 	const resolved = await resolveActiveOrg(row.user.id, row.session.activeOrgId);
-	if (!resolved) {
-		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
-		console.error(`user ${row.user.id} has no organization membership`);
-		// HttpError, not a plain Error: hooks rethrows deliberate HttpErrors so
-		// this data bug fails loudly instead of degrading to maintenance mode.
-		throw error(500, 'account has no organization — contact support');
-	}
+	if (!resolved) {}
 	// Org repair and sliding-expiry renewal are one UPDATE when both apply.
 	const updates: { activeOrgId?: string; expiresAt?: string } = {};
killedBy: a user with zero memberships makes getSessionUser throw, never sign out
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 500, body: { …(1) } }

[Killed] LogicalOperator
src/lib/server/session.ts:121:6
 	// Org repair and sliding-expiry renewal are one UPDATE when both apply.
 	const updates: { activeOrgId?: string; expiresAt?: string } = {};
-	if (resolved.fellBack && row.session.activeOrgId !== null) {
+	if (resolved.fellBack || row.session.activeOrgId !== null) {
 		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
 		console.info(`session for user ${row.user.id}: active org ${row.session.activeOrgId} no longer valid, falling back to ${resolved.org.orgId}`);
killedBy: an intact active org triggers no fallback repair and no repair log
statusReason: expected "info" to not be called at all, but actually been called 1 times

Received:

  1st info call:

    Array [
      "session for user user-1: active org org-user-1 no longer valid, falling back to org-user-1",

[Killed] BlockStatement
src/lib/server/session.ts:121:61
 	// Org repair and sliding-expiry renewal are one UPDATE when both apply.
 	const updates: { activeOrgId?: string; expiresAt?: string } = {};
-	if (resolved.fellBack && row.session.activeOrgId !== null) {
-		// Stryker disable next-line StringLiteral: log-only message — mutating it changes no observable behavior
-		console.info(`session for user ${row.user.id}: active org ${row.session.activeOrgId} no longer valid, falling back to ${resolved.org.orgId}`);
-		updates.activeOrgId = resolved.org.orgId;
-	}
+	if (resolved.fellBack && row.session.activeOrgId !== null) {}
 	const user = { ...row.user, plan: resolved.org.plan, orgId: resolved.org.orgId, orgName: resolved.org.orgName, orgRole: resolved.org.orgRole };
 	if (expiresMs - Date.now() < RENEW_BELOW_MS) {
killedBy: a session whose active org membership vanished falls back to the oldest membership and is repaired
statusReason: expected 'org-newer' to be 'org-user-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/session.ts:127:6
 		updates.activeOrgId = resolved.org.orgId;
 	}
 	const user = { ...row.user, plan: resolved.org.plan, orgId: resolved.org.orgId, orgName: resolved.org.orgName, orgRole: resolved.org.orgRole };
-	if (expiresMs - Date.now() < RENEW_BELOW_MS) {
+	if (false) {
 		const expiresAt = new Date(Date.now() + SESSION_TTL_MS).toISOString();
 		updates.expiresAt = expiresAt;
killedBy: sliding renewal updates only the resolving session, never another user's
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/server/session.ts:127:6
 		updates.activeOrgId = resolved.org.orgId;
 	}
 	const user = { ...row.user, plan: resolved.org.plan, orgId: resolved.org.orgId, orgName: resolved.org.orgName, orgRole: resolved.org.orgRole };
-	if (expiresMs - Date.now() < RENEW_BELOW_MS) {
+	if (expiresMs - Date.now() >= RENEW_BELOW_MS) {
 		const expiresAt = new Date(Date.now() + SESSION_TTL_MS).toISOString();
 		updates.expiresAt = expiresAt;
killedBy: creates a session and resolves it back to the user
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to match object { renewed: false, user: { …(2) } }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/lib/server/session.ts:128:30
 	}
 	const user = { ...row.user, plan: resolved.org.plan, orgId: resolved.org.orgId, orgName: resolved.org.orgName, orgRole: resolved.org.orgRole };
 	if (expiresMs - Date.now() < RENEW_BELOW_MS) {
-		const expiresAt = new Date(Date.now() + SESSION_TTL_MS).toISOString();
+		const expiresAt = new Date(Date.now() - SESSION_TTL_MS).toISOString();
 		updates.expiresAt = expiresAt;
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
killedBy: renews a session sliding into its last 15 days
statusReason: expected 1783439747690 to be greater than 1786118147689

[Killed] BooleanLiteral
src/lib/server/session.ts:131:38
 		const expiresAt = new Date(Date.now() + SESSION_TTL_MS).toISOString();
 		updates.expiresAt = expiresAt;
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
-		return { user, expiresAt, renewed: true };
+		return { user, expiresAt, renewed: false };
 	}
 	if (updates.activeOrgId) {
killedBy: sliding renewal updates only the resolving session, never another user's
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/session.ts:133:6
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
 		return { user, expiresAt, renewed: true };
 	}
-	if (updates.activeOrgId) {
+	if (false) {
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
 	}
killedBy: a session whose active org membership vanished falls back to the oldest membership and is repaired
statusReason: expected 'org-newer' to be 'org-user-1' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/session.ts:133:6
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
 		return { user, expiresAt, renewed: true };
 	}
-	if (updates.activeOrgId) {
+	if (true) {
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
 	}
killedBy: creates a session and resolves it back to the user
statusReason: No values to set

[Killed] BooleanLiteral
src/lib/server/session.ts:136:60
 	if (updates.activeOrgId) {
 		await db.update(sessions).set(updates).where(eq(sessions.id, token));
 	}
-	return { user, expiresAt: row.session.expiresAt, renewed: false };
+	return { user, expiresAt: row.session.expiresAt, renewed: true };
 }
 
killedBy: creates a session and resolves it back to the user
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to match object { renewed: false, user: { …(2) } }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/lib/server/session.ts:140:68
 }
 
 /** Deletes a session (sign-out). Unknown tokens are a no-op. */
-export async function destroySession(token: string): Promise<void> {
-	await db.delete(sessions).where(eq(sessions.id, token));
-}
+export async function destroySession(token: string): Promise<void> {}
 
 /**
killedBy: destroys a session so it no longer resolves
statusReason: expected { user: { id: 'user-1', …(6) }, …(2) } to be null

[Killed] BlockStatement
src/lib/server/session.ts:149:80
  * already redirected to /login by the layout guard; this is the backstop for
  * form actions, which must never run unauthenticated.
  */
-export function requireUser(locals: { user: SessionUser | null }): SessionUser {
-	if (!locals.user) throw error(401, 'sign-in required');
-	return locals.user;
-}
+export function requireUser(locals: { user: SessionUser | null }): SessionUser {}
 
killedBy: requireUser returns the signed-in user unchanged
statusReason: expected undefined to be { id: 'user-1', …(6) } // Object.is equality

[Killed] ConditionalExpression
src/lib/server/session.ts:150:6
  * form actions, which must never run unauthenticated.
  */
 export function requireUser(locals: { user: SessionUser | null }): SessionUser {
-	if (!locals.user) throw error(401, 'sign-in required');
+	if (false) throw error(401, 'sign-in required');
 	return locals.user;
 }
killedBy: load: 401 signed out; members get the roster but no invites; admins get open invites
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 401 }

[Killed] BooleanLiteral
src/lib/server/session.ts:150:6
  * form actions, which must never run unauthenticated.
  */
 export function requireUser(locals: { user: SessionUser | null }): SessionUser {
-	if (!locals.user) throw error(401, 'sign-in required');
+	if (locals.user) throw error(401, 'sign-in required');
 	return locals.user;
 }
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: StrykerJS: Unknown test failure
