[Killed] BlockStatement
src/lib/server/testarbitraries.ts:35:38
  * Runs per property: FC_NUM_RUNS when set (burn-in), else 100. A set but
  * invalid value fails loudly — never silently defaults.
  */
-export function pbtNumRuns(): number {
-	const raw = env.FC_NUM_RUNS;
-	if (raw === undefined || raw === '') return 100;
-	const parsed = Number(raw);
-	if (!Number.isInteger(parsed) || parsed < 1) {
-		throw new Error(`FC_NUM_RUNS must be a positive integer, got ${JSON.stringify(raw)}`);
-	}
-	return parsed;
-}
+export function pbtNumRuns(): number {}
 
 fc.configureGlobal({ numRuns: pbtNumRuns() });
killedBy: pbtNumRuns defaults to 100 when FC_NUM_RUNS is unset or empty
statusReason: expected undefined to be 100 // Object.is equality

[Killed] EqualityOperator
src/lib/server/testarbitraries.ts:37:6
  */
 export function pbtNumRuns(): number {
 	const raw = env.FC_NUM_RUNS;
-	if (raw === undefined || raw === '') return 100;
+	if (raw !== undefined || raw === '') return 100;
 	const parsed = Number(raw);
 	if (!Number.isInteger(parsed) || parsed < 1) {
killedBy: pbtNumRuns defaults to 100 when FC_NUM_RUNS is unset or empty
statusReason: FC_NUM_RUNS must be a positive integer, got undefined

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:37:6
  */
 export function pbtNumRuns(): number {
 	const raw = env.FC_NUM_RUNS;
-	if (raw === undefined || raw === '') return 100;
+	if (false) return 100;
 	const parsed = Number(raw);
 	if (!Number.isInteger(parsed) || parsed < 1) {
killedBy: pbtNumRuns defaults to 100 when FC_NUM_RUNS is unset or empty
statusReason: FC_NUM_RUNS must be a positive integer, got undefined

[Killed] BooleanLiteral
src/lib/server/testarbitraries.ts:39:6
 	const raw = env.FC_NUM_RUNS;
 	if (raw === undefined || raw === '') return 100;
 	const parsed = Number(raw);
-	if (!Number.isInteger(parsed) || parsed < 1) {
+	if (Number.isInteger(parsed) || parsed < 1) {
 		throw new Error(`FC_NUM_RUNS must be a positive integer, got ${JSON.stringify(raw)}`);
 	}
killedBy: pbtNumRuns honors a positive integer FC_NUM_RUNS — including 1
statusReason: FC_NUM_RUNS must be a positive integer, got "250"

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:39:47
 	const raw = env.FC_NUM_RUNS;
 	if (raw === undefined || raw === '') return 100;
 	const parsed = Number(raw);
-	if (!Number.isInteger(parsed) || parsed < 1) {
-		throw new Error(`FC_NUM_RUNS must be a positive integer, got ${JSON.stringify(raw)}`);
-	}
+	if (!Number.isInteger(parsed) || parsed < 1) {}
 	return parsed;
 }
killedBy: pbtNumRuns throws loudly on garbage FC_NUM_RUNS — never silently defaults
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:61:48
 export const TEN_YEARS_MS = 315576000000;
 
 /** Formats an epoch-ms instant in the app's ISO storage format. */
-export function toIso(instant: number): string {
-	return new Date(instant).toISOString();
-}
+export function toIso(instant: number): string {}
 
 /** Always-parseable ISO timestamps within 2020–2035. */
killedBy: toIso formats epoch ms in the app ISO storage format
statusReason: expected undefined to be '1970-01-01T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:75:63
 	.map((date) => date.toISOString());
 
 /** ISO timestamps strictly before `now` (1ms to ten years back). */
-export function pastIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now - offset));
-}
+export function pastIsoArb(now: number): fc.Arbitrary<string> {}
 
 /** ISO timestamps strictly after `now` (1ms to ten years ahead). */
killedBy: pastIsoArb is strictly before now and within ten years back
statusReason: Unexpected value received: not an instance of Arbitrary

[Killed] ArrowFunction
src/lib/server/testarbitraries.ts:76:55
 
 /** ISO timestamps strictly before `now` (1ms to ten years back). */
 export function pastIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now - offset));
+	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map(() => undefined);
 }
 
killedBy: pastIsoArb is strictly before now and within ten years back
statusReason: Property failed after 1 tests
{ seed: -2002053598, path: "0:0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/lib/server/testarbitraries.ts:76:73
 
 /** ISO timestamps strictly before `now` (1ms to ten years back). */
 export function pastIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now - offset));
+	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now + offset));
 }
 
killedBy: pastIsoArb is strictly before now and within ten years back
statusReason: Property failed after 1 tests
{ seed: 456043588, path: "0:0", endOnFailure: true }
Counterexample: ["2026-06-15T00:00:00.001Z"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:80:65
 }
 
 /** ISO timestamps strictly after `now` (1ms to ten years ahead). */
-export function futureIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now + offset));
-}
+export function futureIsoArb(now: number): fc.Arbitrary<string> {}
 
 // ---------------------------------------------------------------------------
killedBy: futureIsoArb is strictly after now and within ten years ahead
statusReason: Unexpected value received: not an instance of Arbitrary

[Killed] ArrowFunction
src/lib/server/testarbitraries.ts:81:55
 
 /** ISO timestamps strictly after `now` (1ms to ten years ahead). */
 export function futureIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now + offset));
+	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map(() => undefined);
 }
 
killedBy: futureIsoArb is strictly after now and within ten years ahead
statusReason: Property failed after 1 tests
{ seed: 1494664473, path: "0:0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/lib/server/testarbitraries.ts:81:73
 
 /** ISO timestamps strictly after `now` (1ms to ten years ahead). */
 export function futureIsoArb(now: number): fc.Arbitrary<string> {
-	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now + offset));
+	return fc.integer({ min: 1, max: TEN_YEARS_MS }).map((offset) => toIso(now - offset));
 }
 
killedBy: futureIsoArb is strictly after now and within ten years ahead
statusReason: Property failed after 1 tests
{ seed: -1016618370, path: "0:0", endOnFailure: true }
Counterexample: ["2026-06-14T23:59:59.999Z"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/lib/server/testarbitraries.ts:119:27
 export const userRowArb: fc.Arbitrary<UserRow> = fc.record({
 	id: idArb,
 	googleSub: idArb.map((id) => `sub-${id}`),
-	email: idArb.map((id) => `${id}@example.com`),
+	email: idArb.map((id) => ``),
 	displayName: fc.string({ maxLength: 30 })
 });
killedBy: userRowArb rows have app-shaped synthetic identities
statusReason: Property failed after 1 tests
{ seed: -1621905040, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"id":"0aa00a00","googleSub":"sub-0a0000a0","email":"","displayName":""}]
Shrunk 24 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:376:101
 export type Malformation = (typeof MALFORMATIONS)[number];
 
 /** Applies one malformation to a valid item, returning a new object. */
-export function malformItem(item: CommentThreadItem, malformation: Malformation): CommentThreadItem {
-	const clone = structuredClone(item);
-	switch (malformation) {
-		case 'id':
-			delete clone.snippet.topLevelComment.id;
-			break;
-		case 'threadId':
-			delete clone.id;
-			break;
-		case 'text':
-			delete clone.snippet.topLevelComment.snippet.textDisplay;
-			break;
-		case 'publishedAtMissing':
-			delete clone.snippet.topLevelComment.snippet.publishedAt;
-			break;
-		case 'publishedAtInvalid':
-			clone.snippet.topLevelComment.snippet.publishedAt = 'not-a-date';
-			break;
-	}
-	return clone;
-}
+export function malformItem(item: CommentThreadItem, malformation: Malformation): CommentThreadItem {}
 
 /**
killedBy: malformItem breaks exactly the field each malformation names
statusReason: Cannot read properties of undefined (reading 'snippet')

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:379:3
 export function malformItem(item: CommentThreadItem, malformation: Malformation): CommentThreadItem {
 	const clone = structuredClone(item);
 	switch (malformation) {
-		case 'id':
-			delete clone.snippet.topLevelComment.id;
-			break;
+		case 'id':
 		case 'threadId':
 			delete clone.id;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/server/testarbitraries.ts:379:8
 export function malformItem(item: CommentThreadItem, malformation: Malformation): CommentThreadItem {
 	const clone = structuredClone(item);
 	switch (malformation) {
-		case 'id':
+		case "":
 			delete clone.snippet.topLevelComment.id;
 			break;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:382:3
 		case 'id':
 			delete clone.snippet.topLevelComment.id;
 			break;
-		case 'threadId':
-			delete clone.id;
-			break;
+		case 'threadId':
 		case 'text':
 			delete clone.snippet.topLevelComment.snippet.textDisplay;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:385:3
 		case 'threadId':
 			delete clone.id;
 			break;
-		case 'text':
-			delete clone.snippet.topLevelComment.snippet.textDisplay;
-			break;
+		case 'text':
 		case 'publishedAtMissing':
 			delete clone.snippet.topLevelComment.snippet.publishedAt;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:388:3
 		case 'text':
 			delete clone.snippet.topLevelComment.snippet.textDisplay;
 			break;
-		case 'publishedAtMissing':
-			delete clone.snippet.topLevelComment.snippet.publishedAt;
-			break;
+		case 'publishedAtMissing':
 		case 'publishedAtInvalid':
 			clone.snippet.topLevelComment.snippet.publishedAt = 'not-a-date';
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/server/testarbitraries.ts:388:8
 		case 'text':
 			delete clone.snippet.topLevelComment.snippet.textDisplay;
 			break;
-		case 'publishedAtMissing':
+		case "":
 			delete clone.snippet.topLevelComment.snippet.publishedAt;
 			break;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:391:3
 		case 'publishedAtMissing':
 			delete clone.snippet.topLevelComment.snippet.publishedAt;
 			break;
-		case 'publishedAtInvalid':
-			clone.snippet.topLevelComment.snippet.publishedAt = 'not-a-date';
-			break;
+		case 'publishedAtInvalid':
 	}
 	return clone;
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/server/testarbitraries.ts:392:56
 			delete clone.snippet.topLevelComment.snippet.publishedAt;
 			break;
 		case 'publishedAtInvalid':
-			clone.snippet.topLevelComment.snippet.publishedAt = 'not-a-date';
+			clone.snippet.topLevelComment.snippet.publishedAt = "";
 			break;
 	}
killedBy: malformItem breaks exactly the field each malformation names
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/server/testarbitraries.ts:416:91
  * any blend of valid and malformed items (the I1 case: valid items processed,
  * malformed ones skipped, batch never aborts — for any page size).
  */
-export function commentThreadsResponseArb(mode: 'valid' | 'mixed'): fc.Arbitrary<unknown> {
-	const itemArb =
-		mode === 'valid' ? commentThreadItemArb : fc.oneof(commentThreadItemArb, malformedItemArb);
-	return fc.record({
-		// Stryker disable next-line StringLiteral: "" equivalent — the parser never reads the response kind field
-		kind: fc.constant('youtube#commentThreadListResponse'),
-		items: fc.array(itemArb),
-		nextPageToken: fc.option(idArb, { nil: undefined })
-	});
-}
+export function commentThreadsResponseArb(mode: 'valid' | 'mixed'): fc.Arbitrary<unknown> {}
 
 // ---------------------------------------------------------------------------
killedBy: valid commentThreads responses: every generated item is processed by the real parser
statusReason: Unexpected value received: not an instance of Arbitrary

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:418:3
  */
 export function commentThreadsResponseArb(mode: 'valid' | 'mixed'): fc.Arbitrary<unknown> {
 	const itemArb =
-		mode === 'valid' ? commentThreadItemArb : fc.oneof(commentThreadItemArb, malformedItemArb);
+		false ? commentThreadItemArb : fc.oneof(commentThreadItemArb, malformedItemArb);
 	return fc.record({
 		// Stryker disable next-line StringLiteral: "" equivalent — the parser never reads the response kind field
killedBy: valid commentThreads responses: every generated item is processed by the real parser
statusReason: Property failed after 3 tests
{ seed: -1136245739, path: "2:1:0:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Shrunk 41 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/server/testarbitraries.ts:418:3
  */
 export function commentThreadsResponseArb(mode: 'valid' | 'mixed'): fc.Arbitrary<unknown> {
 	const itemArb =
-		mode === 'valid' ? commentThreadItemArb : fc.oneof(commentThreadItemArb, malformedItemArb);
+		true ? commentThreadItemArb : fc.oneof(commentThreadItemArb, malformedItemArb);
 	return fc.record({
 		// Stryker disable next-line StringLiteral: "" equivalent — the parser never reads the response kind field
killedBy: mixed mode can actually produce parser-skipped items (not a disguised valid mode)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/server/testarbitraries.ts:423:35
 		// Stryker disable next-line StringLiteral: "" equivalent — the parser never reads the response kind field
 		kind: fc.constant('youtube#commentThreadListResponse'),
 		items: fc.array(itemArb),
-		nextPageToken: fc.option(idArb, { nil: undefined })
+		nextPageToken: fc.option(idArb, {})
 	});
 }
killedBy: valid commentThreads responses: every generated item is processed by the real parser
statusReason: Property failed after 7 tests
{ seed: 1032967294, path: "6:0:0", endOnFailure: true }
Counterexample: [{"kind":"youtube#commentThreadListResponse","items":[],"nextPageToken":null}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
