[Killed] BlockStatement
src/lib/server/testdb.ts:41:11
 // shared in-memory instance. This module is always imported before the
 // route-under-test, so the mock is registered before $lib/server/db loads.
 vi.mock('$lib/server/db', () => ({
-	get db() {
-		return testDb().db;
-	}
+	get db() {}
 }));
 
killedBy: callback synthesizes a placeholder email when Google sends no usable one ('missing')
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 302 }

[Killed] BlockStatement
src/lib/server/testdb.ts:58:67
  * the pragma only takes effect outside a transaction, which is why this
  * uses executeMultiple rather than the transactional batch().
  */
-export async function wipeTables(tables: string[]): Promise<void> {
-	for (const table of tables) {
-		if (!WIPEABLE_TABLES.has(table)) {
-			throw new Error(`wipeTables: unknown table "${table}" (not in the app schema)`);
-		}
-	}
-	const statements = [
-		'PRAGMA foreign_keys = OFF',
-		...tables.map((table) => `DELETE FROM ${table}`),
-		'PRAGMA foreign_keys = ON'
-	];
-	await testDb().client.executeMultiple(statements.join(';\n'));
-}
+export async function wipeTables(tables: string[]): Promise<void> {}
 
 // Derived from the Drizzle schema so the allowlist can never drift from the
killedBy: callback with an existing user on a stale document version sends them back through /consent
statusReason: Failed query: insert into "users" ("id", "google_sub", "email", "display_name", "plan", "created_at") values (?, ?, ?, ?, ?, (strftime('%Y-%m-%dT%H:%M:%fZ', 'now')))
params: user-sub-1,sub-1,sub-1@example.com,sub-1,free

[Killed] BlockStatement
src/lib/server/testdb.ts:59:30
  * uses executeMultiple rather than the transactional batch().
  */
 export async function wipeTables(tables: string[]): Promise<void> {
-	for (const table of tables) {
-		if (!WIPEABLE_TABLES.has(table)) {
-			throw new Error(`wipeTables: unknown table "${table}" (not in the app schema)`);
-		}
-	}
+	for (const table of tables) {}
 	const statements = [
 		'PRAGMA foreign_keys = OFF',
killedBy: wipeTables rejects tables outside the app schema loudly
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/testdb.ts:60:36
  */
 export async function wipeTables(tables: string[]): Promise<void> {
 	for (const table of tables) {
-		if (!WIPEABLE_TABLES.has(table)) {
-			throw new Error(`wipeTables: unknown table "${table}" (not in the app schema)`);
-		}
+		if (!WIPEABLE_TABLES.has(table)) {}
 	}
 	const statements = [
killedBy: wipeTables rejects tables outside the app schema loudly
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/testdb.ts:60:7
  */
 export async function wipeTables(tables: string[]): Promise<void> {
 	for (const table of tables) {
-		if (!WIPEABLE_TABLES.has(table)) {
+		if (true) {
 			throw new Error(`wipeTables: unknown table "${table}" (not in the app schema)`);
 		}
killedBy: a stored org key beats the env key
statusReason: wipeTables: unknown table "organizations" (not in the app schema)

[Killed] ArrayDeclaration
src/lib/server/testdb.ts:64:21
 			throw new Error(`wipeTables: unknown table "${table}" (not in the app schema)`);
 		}
 	}
-	const statements = [
-		'PRAGMA foreign_keys = OFF',
-		...tables.map((table) => `DELETE FROM ${table}`),
-		'PRAGMA foreign_keys = ON'
-	];
+	const statements = [];
 	await testDb().client.executeMultiple(statements.join(';\n'));
 }
killedBy: the failure is not cached — the guard recovers as soon as the human migrates
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/lib/server/testdb.ts:66:17
 	}
 	const statements = [
 		'PRAGMA foreign_keys = OFF',
-		...tables.map((table) => `DELETE FROM ${table}`),
+		...tables.map(() => undefined),
 		'PRAGMA foreign_keys = ON'
 	];
killedBy: the failure is not cached — the guard recovers as soon as the human migrates
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/lib/server/testdb.ts:67:3
 	const statements = [
 		'PRAGMA foreign_keys = OFF',
 		...tables.map((table) => `DELETE FROM ${table}`),
-		'PRAGMA foreign_keys = ON'
+		""
 	];
 	await testDb().client.executeMultiple(statements.join(';\n'));
killedBy: wipeTables suspends FK enforcement around the deletes
statusReason: expected 27 to be less than -1

[Killed] BlockStatement
src/lib/server/testdb.ts:92:25
 	beforeAll(async () => {
 		holder.current = await createTestDb();
 	});
-	beforeEach(async () => {
-		await wipeTables(tables);
-	});
+	beforeEach(async () => {});
 }
 
killedBy: personal_for UNIQUE and memberships composite PK are enforced
statusReason: Failed query: insert into "users" ("id", "google_sub", "email", "display_name", "plan", "created_at") values (?, ?, ?, ?, ?, (strftime('%Y-%m-%dT%H:%M:%fZ', 'now')))
params: user-1,sub-user-1,user-1@example.com,user-1,free

[Killed] BlockStatement
src/lib/server/testdb.ts:97:34
 	});
 }
 
-export function testDb(): TestDb {
-	if (!holder.current) throw new Error('test db not initialized — call setupTestDb() first');
-	return holder.current;
-}
+export function testDb(): TestDb {}
 
 export function postForm(fields: Record<string, string>, url = 'http://localhost/'): Request {
killedBy: page states: the rendered sentence equals the logged text exactly, docs are linked, errors are announced
statusReason: Cannot read properties of undefined (reading 'client')

[Killed] BooleanLiteral
src/lib/server/testdb.ts:98:6
 }
 
 export function testDb(): TestDb {
-	if (!holder.current) throw new Error('test db not initialized — call setupTestDb() first');
+	if (holder.current) throw new Error('test db not initialized — call setupTestDb() first');
 	return holder.current;
 }
killedBy: page states: the rendered sentence equals the logged text exactly, docs are linked, errors are announced
statusReason: test db not initialized — call setupTestDb() first

[Killed] ConditionalExpression
src/lib/server/testdb.ts:98:6
 }
 
 export function testDb(): TestDb {
-	if (!holder.current) throw new Error('test db not initialized — call setupTestDb() first');
+	if (false) throw new Error('test db not initialized — call setupTestDb() first');
 	return holder.current;
 }
killedBy: testDb() throws with a descriptive error before setupTestDb initializes it
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/server/testdb.ts:102:94
 	return holder.current;
 }
 
-export function postForm(fields: Record<string, string>, url = 'http://localhost/'): Request {
-	const form = new FormData();
-	for (const [key, value] of Object.entries(fields)) form.set(key, value);
-	return new Request(url, { method: 'POST', body: form });
-}
+export function postForm(fields: Record<string, string>, url = 'http://localhost/'): Request {}
 
 export const DAY_MS = 24 * 60 * 60 * 1000;
killedBy: every action rejects a missing commentId with 400 and mutates nothing
statusReason: Cannot read properties of undefined (reading 'formData')

[Killed] StringLiteral
src/lib/server/testdb.ts:105:36
 export function postForm(fields: Record<string, string>, url = 'http://localhost/'): Request {
 	const form = new FormData();
 	for (const [key, value] of Object.entries(fields)) form.set(key, value);
-	return new Request(url, { method: 'POST', body: form });
+	return new Request(url, { method: "", body: form });
 }
 
killedBy: every action rejects a signed-out request with 401 before validating the form
statusReason: '' is not a valid HTTP method.

[Killed] BlockStatement
src/lib/server/testdb.ts:115:61
 export { TEST_OWNER } from './testuser';
 
 /** Seeds a bare user row with a synthetic identity. */
-export async function seedUser(id: string): Promise<string> {
-	await testDb().db.insert(users).values({ id, googleSub: `sub-${id}`, email: `${id}@example.com`, displayName: id });
-	return id;
-}
+export async function seedUser(id: string): Promise<string> {}
 
 /** Seeds a consent record for an existing user with the e-mail retained (synthetic evidence values). */
killedBy: wipeTables empties the given tables on demand (per-property-run freshness)
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/lib/server/testdb.ts:116:78
 
 /** Seeds a bare user row with a synthetic identity. */
 export async function seedUser(id: string): Promise<string> {
-	await testDb().db.insert(users).values({ id, googleSub: `sub-${id}`, email: `${id}@example.com`, displayName: id });
+	await testDb().db.insert(users).values({ id, googleSub: `sub-${id}`, email: ``, displayName: id });
 	return id;
 }
killedBy: deleteUserRecords leaves other users and their records alone
statusReason: expected { id: 'stays', …(5) } to match object { googleSub: 'sub-stays', …(1) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/server/testdb.ts:121:107
 }
 
 /** Seeds a consent record for an existing user with the e-mail retained (synthetic evidence values). */
-export async function seedConsent(userId: string, createdAt?: string, docVersion = 'v1.2'): Promise<void> {
-	await testDb().db.insert(consents).values({
-		userId,
-		email: `${userId}@example.com`,
-		docVersion,
-		checkboxText: 'I agree',
-		ip: '127.0.0.1',
-		userAgent: 'test',
-		...(createdAt ? { createdAt } : {})
-	});
-}
+export async function seedConsent(userId: string, createdAt?: string, docVersion = 'v1.2'): Promise<void> {}
 
 /**
killedBy: seedConsent seeds the evidentiary defaults
statusReason: expected [] to match object [ { userId: 'user-1', …(6) } ]

[Killed] StringLiteral
src/lib/server/testdb.ts:128:14
 		docVersion,
 		checkboxText: 'I agree',
 		ip: '127.0.0.1',
-		userAgent: 'test',
+		userAgent: "",
 		...(createdAt ? { createdAt } : {})
 	});
killedBy: seedConsent seeds the evidentiary defaults
statusReason: expected [ { id: 1, userId: 'user-1', …(7) } ] to match object [ { userId: 'user-1', …(6) } ]
(2 matching properties omitted from actual)
