[Killed] BlockStatement
channels/[id]/log/+page.server.ts:34:87
 // 'ban' restores the comment but the author ban is permanent (no API);
 // everything else ('delete', 'approve', 'queue', 'dry-run', 'restore') is
 // not reversible.
-function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
-	if (!latest) return null;
-	if (action === 'hold' || action === 'reject') return 'full';
-	if (action === 'ban') return 'comment-only';
-	return null;
-}
+function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {}
 
 export async function load({ params, locals }) {
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected undefined to be 'full' // Object.is equality

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:35:6
 // everything else ('delete', 'approve', 'queue', 'dry-run', 'restore') is
 // not reversible.
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
-	if (!latest) return null;
+	if (false) return null;
 	if (action === 'hold' || action === 'reject') return 'full';
 	if (action === 'ban') return 'comment-only';
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected 'full' to be null

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:35:6
 // everything else ('delete', 'approve', 'queue', 'dry-run', 'restore') is
 // not reversible.
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
-	if (!latest) return null;
+	if (true) return null;
 	if (action === 'hold' || action === 'reject') return 'full';
 	if (action === 'ban') return 'comment-only';
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected null to be 'full' // Object.is equality

[Killed] EqualityOperator
channels/[id]/log/+page.server.ts:36:27
 // not reversible.
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
 	if (!latest) return null;
-	if (action === 'hold' || action === 'reject') return 'full';
+	if (action === 'hold' || action !== 'reject') return 'full';
 	if (action === 'ban') return 'comment-only';
 	return null;
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected null to be 'full' // Object.is equality

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:36:27
 // not reversible.
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
 	if (!latest) return null;
-	if (action === 'hold' || action === 'reject') return 'full';
+	if (action === 'hold' || false) return 'full';
 	if (action === 'ban') return 'comment-only';
 	return null;
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected null to be 'full' // Object.is equality

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:37:6
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
 	if (!latest) return null;
 	if (action === 'hold' || action === 'reject') return 'full';
-	if (action === 'ban') return 'comment-only';
+	if (true) return 'comment-only';
 	return null;
 }
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected 'comment-only' to be null

[Killed] EqualityOperator
channels/[id]/log/+page.server.ts:37:6
 function undoableFor(latest: boolean, action: string): 'full' | 'comment-only' | null {
 	if (!latest) return null;
 	if (action === 'hold' || action === 'reject') return 'full';
-	if (action === 'ban') return 'comment-only';
+	if (action !== 'ban') return 'comment-only';
 	return null;
 }
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected null to be 'comment-only' // Object.is equality

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:41:48
 	return null;
 }
 
-export async function load({ params, locals }) {
-	// Database outage: the layout renders the overlay; this load must not 401
-	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, entries: [], maintenance: true };
-	// Ownership-scoped: another user's channel (and its audit log) reads as "not found".
-	const ch = await ownedChannel(params.id, locals);
-	const rows = await db
-		.select()
-		.from(auditLog)
-		.where(eq(auditLog.channelId, params.id))
-		// createdAt ties (same-millisecond batch inserts) are broken by the
-		// auto-increment id, or "latest per comment" is undefined behavior.
-		.orderBy(desc(auditLog.createdAt), desc(auditLog.id))
-		.limit(200)
-		.all();
-	const seen = new Set<string>();
-	const entries = rows.map((entry) => {
-		const latest = !seen.has(entry.commentId);
-		seen.add(entry.commentId);
-		return { ...entry, undoable: undoableFor(latest, entry.action) };
-	});
-	// Project only what the page renders — never serialize refreshTokenEnc (or
-	// any future secret column) to the browser.
-	return { ch: { id: ch.id, title: ch.title }, entries };
-}
+export async function load({ params, locals }) {}
 
 export const actions = {
killedBy: load returns the maintenance payload during a database outage instead of a 401
statusReason: expected undefined to deeply equal { ch: { id: 'UC1', title: '' }, …(2) }

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:44:6
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, entries: [], maintenance: true };
+	if (false) return { ch: { id: params.id, title: '' }, entries: [], maintenance: true };
 	// Ownership-scoped: another user's channel (and its audit log) reads as "not found".
 	const ch = await ownedChannel(params.id, locals);
killedBy: load returns the maintenance payload during a database outage instead of a 401
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:44:90
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, entries: [], maintenance: true };
+	if (locals.dbDown) return { ch: { id: params.id, title: '' }, entries: [], maintenance: false };
 	// Ownership-scoped: another user's channel (and its audit log) reads as "not found".
 	const ch = await ownedChannel(params.id, locals);
killedBy: load returns the maintenance payload during a database outage instead of a 401
statusReason: expected { ch: { id: 'UC1', title: '' }, …(2) } to deeply equal { ch: { id: 'UC1', title: '' }, …(2) }

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:57:38
 		.limit(200)
 		.all();
 	const seen = new Set<string>();
-	const entries = rows.map((entry) => {
-		const latest = !seen.has(entry.commentId);
-		seen.add(entry.commentId);
-		return { ...entry, undoable: undoableFor(latest, entry.action) };
-	});
+	const entries = rows.map((entry) => {});
 	// Project only what the page renders — never serialize refreshTokenEnc (or
 	// any future secret column) to the browser.
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: Cannot read properties of undefined (reading 'commentId')

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:58:18
 		.all();
 	const seen = new Set<string>();
 	const entries = rows.map((entry) => {
-		const latest = !seen.has(entry.commentId);
+		const latest = seen.has(entry.commentId);
 		seen.add(entry.commentId);
 		return { ...entry, undoable: undoableFor(latest, entry.action) };
killedBy: load marks only the latest reversible action per comment as undoable
statusReason: expected null to be 'full' // Object.is equality

[Killed] MethodExpression
channels/[id]/log/+page.server.ts:77:47
 	undo: async ({ params, request, locals }) => {
 		requireUser(locals);
 		const raw = (await request.formData()).get('commentId');
-		const commentId = typeof raw === 'string' ? raw.trim() : '';
+		const commentId = typeof raw === 'string' ? raw : '';
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
 		const ch = await ownedChannel(params.id, locals);
killedBy: a whitespace-only comment id is trimmed away and fails with 400
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:77:21
 	undo: async ({ params, request, locals }) => {
 		requireUser(locals);
 		const raw = (await request.formData()).get('commentId');
-		const commentId = typeof raw === 'string' ? raw.trim() : '';
+		const commentId = true ? raw.trim() : '';
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
 		const ch = await ownedChannel(params.id, locals);
killedBy: undo without a comment id fails with 400
statusReason: Cannot read properties of null (reading 'trim')

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:78:7
 		requireUser(locals);
 		const raw = (await request.formData()).get('commentId');
 		const commentId = typeof raw === 'string' ? raw.trim() : '';
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
+		if (commentId) return fail(400, { error: 'Invalid comment ID' });
 		const ch = await ownedChannel(params.id, locals);
 		const comment = await db
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { success: StringContaining "estored" }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:78:7
 		requireUser(locals);
 		const raw = (await request.formData()).get('commentId');
 		const commentId = typeof raw === 'string' ? raw.trim() : '';
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
+		if (true) return fail(400, { error: 'Invalid comment ID' });
 		const ch = await ownedChannel(params.id, locals);
 		const comment = await db
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { success: StringContaining "estored" }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:85:7
 			.from(comments)
 			.where(and(eq(comments.id, commentId), eq(comments.channelId, params.id)))
 			.get();
-		if (!comment || (comment.status !== 'held' && comment.status !== 'rejected' && comment.status !== 'restoring')) {
+		if (false) {
 			throw error(404, 'reversible comment not found in this channel');
 		}
killedBy: undo on a deleted comment 404s and changes nothing
statusReason: promise resolved "{ success: 'Restored — recorded in a…' }" instead of rejecting

[Killed] LogicalOperator
channels/[id]/log/+page.server.ts:85:20
 			.from(comments)
 			.where(and(eq(comments.id, commentId), eq(comments.channelId, params.id)))
 			.get();
-		if (!comment || (comment.status !== 'held' && comment.status !== 'rejected' && comment.status !== 'restoring')) {
+		if (!comment || (comment.status !== 'held' && comment.status !== 'rejected' || comment.status !== 'restoring')) {
 			throw error(404, 'reversible comment not found in this channel');
 		}
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
channels/[id]/log/+page.server.ts:86:21
 			.where(and(eq(comments.id, commentId), eq(comments.channelId, params.id)))
 			.get();
 		if (!comment || (comment.status !== 'held' && comment.status !== 'rejected' && comment.status !== 'restoring')) {
-			throw error(404, 'reversible comment not found in this channel');
+			throw error(404, "");
 		}
 		// 'restoring' means a previous undo claimed the comment (or restored it
killedBy: undo on a deleted comment 404s and changes nothing
statusReason: expected { Object (status, body) } to match object { status: 404, …(1) }

[Killed] EqualityOperator
channels/[id]/log/+page.server.ts:92:20
 		// remotely) but crashed before the audit commit: resume it. The YouTube
 		// call is idempotent (I4), so re-applying it is safe.
-		const resuming = comment.status === 'restoring';
+		const resuming = comment.status !== 'restoring';
 		if (!resuming) {
killedBy: a failed audit insert leaves the undo retryable in a restoring state
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'restoring' }
(10 matching properties omitted from actual)

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:94:7
 		const resuming = comment.status === 'restoring';
-		if (!resuming) {
+		if (resuming) {
 			// Atomically claim the comment BEFORE the external call: the conditional
 			// update makes concurrent undo submissions single-winner (the loser 404s).
killedBy: a failed audit insert leaves the undo retryable in a restoring state
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'restoring' }
(10 matching properties omitted from actual)

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:94:18
 		const resuming = comment.status === 'restoring';
-		if (!resuming) {
-			// Atomically claim the comment BEFORE the external call: the conditional
-			// update makes concurrent undo submissions single-winner (the loser 404s).
-			const claimed = await db
-				.update(comments)
-				.set({ status: 'restoring' })
-				.where(and(eq(comments.id, commentId), eq(comments.status, comment.status)))
-				.returning({ id: comments.id });
-			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
-		}
+		if (!resuming) {}
 		const dryRun = env.DRY_RUN === 'true';
 		try {
killedBy: a failed audit insert leaves the undo retryable in a restoring state
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'restoring' }
(10 matching properties omitted from actual)

[Killed] ObjectLiteral
channels/[id]/log/+page.server.ts:99:10
 			// update makes concurrent undo submissions single-winner (the loser 404s).
 			const claimed = await db
 				.update(comments)
-				.set({ status: 'restoring' })
+				.set({})
 				.where(and(eq(comments.id, commentId), eq(comments.status, comment.status)))
 				.returning({ id: comments.id });
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: No values to set

[Killed] StringLiteral
channels/[id]/log/+page.server.ts:99:20
 			// update makes concurrent undo submissions single-winner (the loser 404s).
 			const claimed = await db
 				.update(comments)
-				.set({ status: 'restoring' })
+				.set({ status: "" })
 				.where(and(eq(comments.id, commentId), eq(comments.status, comment.status)))
 				.returning({ id: comments.id });
killedBy: a failed audit insert leaves the undo retryable in a restoring state
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'restoring' }
(10 matching properties omitted from actual)

[Killed] EqualityOperator
channels/[id]/log/+page.server.ts:102:8
 				.set({ status: 'restoring' })
 				.where(and(eq(comments.id, commentId), eq(comments.status, comment.status)))
 				.returning({ id: comments.id });
-			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
+			if (claimed.length !== 0) throw error(404, 'reversible comment not found in this channel');
 		}
 		const dryRun = env.DRY_RUN === 'true';
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:102:8
 				.set({ status: 'restoring' })
 				.where(and(eq(comments.id, commentId), eq(comments.status, comment.status)))
 				.returning({ id: comments.id });
-			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
+			if (false) throw error(404, 'reversible comment not found in this channel');
 		}
 		const dryRun = env.DRY_RUN === 'true';
killedBy: a concurrent undo that loses the atomic claim 404s instead of double-restoring
statusReason: expected LibsqlError: SQLITE_LOCKED: database tabl… { …(3) } to match object { status: 404, …(1) }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
channels/[id]/log/+page.server.ts:104:18
 				.returning({ id: comments.id });
 			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
 		}
-		const dryRun = env.DRY_RUN === 'true';
+		const dryRun = env.DRY_RUN !== 'true';
 		try {
 			if (!dryRun) {
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc-1' ]

Number of calls: 0

[Killed] ConditionalExpression
channels/[id]/log/+page.server.ts:104:18
 				.returning({ id: comments.id });
 			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
 		}
-		const dryRun = env.DRY_RUN === 'true';
+		const dryRun = false;
 		try {
 			if (!dryRun) {
killedBy: a dry run records a dry-run audit row and makes no YouTube call
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Array [

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:105:7
 			if (claimed.length === 0) throw error(404, 'reversible comment not found in this channel');
 		}
 		const dryRun = env.DRY_RUN === 'true';
-		try {
-			if (!dryRun) {
-				const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-				await setModerationStatus([commentId], 'published', false, token);
-			}
-		} catch (e) {
+		try {} catch (e) {
 			// Release a fresh claim so the failed restore stays retryable; a
 			// resumed attempt stays 'restoring' either way.
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc-1' ]

Number of calls: 0

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:106:8
 		}
 		const dryRun = env.DRY_RUN === 'true';
 		try {
-			if (!dryRun) {
+			if (dryRun) {
 				const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 				await setModerationStatus([commentId], 'published', false, token);
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc-1' ]

Number of calls: 0

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:106:17
 		}
 		const dryRun = env.DRY_RUN === 'true';
 		try {
-			if (!dryRun) {
-				const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-				await setModerationStatus([commentId], 'published', false, token);
-			}
+			if (!dryRun) {}
 		} catch (e) {
 			// Release a fresh claim so the failed restore stays retryable; a
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc-1' ]

Number of calls: 0

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:108:57
 		try {
 			if (!dryRun) {
 				const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-				await setModerationStatus([commentId], 'published', false, token);
+				await setModerationStatus([commentId], 'published', true, token);
 			}
 		} catch (e) {
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'c1' ], 'published', false, …(1) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] StringLiteral
channels/[id]/log/+page.server.ts:108:44
 		try {
 			if (!dryRun) {
 				const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-				await setModerationStatus([commentId], 'published', false, token);
+				await setModerationStatus([commentId], "", false, token);
 			}
 		} catch (e) {
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'c1' ], 'published', false, …(1) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] BooleanLiteral
channels/[id]/log/+page.server.ts:114:8
 			// Release a fresh claim so the failed restore stays retryable; a
 			// resumed attempt stays 'restoring' either way.
-			if (!resuming) {
+			if (resuming) {
 				await db
 					.update(comments)
killedBy: a YouTube failure releases the claim and fails loudly
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'rejected', decidedBy: 'ai' }
(9 matching properties omitted from actual)

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:114:19
 			// Release a fresh claim so the failed restore stays retryable; a
 			// resumed attempt stays 'restoring' either way.
-			if (!resuming) {
-				await db
-					.update(comments)
-					.set({ status: comment.status, decidedBy: comment.decidedBy })
-					.where(eq(comments.id, commentId));
-			}
+			if (!resuming) {}
 			throw e;
 		}
killedBy: a YouTube failure releases the claim and fails loudly
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'rejected', decidedBy: 'ai' }
(9 matching properties omitted from actual)

[Killed] ObjectLiteral
channels/[id]/log/+page.server.ts:124:12
 		}
 		// Name the action being undone — server-side, never from the form.
 		const prior = await db
-			.select({ action: auditLog.action })
+			.select({})
 			.from(auditLog)
 			.where(and(eq(auditLog.channelId, params.id), eq(auditLog.commentId, commentId), inArray(auditLog.action, ['hold', 'reject', 'ban'])))
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: Failed query: select  from "audit_log" where ("audit_log"."channel_id" = ? and "audit_log"."comment_id" = ? and "audit_log"."action" in (?, ?, ?)) order by "audit_log"."created_at" desc, "audit_log"."id" desc limit ?
params: UC1,c1,hold,reject,ban,1

[Killed] BlockStatement
channels/[id]/log/+page.server.ts:133:38
 		// The remote call already landed: the audit row and the final status
 		// commit as one unit. If this transaction fails, the comment stays
 		// 'restoring' — the next undo retries instead of losing the record.
-		await db.transaction(async (tx) => {
-			await tx.insert(auditLog).values({
-				channelId: params.id,
-				commentId,
-				action: dryRun ? 'dry-run' : 'restore',
-				reason: `undo of ${prior?.action ?? 'moderation action'}`,
-				actor: 'user',
-				createdAt: new Date().toISOString()
-			});
-			await tx.update(comments).set({ status: 'approved', decidedBy: 'human' }).where(eq(comments.id, commentId));
-		});
+		await db.transaction(async (tx) => {});
 		return { success: 'Restored — recorded in audit log.' };
 	}
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { status: 'approved', …(1) }
(9 matching properties omitted from actual)

[Killed] StringLiteral
channels/[id]/log/+page.server.ts:137:34
 			await tx.insert(auditLog).values({
 				channelId: params.id,
 				commentId,
-				action: dryRun ? 'dry-run' : 'restore',
+				action: dryRun ? 'dry-run' : "",
 				reason: `undo of ${prior?.action ?? 'moderation action'}`,
 				actor: 'user',
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected [ …(2) ] to deep equally contain ObjectContaining{…}

[Killed] OptionalChaining
channels/[id]/log/+page.server.ts:138:24
 				channelId: params.id,
 				commentId,
 				action: dryRun ? 'dry-run' : 'restore',
-				reason: `undo of ${prior?.action ?? 'moderation action'}`,
+				reason: `undo of ${prior.action ?? 'moderation action'}`,
 				actor: 'user',
 				createdAt: new Date().toISOString()
killedBy: undo with no prior audit row still restores and names the generic action
statusReason: Cannot read properties of undefined (reading 'action')

[Killed] LogicalOperator
channels/[id]/log/+page.server.ts:138:24
 				channelId: params.id,
 				commentId,
 				action: dryRun ? 'dry-run' : 'restore',
-				reason: `undo of ${prior?.action ?? 'moderation action'}`,
+				reason: `undo of ${prior?.action && 'moderation action'}`,
 				actor: 'user',
 				createdAt: new Date().toISOString()
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: expected [ …(2) ] to deep equally contain ObjectContaining{…}

[Killed] ObjectLiteral
channels/[id]/log/+page.server.ts:142:34
 				actor: 'user',
 				createdAt: new Date().toISOString()
 			});
-			await tx.update(comments).set({ status: 'approved', decidedBy: 'human' }).where(eq(comments.id, commentId));
+			await tx.update(comments).set({}).where(eq(comments.id, commentId));
 		});
 		return { success: 'Restored — recorded in audit log.' };
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: No values to set
