[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:29:48
 import { env } from '$env/dynamic/private';
 import { error, fail } from '@sveltejs/kit';
 
-export async function load({ params, locals }) {
-	// Database outage: the layout renders the overlay; this load must not 401
-	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, pending: [], maintenance: true };
-	const ch = await ownedChannel(params.id, locals);
-	const pending = await db
-		.select({
-			id: comments.id,
-			text: comments.text,
-			publishedAt: comments.publishedAt
-		})
-		.from(comments)
-		.where(and(eq(comments.channelId, params.id), eq(comments.status, 'pending')))
-		.orderBy(desc(comments.publishedAt))
-		.limit(100)
-		.all();
-	// Project only what the page renders — never serialize refreshTokenEnc (or
-	// any future secret column) or legacy author columns to the browser.
-	return { ch: { id: ch.id, title: ch.title }, pending };
-}
+export async function load({ params, locals }) {}
 
 async function act(paramsId: string, commentId: string, action: 'approve' | 'reject' | 'delete' | 'ban', locals: App.Locals) {
killedBy: load projects only the channel fields the page renders — never the credential
statusReason: expected undefined to deeply equal { id: 'UC1', title: 'One' }

[Killed] BooleanLiteral
channels/[id]/queue/+page.server.ts:32:90
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, pending: [], maintenance: true };
+	if (locals.dbDown) return { ch: { id: params.id, title: '' }, pending: [], maintenance: false };
 	const ch = await ownedChannel(params.id, locals);
 	const pending = await db
killedBy: queue load projection (behavior) returns the maintenance payload during a database outage instead of throwing
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:32:6
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, pending: [], maintenance: true };
+	if (true) return { ch: { id: params.id, title: '' }, pending: [], maintenance: true };
 	const ch = await ownedChannel(params.id, locals);
 	const pending = await db
killedBy: load projects only the channel fields the page renders — never the credential
statusReason: expected { id: 'UC1', title: '' } to deeply equal { id: 'UC1', title: 'One' }

[Killed] EqualityOperator
channels/[id]/queue/+page.server.ts:52:53
 
 async function act(paramsId: string, commentId: string, action: 'approve' | 'reject' | 'delete' | 'ban', locals: App.Locals) {
 	const ch = await ownedChannel(paramsId, locals);
-	const status = action === 'approve' ? 'approved' : action === 'delete' ? 'deleted' : 'rejected';
+	const status = action === 'approve' ? 'approved' : action !== 'delete' ? 'deleted' : 'rejected';
 	// Atomically claim the still-pending comment BEFORE any external call.
 	// Concurrent submissions otherwise both pass the pending check and issue
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: expected 'deleted' to be 'rejected' // Object.is equality

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:52:53
 
 async function act(paramsId: string, commentId: string, action: 'approve' | 'reject' | 'delete' | 'ban', locals: App.Locals) {
 	const ch = await ownedChannel(paramsId, locals);
-	const status = action === 'approve' ? 'approved' : action === 'delete' ? 'deleted' : 'rejected';
+	const status = action === 'approve' ? 'approved' : false ? 'deleted' : 'rejected';
 	// Atomically claim the still-pending comment BEFORE any external call.
 	// Concurrent submissions otherwise both pass the pending check and issue
killedBy: del outside DRY_RUN deletes on YouTube, marks deleted, and audits delete
statusReason: expected 'rejected' to be 'deleted' // Object.is equality

[Killed] StringLiteral
channels/[id]/queue/+page.server.ts:59:29
 	// update, the loser finds zero rows and 404s.
 	const claimed = await db
 		.update(comments)
-		.set({ status, decidedBy: 'human' })
+		.set({ status, decidedBy: "" })
 		.where(and(eq(comments.id, commentId), eq(comments.channelId, paramsId), eq(comments.status, 'pending')))
 		.returning({ id: comments.id });
killedBy: approve in DRY_RUN finalizes locally, audits dry-run, and skips YouTube
statusReason: expected '' to be 'human' // Object.is equality

[Killed] EqualityOperator
channels/[id]/queue/+page.server.ts:62:6
 		.set({ status, decidedBy: 'human' })
 		.where(and(eq(comments.id, commentId), eq(comments.channelId, paramsId), eq(comments.status, 'pending')))
 		.returning({ id: comments.id });
-	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
+	if (claimed.length !== 0) throw error(404, 'pending comment not found in this channel');
 	const dryRun = env.DRY_RUN === 'true';
 	try {
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: StrykerJS: Unknown test failure

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:62:6
 		.set({ status, decidedBy: 'human' })
 		.where(and(eq(comments.id, commentId), eq(comments.channelId, paramsId), eq(comments.status, 'pending')))
 		.returning({ id: comments.id });
-	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
+	if (true) throw error(404, 'pending comment not found in this channel');
 	const dryRun = env.DRY_RUN === 'true';
 	try {
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: StrykerJS: Unknown test failure

[Killed] EqualityOperator
channels/[id]/queue/+page.server.ts:63:17
 		.where(and(eq(comments.id, commentId), eq(comments.channelId, paramsId), eq(comments.status, 'pending')))
 		.returning({ id: comments.id });
 	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
-	const dryRun = env.DRY_RUN === 'true';
+	const dryRun = env.DRY_RUN !== 'true';
 	try {
 		if (!dryRun && action !== 'approve') {
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:63:17
 		.where(and(eq(comments.id, commentId), eq(comments.channelId, paramsId), eq(comments.status, 'pending')))
 		.returning({ id: comments.id });
 	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
-	const dryRun = env.DRY_RUN === 'true';
+	const dryRun = true;
 	try {
 		if (!dryRun && action !== 'approve') {
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:64:6
 		.returning({ id: comments.id });
 	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
 	const dryRun = env.DRY_RUN === 'true';
-	try {
-		if (!dryRun && action !== 'approve') {
-			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
-			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
-			if (action === 'delete') await deleteComment(commentId, token);
-		}
-	} catch (e) {
+	try {} catch (e) {
 		// Release the claim so a failed external action stays retryable.
 		await db.update(comments).set({ status: 'pending', decidedBy: 'none' }).where(eq(comments.id, commentId));
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] LogicalOperator
channels/[id]/queue/+page.server.ts:65:7
 	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
 	const dryRun = env.DRY_RUN === 'true';
 	try {
-		if (!dryRun && action !== 'approve') {
+		if (!dryRun || action !== 'approve') {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
killedBy: approve outside DRY_RUN skips YouTube entirely and audits approve
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "decrypted-refresh-token",

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:65:7
 	if (claimed.length === 0) throw error(404, 'pending comment not found in this channel');
 	const dryRun = env.DRY_RUN === 'true';
 	try {
-		if (!dryRun && action !== 'approve') {
+		if (true) {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
killedBy: approve in DRY_RUN finalizes locally, audits dry-run, and skips YouTube
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "decrypted-refresh-token",

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:67:8
 	try {
 		if (!dryRun && action !== 'approve') {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
+			if (false) await setModerationStatus([commentId], 'rejected', false, token);
 			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
 			if (action === 'delete') await deleteComment(commentId, token);
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] BooleanLiteral
channels/[id]/queue/+page.server.ts:67:80
 	try {
 		if (!dryRun && action !== 'approve') {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
-			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
+			if (action === 'reject') await setModerationStatus([commentId], 'rejected', true, token);
 			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
 			if (action === 'delete') await deleteComment(commentId, token);
killedBy: reject outside DRY_RUN calls YouTube and audits reject
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'c1' ], 'rejected', false, …(1) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] BooleanLiteral
channels/[id]/queue/+page.server.ts:68:77
 		if (!dryRun && action !== 'approve') {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
-			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
+			if (action === 'ban') await setModerationStatus([commentId], 'rejected', false, token);
 			if (action === 'delete') await deleteComment(commentId, token);
 		}
killedBy: ban outside DRY_RUN rejects with the author ban on YouTube and audits ban
statusReason: expected "vi.fn()" to be called with arguments: [ [ 'c1' ], 'rejected', true, …(1) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] EqualityOperator
channels/[id]/queue/+page.server.ts:68:8
 		if (!dryRun && action !== 'approve') {
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
-			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
+			if (action !== 'ban') await setModerationStatus([commentId], 'rejected', true, token);
 			if (action === 'delete') await deleteComment(commentId, token);
 		}
killedBy: reject outside DRY_RUN calls YouTube and audits reject
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
channels/[id]/queue/+page.server.ts:69:8
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
 			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
-			if (action === 'delete') await deleteComment(commentId, token);
+			if (action !== 'delete') await deleteComment(commentId, token);
 		}
 	} catch (e) {
killedBy: reject outside DRY_RUN calls YouTube and audits reject
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "c1",

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:69:8
 			const token = await refreshAccessToken(decrypt(ch.refreshTokenEnc));
 			if (action === 'reject') await setModerationStatus([commentId], 'rejected', false, token);
 			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
-			if (action === 'delete') await deleteComment(commentId, token);
+			if (false) await deleteComment(commentId, token);
 		}
 	} catch (e) {
killedBy: del outside DRY_RUN deletes on YouTube, marks deleted, and audits delete
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:71:14
 			if (action === 'ban') await setModerationStatus([commentId], 'rejected', true, token);
 			if (action === 'delete') await deleteComment(commentId, token);
 		}
-	} catch (e) {
-		// Release the claim so a failed external action stays retryable.
-		await db.update(comments).set({ status: 'pending', decidedBy: 'none' }).where(eq(comments.id, commentId));
-		throw e;
-	}
+	} catch (e) {}
 	await db.insert(auditLog).values({
 		channelId: paramsId,
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] ObjectLiteral
channels/[id]/queue/+page.server.ts:73:33
 		}
 	} catch (e) {
 		// Release the claim so a failed external action stays retryable.
-		await db.update(comments).set({ status: 'pending', decidedBy: 'none' }).where(eq(comments.id, commentId));
+		await db.update(comments).set({}).where(eq(comments.id, commentId));
 		throw e;
 	}
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: expected [Function] to throw error including 'youtube 500' but got 'No values to set'

[Killed] StringLiteral
channels/[id]/queue/+page.server.ts:73:43
 		}
 	} catch (e) {
 		// Release the claim so a failed external action stays retryable.
-		await db.update(comments).set({ status: 'pending', decidedBy: 'none' }).where(eq(comments.id, commentId));
+		await db.update(comments).set({ status: "", decidedBy: 'none' }).where(eq(comments.id, commentId));
 		throw e;
 	}
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: expected { id: 'c1', channelId: 'UC1', …(9) } to match object { Object (status, decidedBy) }
(9 matching properties omitted from actual)

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:86:59
 	});
 }
 
-function commentIdFrom(formData: FormData): string | null {
-	const raw = formData.get('commentId');
-	if (typeof raw !== 'string') return null;
-	const id = raw.trim();
-	return id ? id : null;
-}
+function commentIdFrom(formData: FormData): string | null {}
 
 export const actions = {
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { Object (success) }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:88:6
 
 function commentIdFrom(formData: FormData): string | null {
 	const raw = formData.get('commentId');
-	if (typeof raw !== 'string') return null;
+	if (false) return null;
 	const id = raw.trim();
 	return id ? id : null;
killedBy: every action rejects a missing commentId with 400 and mutates nothing
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:88:6
 
 function commentIdFrom(formData: FormData): string | null {
 	const raw = formData.get('commentId');
-	if (typeof raw !== 'string') return null;
+	if (true) return null;
 	const id = raw.trim();
 	return id ? id : null;
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { Object (success) }
(3 matching properties omitted from actual)

[Killed] MethodExpression
channels/[id]/queue/+page.server.ts:89:13
 function commentIdFrom(formData: FormData): string | null {
 	const raw = formData.get('commentId');
 	if (typeof raw !== 'string') return null;
-	const id = raw.trim();
+	const id = raw;
 	return id ? id : null;
 }
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:94:50
 }
 
 export const actions = {
-	approve: async ({ params, request, locals }) => {
-		requireUser(locals);
-		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'approve', locals);
-		return { success: 'Approved — recorded in audit log.' };
-	},
+	approve: async ({ params, request, locals }) => {},
 	reject: async ({ params, request, locals }) => {
 		requireUser(locals);
killedBy: every action rejects a signed-out request with 401 before validating the form
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:97:7
 	approve: async ({ params, request, locals }) => {
 		requireUser(locals);
 		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
+		if (false) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'approve', locals);
 		return { success: 'Approved — recorded in audit log.' };
killedBy: every action rejects a missing commentId with 400 and mutates nothing
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
channels/[id]/queue/+page.server.ts:97:7
 	approve: async ({ params, request, locals }) => {
 		requireUser(locals);
 		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
+		if (commentId) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'approve', locals);
 		return { success: 'Approved — recorded in audit log.' };
killedBy: every action rejects a missing commentId with 400 and mutates nothing
statusReason: StrykerJS: Unknown test failure

[Killed] StringLiteral
channels/[id]/queue/+page.server.ts:98:35
 		requireUser(locals);
 		const commentId = commentIdFrom(await request.formData());
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'approve', locals);
+		await act(params.id, commentId, "", locals);
 		return { success: 'Approved — recorded in audit log.' };
 	},
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: expected 'rejected' to be 'approved' // Object.is equality

[Killed] ObjectLiteral
channels/[id]/queue/+page.server.ts:99:10
 		const commentId = commentIdFrom(await request.formData());
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'approve', locals);
-		return { success: 'Approved — recorded in audit log.' };
+		return {};
 	},
 	reject: async ({ params, request, locals }) => {
killedBy: a whitespace-padded commentId is trimmed before lookup
statusReason: expected {} to match object { Object (success) }

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:101:49
 		await act(params.id, commentId, 'approve', locals);
 		return { success: 'Approved — recorded in audit log.' };
 	},
-	reject: async ({ params, request, locals }) => {
-		requireUser(locals);
-		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'reject', locals);
-		return { success: 'Rejected — recorded in audit log.' };
-	},
+	reject: async ({ params, request, locals }) => {},
 	del: async ({ params, request, locals }) => {
 		requireUser(locals);
killedBy: every action rejects a signed-out request with 401 before validating the form
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
channels/[id]/queue/+page.server.ts:105:35
 		requireUser(locals);
 		const commentId = commentIdFrom(await request.formData());
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'reject', locals);
+		await act(params.id, commentId, "", locals);
 		return { success: 'Rejected — recorded in audit log.' };
 	},
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: promise resolved "{ success: 'Rejected — recorded in a…' }" instead of rejecting

[Killed] StringLiteral
channels/[id]/queue/+page.server.ts:106:21
 		const commentId = commentIdFrom(await request.formData());
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'reject', locals);
-		return { success: 'Rejected — recorded in audit log.' };
+		return { success: "" };
 	},
 	del: async ({ params, request, locals }) => {
killedBy: a failed YouTube call releases the claim so the action stays retryable
statusReason: expected { success: '' } to match object { Object (success) }

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:108:46
 		await act(params.id, commentId, 'reject', locals);
 		return { success: 'Rejected — recorded in audit log.' };
 	},
-	del: async ({ params, request, locals }) => {
-		requireUser(locals);
-		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'delete', locals);
-		return { success: 'Deleted — recorded in audit log.' };
-	},
+	del: async ({ params, request, locals }) => {},
 	ban: async ({ params, request, locals }) => {
 		requireUser(locals);
killedBy: every action rejects a signed-out request with 401 before validating the form
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
channels/[id]/queue/+page.server.ts:111:7
 	del: async ({ params, request, locals }) => {
 		requireUser(locals);
 		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
+		if (true) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'delete', locals);
 		return { success: 'Deleted — recorded in audit log.' };
killedBy: act fails loudly on another channel comment and changes nothing
statusReason: promise resolved "ActionFailure{ status: 400, …(1) }" instead of rejecting

[Killed] ObjectLiteral
channels/[id]/queue/+page.server.ts:113:10
 		const commentId = commentIdFrom(await request.formData());
 		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
 		await act(params.id, commentId, 'delete', locals);
-		return { success: 'Deleted — recorded in audit log.' };
+		return {};
 	},
 	ban: async ({ params, request, locals }) => {
killedBy: del outside DRY_RUN deletes on YouTube, marks deleted, and audits delete
statusReason: expected {} to match object { Object (success) }

[Killed] BlockStatement
channels/[id]/queue/+page.server.ts:115:46
 		await act(params.id, commentId, 'delete', locals);
 		return { success: 'Deleted — recorded in audit log.' };
 	},
-	ban: async ({ params, request, locals }) => {
-		requireUser(locals);
-		const commentId = commentIdFrom(await request.formData());
-		if (!commentId) return fail(400, { error: 'Invalid comment ID' });
-		await act(params.id, commentId, 'ban', locals);
-		return { success: 'Author banned — recorded in audit log.' };
-	}
+	ban: async ({ params, request, locals }) => {}
 };
 
killedBy: every action rejects a signed-out request with 401 before validating the form
statusReason: promise resolved "undefined" instead of rejecting
