[Killed] BlockStatement
channels/[id]/rules/+page.server.ts:26:48
 import { and, eq } from 'drizzle-orm';
 import { fail } from '@sveltejs/kit';
 
-export async function load({ params, locals }) {
-	// Database outage: the layout renders the overlay; this load must not 401
-	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, rs: [], maintenance: true };
-	const ch = await ownedChannel(params.id, locals);
-	const rs = await db.select().from(rules).where(eq(rules.channelId, params.id)).all();
-	// Project only what the page renders — never serialize refreshTokenEnc (or
-	// any future secret column) to the browser.
-	return { ch: { id: ch.id, title: ch.title }, rs };
-}
+export async function load({ params, locals }) {}
 
 export const actions = {
killedBy: load returns the maintenance payload during a database outage instead of a 401
statusReason: expected undefined to deeply equal { ch: { id: 'UC1', title: '' }, …(2) }

[Killed] BooleanLiteral
channels/[id]/rules/+page.server.ts:29:85
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, rs: [], maintenance: true };
+	if (locals.dbDown) return { ch: { id: params.id, title: '' }, rs: [], maintenance: false };
 	const ch = await ownedChannel(params.id, locals);
 	const rs = await db.select().from(rules).where(eq(rules.channelId, params.id)).all();
killedBy: load returns the maintenance payload during a database outage instead of a 401
statusReason: expected { ch: { id: 'UC1', title: '' }, …(2) } to deeply equal { ch: { id: 'UC1', title: '' }, …(2) }

[Killed] ConditionalExpression
channels/[id]/rules/+page.server.ts:29:6
 export async function load({ params, locals }) {
 	// Database outage: the layout renders the overlay; this load must not 401
 	// on the null-user outage shape.
-	if (locals.dbDown) return { ch: { id: params.id, title: '' }, rs: [], maintenance: true };
+	if (true) return { ch: { id: params.id, title: '' }, rs: [], maintenance: true };
 	const ch = await ownedChannel(params.id, locals);
 	const rs = await db.select().from(rules).where(eq(rules.channelId, params.id)).all();
killedBy: load projects only the channel fields the page renders — never the credential
statusReason: expected { id: 'UC1', title: '' } to deeply equal { id: 'UC1', title: 'Ch' }

[Killed] ObjectLiteral
channels/[id]/rules/+page.server.ts:34:15
 	const rs = await db.select().from(rules).where(eq(rules.channelId, params.id)).all();
 	// Project only what the page renders — never serialize refreshTokenEnc (or
 	// any future secret column) to the browser.
-	return { ch: { id: ch.id, title: ch.title }, rs };
+	return { ch: {}, rs };
 }
 
killedBy: load projects only the channel fields the page renders — never the credential
statusReason: expected {} to deeply equal { id: 'UC1', title: 'Ch' }

[Killed] BlockStatement
channels/[id]/rules/+page.server.ts:38:46
 }
 
 export const actions = {
-	add: async ({ params, request, locals }) => {
-		await ownedChannel(params.id, locals);
-		const f = await request.formData();
-		const type = String(f.get('type') ?? '');
-		const pattern = String(f.get('pattern') ?? '').trim();
-		const action = String(f.get('action') ?? '');
-		try {
-			validateRule({ id: 0, type, pattern, action });
-		} catch (e) {
-			return fail(400, { error: e instanceof Error ? e.message : String(e) });
-		}
-		await db.insert(rules).values({
-			channelId: params.id,
-			type,
-			pattern,
-			action,
-			createdAt: new Date().toISOString()
-		});
-		return { ok: true };
-	},
+	add: async ({ params, request, locals }) => {},
 	remove: async ({ params, request, locals }) => {
 		await ownedChannel(params.id, locals);
killedBy: add on a channel owned by another team fails with 404 and inserts nothing
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
channels/[id]/rules/+page.server.ts:41:23
 	add: async ({ params, request, locals }) => {
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
-		const type = String(f.get('type') ?? '');
+		const type = String(f.get('type') && '');
 		const pattern = String(f.get('pattern') ?? '').trim();
 		const action = String(f.get('action') ?? '');
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: expected ActionFailure{ status: 400, …(1) } to deeply equal { ok: true }

[Killed] LogicalOperator
channels/[id]/rules/+page.server.ts:42:26
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
 		const type = String(f.get('type') ?? '');
-		const pattern = String(f.get('pattern') ?? '').trim();
+		const pattern = String(f.get('pattern') && '').trim();
 		const action = String(f.get('action') ?? '');
 		try {
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: expected ActionFailure{ status: 400, …(1) } to deeply equal { ok: true }

[Killed] MethodExpression
channels/[id]/rules/+page.server.ts:42:19
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
 		const type = String(f.get('type') ?? '');
-		const pattern = String(f.get('pattern') ?? '').trim();
+		const pattern = String(f.get('pattern') ?? '');
 		const action = String(f.get('action') ?? '');
 		try {
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: expected { id: 1, channelId: 'UC1', …(4) } to match object { channelId: 'UC1', …(3) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
channels/[id]/rules/+page.server.ts:43:25
 		const f = await request.formData();
 		const type = String(f.get('type') ?? '');
 		const pattern = String(f.get('pattern') ?? '').trim();
-		const action = String(f.get('action') ?? '');
+		const action = String(f.get('action') && '');
 		try {
 			validateRule({ id: 0, type, pattern, action });
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: expected ActionFailure{ status: 400, …(1) } to deeply equal { ok: true }

[Killed] StringLiteral
channels/[id]/rules/+page.server.ts:43:44
 		const f = await request.formData();
 		const type = String(f.get('type') ?? '');
 		const pattern = String(f.get('pattern') ?? '').trim();
-		const action = String(f.get('action') ?? '');
+		const action = String(f.get('action') ?? "Stryker was here!");
 		try {
 			validateRule({ id: 0, type, pattern, action });
killedBy: add rejects missing form fields with the validator message and inserts nothing
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 400, …(1) }

[Killed] BlockStatement
channels/[id]/rules/+page.server.ts:44:7
 		const type = String(f.get('type') ?? '');
 		const pattern = String(f.get('pattern') ?? '').trim();
 		const action = String(f.get('action') ?? '');
-		try {
-			validateRule({ id: 0, type, pattern, action });
-		} catch (e) {
+		try {} catch (e) {
 			return fail(400, { error: e instanceof Error ? e.message : String(e) });
 		}
killedBy: add rejects an unsupported rule type with the validator message and inserts nothing
statusReason: expected { ok: true } to match object { status: 400, …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
channels/[id]/rules/+page.server.ts:46:15
 		const action = String(f.get('action') ?? '');
 		try {
 			validateRule({ id: 0, type, pattern, action });
-		} catch (e) {
-			return fail(400, { error: e instanceof Error ? e.message : String(e) });
-		}
+		} catch (e) {}
 		await db.insert(rules).values({
 			channelId: params.id,
killedBy: add rejects an unsupported rule type with the validator message and inserts nothing
statusReason: expected { ok: true } to match object { status: 400, …(1) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
channels/[id]/rules/+page.server.ts:49:33
 		} catch (e) {
 			return fail(400, { error: e instanceof Error ? e.message : String(e) });
 		}
-		await db.insert(rules).values({
-			channelId: params.id,
-			type,
-			pattern,
-			action,
-			createdAt: new Date().toISOString()
-		});
+		await db.insert(rules).values({});
 		return { ok: true };
 	},
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: Failed query: insert into "rules" ("id", "channel_id", "type", "pattern", "action", "created_at") values (null, null, null, null, null, (strftime('%Y-%m-%dT%H:%M:%fZ', 'now')))
params:

[Killed] BooleanLiteral
channels/[id]/rules/+page.server.ts:56:16
 			action,
 			createdAt: new Date().toISOString()
 		});
-		return { ok: true };
+		return { ok: false };
 	},
 	remove: async ({ params, request, locals }) => {
killedBy: add validates, trims the pattern, and inserts the rule
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] BlockStatement
channels/[id]/rules/+page.server.ts:58:49
 		});
 		return { ok: true };
 	},
-	remove: async ({ params, request, locals }) => {
-		await ownedChannel(params.id, locals);
-		const f = await request.formData();
-		const ruleId = Number(f.get('ruleId'));
-		if (!Number.isInteger(ruleId) || ruleId <= 0) {
-			return fail(400, { error: 'Invalid rule ID' });
-		}
-		// Scope to this route's channel so a request here cannot delete another channel's rule.
-		const deleted = await db
-			.delete(rules)
-			.where(and(eq(rules.id, ruleId), eq(rules.channelId, params.id)))
-			.returning({ id: rules.id });
-		if (deleted.length === 0) return fail(404, { error: 'rule not found' });
-		return { ok: true };
-	}
+	remove: async ({ params, request, locals }) => {}
 };
 
killedBy: remove deletes this channel rule and reports ok
statusReason: expected undefined to match object { ok: true }

[Killed] StringLiteral
channels/[id]/rules/+page.server.ts:61:31
 	remove: async ({ params, request, locals }) => {
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
-		const ruleId = Number(f.get('ruleId'));
+		const ruleId = Number(f.get(""));
 		if (!Number.isInteger(ruleId) || ruleId <= 0) {
 			return fail(400, { error: 'Invalid rule ID' });
killedBy: remove deletes this channel rule and reports ok
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
channels/[id]/rules/+page.server.ts:62:7
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
 		const ruleId = Number(f.get('ruleId'));
-		if (!Number.isInteger(ruleId) || ruleId <= 0) {
+		if (false) {
 			return fail(400, { error: 'Invalid rule ID' });
 		}
killedBy: remove rejects a malformed ruleId with 400
statusReason: Failed query: delete from "rules" where ("rules"."id" = ? and "rules"."channel_id" = ?) returning "id"
params: NaN,UC1

[Killed] EqualityOperator
channels/[id]/rules/+page.server.ts:62:36
 		await ownedChannel(params.id, locals);
 		const f = await request.formData();
 		const ruleId = Number(f.get('ruleId'));
-		if (!Number.isInteger(ruleId) || ruleId <= 0) {
+		if (!Number.isInteger(ruleId) || ruleId < 0) {
 			return fail(400, { error: 'Invalid rule ID' });
 		}
killedBy: remove rejects a malformed ruleId with 400
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { status: 400, …(1) }

[Killed] EqualityOperator
channels/[id]/rules/+page.server.ts:70:7
 			.delete(rules)
 			.where(and(eq(rules.id, ruleId), eq(rules.channelId, params.id)))
 			.returning({ id: rules.id });
-		if (deleted.length === 0) return fail(404, { error: 'rule not found' });
+		if (deleted.length !== 0) return fail(404, { error: 'rule not found' });
 		return { ok: true };
 	}
killedBy: remove deletes this channel rule and reports ok
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
channels/[id]/rules/+page.server.ts:70:7
 			.delete(rules)
 			.where(and(eq(rules.id, ruleId), eq(rules.channelId, params.id)))
 			.returning({ id: rules.id });
-		if (deleted.length === 0) return fail(404, { error: 'rule not found' });
+		if (true) return fail(404, { error: 'rule not found' });
 		return { ok: true };
 	}
killedBy: remove deletes this channel rule and reports ok
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] BooleanLiteral
channels/[id]/rules/+page.server.ts:71:16
 			.where(and(eq(rules.id, ruleId), eq(rules.channelId, params.id)))
 			.returning({ id: rules.id });
 		if (deleted.length === 0) return fail(404, { error: 'rule not found' });
-		return { ok: true };
+		return { ok: false };
 	}
 };
killedBy: remove deletes this channel rule and reports ok
statusReason: expected { ok: false } to match object { ok: true }

[Killed] ObjectLiteral
channels/[id]/rules/+page.server.ts:71:10
 			.where(and(eq(rules.id, ruleId), eq(rules.channelId, params.id)))
 			.returning({ id: rules.id });
 		if (deleted.length === 0) return fail(404, { error: 'rule not found' });
-		return { ok: true };
+		return {};
 	}
 };
killedBy: remove deletes this channel rule and reports ok
statusReason: expected {} to match object { ok: true }
