[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:39:6
 	// Database outage: the overlay replaces the dashboard. Checked before
 	// requireUser because an outage means the session lookup failed and
 	// locals.user is null — the maintenance page IS the signed-in state.
-	if (locals.dbDown) return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
+	if (false) return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
 	const user = requireUser(locals);
 	try {
killedBy: a database outage returns the maintenance payload without requiring a user
statusReason: StrykerJS: Unknown test failure

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:39:73
 	// Database outage: the overlay replaces the dashboard. Checked before
 	// requireUser because an outage means the session lookup failed and
 	// locals.user is null — the maintenance page IS the signed-in state.
-	if (locals.dbDown) return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
+	if (locals.dbDown) return { chs: [], stats: [], bans: [], maintenance: false, orgRole: null };
 	const user = requireUser(locals);
 	try {
killedBy: a database outage returns the maintenance payload without requiring a user
statusReason: expected { chs: [], stats: [], bans: [], …(2) } to deeply equal { chs: [], stats: [], bans: [], …(2) }

[Killed] ArrowFunction
routes/(app)/dashboard/+page.server.ts:58:30
 			.from(channels)
 			.where(eq(channels.orgId, user.orgId))
 			.all();
-		const channelIds = chs.map((ch) => ch.id);
+		const channelIds = chs.map(() => undefined);
 		const stats = channelIds.length
 			? await db
killedBy: dashboard load never serializes the encrypted refresh token
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:61:86
 		const channelIds = chs.map((ch) => ch.id);
 		const stats = channelIds.length
 			? await db
-					.select({ channelId: comments.channelId, status: comments.status, n: sql<number>`count(*)` })
+					.select({ channelId: comments.channelId, status: comments.status, n: sql<number>`` })
 					.from(comments)
 					.where(inArray(comments.channelId, channelIds))
killedBy: dashboard load never serializes the encrypted refresh token
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
routes/(app)/dashboard/+page.server.ts:66:6
 					.where(inArray(comments.channelId, channelIds))
 					.groupBy(comments.channelId, comments.status)
 					.all()
-			: [];
+			: ["Stryker was here"];
 		// Count ban EVENTS from the audit log, not moderation_actions: manual queue
 		// bans never create moderation_actions rows, so counting that table hid
killedBy: dashboard load returns empty stats and bans when the team has no channels
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:75:61
 		// equal ban state; dry-run rows are excluded by the action filter.
 		const bans = channelIds.length
 			? await db
-					.select({ channelId: auditLog.channelId, n: sql<number>`count(*)` })
+					.select({ channelId: auditLog.channelId, n: sql<number>`` })
 					.from(auditLog)
 					.where(and(eq(auditLog.action, 'ban'), inArray(auditLog.channelId, channelIds)))
killedBy: dashboard load never serializes the encrypted refresh token
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:81:43
 					.groupBy(auditLog.channelId)
 					.all()
 			: [];
-		return { chs, stats, bans, maintenance: false, orgRole: user.orgRole };
+		return { chs, stats, bans, maintenance: true, orgRole: user.orgRole };
 	} catch (e) {
 		// A deliberate HttpError is NOT an outage — fail loudly, same as hooks.
killedBy: dashboard load shows only the active team's channels
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:81:10
 					.groupBy(auditLog.channelId)
 					.all()
 			: [];
-		return { chs, stats, bans, maintenance: false, orgRole: user.orgRole };
+		return {};
 	} catch (e) {
 		// A deliberate HttpError is NOT an outage — fail loudly, same as hooks.
killedBy: dashboard load never serializes the encrypted refresh token
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:82:14
 					.all()
 			: [];
 		return { chs, stats, bans, maintenance: false, orgRole: user.orgRole };
-	} catch (e) {
-		// A deliberate HttpError is NOT an outage — fail loudly, same as hooks.
-		if (isHttpError(e)) throw e;
-		// Intermittent outage: the hook queries succeeded but these didn't.
-		// Loud on the server, a maintenance overlay for the user — never a 500.
-		console.error('dashboard load failed:', e);
-		return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
-	}
+	} catch (e) {}
 }
 
killedBy: a database failure mid-load degrades to the maintenance payload and logs loudly
statusReason: expected undefined to deeply equal { chs: [], stats: [], bans: [], …(2) }

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:84:7
 		return { chs, stats, bans, maintenance: false, orgRole: user.orgRole };
 	} catch (e) {
 		// A deliberate HttpError is NOT an outage — fail loudly, same as hooks.
-		if (isHttpError(e)) throw e;
+		if (false) throw e;
 		// Intermittent outage: the hook queries succeeded but these didn't.
 		// Loud on the server, a maintenance overlay for the user — never a 500.
killedBy: a deliberate HttpError mid-load propagates instead of degrading to maintenance
statusReason: promise resolved "{ chs: [], stats: [], bans: [], …(2) }" instead of rejecting

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:84:7
 		return { chs, stats, bans, maintenance: false, orgRole: user.orgRole };
 	} catch (e) {
 		// A deliberate HttpError is NOT an outage — fail loudly, same as hooks.
-		if (isHttpError(e)) throw e;
+		if (true) throw e;
 		// Intermittent outage: the hook queries succeeded but these didn't.
 		// Loud on the server, a maintenance overlay for the user — never a 500.
killedBy: a database failure mid-load degrades to the maintenance payload and logs loudly
statusReason: Failed query: select "id", "title", "cursor", "last_run_at", "tone_level", "protect_lgbtqia", "protect_women" from "channels" where "channels"."org_id" = ?
params: org-1

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:88:55
 		// Intermittent outage: the hook queries succeeded but these didn't.
 		// Loud on the server, a maintenance overlay for the user — never a 500.
 		console.error('dashboard load failed:', e);
-		return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
+		return { chs: [], stats: [], bans: [], maintenance: false, orgRole: null };
 	}
 }
killedBy: a database failure mid-load degrades to the maintenance payload and logs loudly
statusReason: expected { chs: [], stats: [], bans: [], …(2) } to deeply equal { chs: [], stats: [], bans: [], …(2) }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:88:10
 		// Intermittent outage: the hook queries succeeded but these didn't.
 		// Loud on the server, a maintenance overlay for the user — never a 500.
 		console.error('dashboard load failed:', e);
-		return { chs: [], stats: [], bans: [], maintenance: true, orgRole: null };
+		return {};
 	}
 }
killedBy: a database failure mid-load degrades to the maintenance payload and logs loudly
statusReason: expected {} to deeply equal { chs: [], stats: [], bans: [], …(2) }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:100:3
 	orgId: string,
 	channelId: string,
 	values: Partial<Pick<typeof channels.$inferInsert, 'toneLevel' | 'protectLgbtqia' | 'protectWomen'>>
-) {
-	return db
-		.update(channels)
-		.set(values)
-		.where(and(eq(channels.id, channelId), eq(channels.orgId, orgId)))
-		.returning({ id: channels.id });
-}
+) {}
 
 export const actions = {
killedBy: persists sensitivity level '1'
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:105:14
 		.update(channels)
 		.set(values)
 		.where(and(eq(channels.id, channelId), eq(channels.orgId, orgId)))
-		.returning({ id: channels.id });
+		.returning({});
 }
 
killedBy: persists sensitivity level '1'
statusReason: Failed query: update "channels" set "tone_level" = ? where ("channels"."id" = ? and "channels"."org_id" = ?) returning 
params: 1,UC1,org-1

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:109:47
 }
 
 export const actions = {
-	setToneLevel: async ({ request, locals }) => {
-		const user = requireUser(locals);
-		const f = await request.formData();
-		const channelId = String(f.get('channelId') ?? '');
-		const toneLevel = Number(f.get('toneLevel'));
-		if (toneLevel !== 1 && toneLevel !== 2) {
-			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
-		}
-		const updated = await updateOwnChannel(user.orgId, channelId, { toneLevel });
-		if (updated.length === 0) return fail(404, { error: 'channel not found' });
-		return { ok: true };
-	},
+	setToneLevel: async ({ request, locals }) => {},
 	setProtections: async ({ request, locals }) => {
 		const user = requireUser(locals);
killedBy: persists sensitivity level '1'
statusReason: expected undefined to match object { ok: true }

[Killed] LogicalOperator
routes/(app)/dashboard/+page.server.ts:112:28
 	setToneLevel: async ({ request, locals }) => {
 		const user = requireUser(locals);
 		const f = await request.formData();
-		const channelId = String(f.get('channelId') ?? '');
+		const channelId = String(f.get('channelId') && '');
 		const toneLevel = Number(f.get('toneLevel'));
 		if (toneLevel !== 1 && toneLevel !== 2) {
killedBy: persists sensitivity level '1'
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:113:34
 		const user = requireUser(locals);
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
-		const toneLevel = Number(f.get('toneLevel'));
+		const toneLevel = Number(f.get(""));
 		if (toneLevel !== 1 && toneLevel !== 2) {
 			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
killedBy: persists sensitivity level '1'
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:114:26
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
 		const toneLevel = Number(f.get('toneLevel'));
-		if (toneLevel !== 1 && toneLevel !== 2) {
+		if (toneLevel !== 1 && toneLevel === 2) {
 			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
 		}
killedBy: persists sensitivity level '2'
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:114:7
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
 		const toneLevel = Number(f.get('toneLevel'));
-		if (toneLevel !== 1 && toneLevel !== 2) {
+		if (false) {
 			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
 		}
killedBy: rejects invalid sensitivity level "'0'" with 400 and changes nothing
statusReason: expected { ok: true } to match object { status: 400, …(1) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:118:7
 			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
 		}
 		const updated = await updateOwnChannel(user.orgId, channelId, { toneLevel });
-		if (updated.length === 0) return fail(404, { error: 'channel not found' });
+		if (updated.length !== 0) return fail(404, { error: 'channel not found' });
 		return { ok: true };
 	},
killedBy: persists sensitivity level '1'
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:118:7
 			return fail(400, { error: 'tone level must be 1 (Edge Lord) or 2 (Edge lord + Ackchyually…)' });
 		}
 		const updated = await updateOwnChannel(user.orgId, channelId, { toneLevel });
-		if (updated.length === 0) return fail(404, { error: 'channel not found' });
+		if (false) return fail(404, { error: 'channel not found' });
 		return { ok: true };
 	},
killedBy: rejects an unknown channel with 404
statusReason: expected { ok: true } to match object { status: 404, …(1) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:119:16
 		}
 		const updated = await updateOwnChannel(user.orgId, channelId, { toneLevel });
 		if (updated.length === 0) return fail(404, { error: 'channel not found' });
-		return { ok: true };
+		return { ok: false };
 	},
 	setProtections: async ({ request, locals }) => {
killedBy: persists sensitivity level '1'
statusReason: expected { ok: false } to match object { ok: true }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:121:49
 		if (updated.length === 0) return fail(404, { error: 'channel not found' });
 		return { ok: true };
 	},
-	setProtections: async ({ request, locals }) => {
-		const user = requireUser(locals);
-		const f = await request.formData();
-		const channelId = String(f.get('channelId') ?? '');
-		// Checkbox semantics: 'on' when ticked, absent when not — an absent
-		// field persists 0 so unticking clears the flag.
-		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
-		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
-		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
-		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
-		return { ok: true };
-	},
+	setProtections: async ({ request, locals }) => {},
 	analyzeHistory: async ({ request, locals }) => {
 		const user = requireUser(locals);
killedBy: set protections persists both flags on
statusReason: expected undefined to match object { ok: true }

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:127:26
 		const channelId = String(f.get('channelId') ?? '');
 		// Checkbox semantics: 'on' when ticked, absent when not — an absent
 		// field persists 0 so unticking clears the flag.
-		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
+		const protectLgbtqia = f.get('protectLgbtqia') !== 'on' ? 1 : 0;
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
killedBy: set protections persists both flags on
statusReason: expected { protectLgbtqia: +0, protectWomen: 1 } to deeply equal { protectLgbtqia: 1, protectWomen: 1 }

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:127:26
 		const channelId = String(f.get('channelId') ?? '');
 		// Checkbox semantics: 'on' when ticked, absent when not — an absent
 		// field persists 0 so unticking clears the flag.
-		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
+		const protectLgbtqia = false ? 1 : 0;
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
killedBy: set protections persists both flags on
statusReason: expected { protectLgbtqia: +0, protectWomen: 1 } to deeply equal { protectLgbtqia: 1, protectWomen: 1 }

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:128:24
 		// Checkbox semantics: 'on' when ticked, absent when not — an absent
 		// field persists 0 so unticking clears the flag.
 		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
-		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
+		const protectWomen = true ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
 		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
killedBy: set protections persists 0 for an unticked women checkbox
statusReason: expected { protectLgbtqia: 1, protectWomen: 1 } to deeply equal { protectLgbtqia: 1, protectWomen: +0 }

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:128:24
 		// Checkbox semantics: 'on' when ticked, absent when not — an absent
 		// field persists 0 so unticking clears the flag.
 		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
-		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
+		const protectWomen = false ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
 		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
killedBy: set protections persists both flags on
statusReason: expected { protectLgbtqia: 1, protectWomen: +0 } to deeply equal { protectLgbtqia: 1, protectWomen: 1 }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:129:65
 		// field persists 0 so unticking clears the flag.
 		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
-		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
+		const updated = await updateOwnChannel(user.orgId, channelId, {});
 		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
 		return { ok: true };
killedBy: set protections persists both flags on
statusReason: No values to set

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:130:7
 		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
-		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
+		if (updated.length !== 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
 		return { ok: true };
 	},
killedBy: set protections persists both flags on
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:130:7
 		const protectLgbtqia = f.get('protectLgbtqia') === 'on' ? 1 : 0;
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
-		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
+		if (false) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
 		return { ok: true };
 	},
killedBy: set protections rejects an unknown channel with 404
statusReason: expected { ok: true } to match object { status: 404, data: { …(3) } }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:131:16
 		const protectWomen = f.get('protectWomen') === 'on' ? 1 : 0;
 		const updated = await updateOwnChannel(user.orgId, channelId, { protectLgbtqia, protectWomen });
 		if (updated.length === 0) return fail(404, { scope: 'protections', channelId, error: 'channel not found' });
-		return { ok: true };
+		return { ok: false };
 	},
 	analyzeHistory: async ({ request, locals }) => {
killedBy: set protections persists both flags on
statusReason: expected { ok: false } to match object { ok: true }

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:136:50
 	analyzeHistory: async ({ request, locals }) => {
 		const user = requireUser(locals);
 		const f = await request.formData();
-		const channelId = String(f.get('channelId') ?? '');
+		const channelId = String(f.get('channelId') ?? "Stryker was here!");
 		const months = Number(f.get('months'));
 		// Preset windows only — the scan drains newest-first at 300 comments per
killedBy: 'analyze history' treats an absent channelId field as empty — never matching any channel
statusReason: expected undefined to be 404 // Object.is equality

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:140:44
 		const months = Number(f.get('months'));
 		// Preset windows only — the scan drains newest-first at 300 comments per
 		// run, so an unbounded window is an unbounded API/AI cost (I10).
-		if (![1, 3, 6, 12, 24].includes(months)) {
-			return fail(400, { scope: 'history', channelId, error: 'history window must be 1, 3, 6, 12, or 24 months' });
-		}
+		if (![1, 3, 6, 12, 24].includes(months)) {}
 		// Move the scan boundary back and reset the drain state: cron's next runs
 		// page from the newest comment down to this boundary. Already-seen
killedBy: analyze history rejects months "'0'" with 400 and changes nothing
statusReason: expected { ok: true, scope: 'history', …(2) } to match object { status: 400, data: { …(3) } }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:140:7
 		const months = Number(f.get('months'));
 		// Preset windows only — the scan drains newest-first at 300 comments per
 		// run, so an unbounded window is an unbounded API/AI cost (I10).
-		if (![1, 3, 6, 12, 24].includes(months)) {
+		if (false) {
 			return fail(400, { scope: 'history', channelId, error: 'history window must be 1, 3, 6, 12, or 24 months' });
 		}
killedBy: analyze history rejects months "'0'" with 400 and changes nothing
statusReason: expected { ok: true, scope: 'history', …(2) } to match object { status: 400, data: { …(3) } }
(4 matching properties omitted from actual)

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:141:30
 		// Preset windows only — the scan drains newest-first at 300 comments per
 		// run, so an unbounded window is an unbounded API/AI cost (I10).
 		if (![1, 3, 6, 12, 24].includes(months)) {
-			return fail(400, { scope: 'history', channelId, error: 'history window must be 1, 3, 6, 12, or 24 months' });
+			return fail(400, { scope: "", channelId, error: 'history window must be 1, 3, 6, 12, or 24 months' });
 		}
 		// Move the scan boundary back and reset the drain state: cron's next runs
killedBy: analyze history rejects months "'0'" with 400 and changes nothing
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 400, data: { …(3) } }

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:148:42
 		// comments are skipped before scoring (decideNewComments dedupes by id),
 		// so only the unscanned history costs moderation calls. Tenancy-scoped:
 		// another team's channel reads as "not found".
-		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
+		const boundary = new Date(Date.now() - months * 30 / 24 * 60 * 60 * 1000).toISOString();
 		// Coordinate with the cron lease: a run in flight would otherwise persist
 		// its own scan state and silently cancel (or be cancelled by) this reset.
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: expected 1786018335044 to be less than or equal to 1778255836046

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:148:42
 		// comments are skipped before scoring (decideNewComments dedupes by id),
 		// so only the unscanned history costs moderation calls. Tenancy-scoped:
 		// another team's channel reads as "not found".
-		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
+		const boundary = new Date(Date.now() - months * 30 * 24 / 60 * 60 * 1000).toISOString();
 		// Coordinate with the cron lease: a run in flight would otherwise persist
 		// its own scan state and silently cancel (or be cancelled by) this reset.
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: expected 1786029674955 to be less than or equal to 1778255835956

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:156:9
 		const claimable = or(isNull(channels.leaseExpiresAt), lt(channels.leaseExpiresAt, new Date().toISOString()));
 		const updated = await db
 			.update(channels)
-			.set({ cursor: boundary, nextPageToken: null, scanCursor: null })
+			.set({})
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId), claimable))
 			.returning({ id: channels.id });
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: No values to set

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:159:7
 			.set({ cursor: boundary, nextPageToken: null, scanCursor: null })
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId), claimable))
 			.returning({ id: channels.id });
-		if (updated.length === 0) {
+		if (false) {
 			// Distinguish "not your channel" from "currently scanning": the extra
 			// read only happens on the failure path.
killedBy: analyze history rejects an unknown channel with 404
statusReason: expected { ok: true, scope: 'history', …(2) } to match object { status: 404, data: { …(3) } }
(4 matching properties omitted from actual)

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:159:29
 			.set({ cursor: boundary, nextPageToken: null, scanCursor: null })
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId), claimable))
 			.returning({ id: channels.id });
-		if (updated.length === 0) {
-			// Distinguish "not your channel" from "currently scanning": the extra
-			// read only happens on the failure path.
-			const existing = await db
-				.select({ id: channels.id })
-				.from(channels)
-				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
-				.get();
-			if (existing) {
-				return fail(409, {
-					scope: 'history',
-					channelId,
-					error: 'This channel is mid-scan — retry in a minute.'
-				});
-			}
-			return fail(404, { scope: 'history', channelId, error: 'channel not found' });
-		}
+		if (updated.length === 0) {}
 		console.info(`history analysis requested for channel ${channelId}: scanning back to ${boundary}`);
 		return { ok: true, scope: 'history', channelId, months };
killedBy: analyze history rejects an unknown channel with 404
statusReason: expected { ok: true, scope: 'history', …(2) } to match object { status: 404, data: { …(3) } }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:167:8
 				.from(channels)
 				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 				.get();
-			if (existing) {
+			if (false) {
 				return fail(409, {
 					scope: 'history',
killedBy: analyze history returns 409 while the channel is leased to a cron run and changes nothing
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { status: 409, data: { …(3) } }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:167:18
 				.from(channels)
 				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 				.get();
-			if (existing) {
-				return fail(409, {
-					scope: 'history',
-					channelId,
-					error: 'This channel is mid-scan — retry in a minute.'
-				});
-			}
+			if (existing) {}
 			return fail(404, { scope: 'history', channelId, error: 'channel not found' });
 		}
killedBy: analyze history returns 409 while the channel is leased to a cron run and changes nothing
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { status: 409, data: { …(3) } }

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:176:16
 			}
 			return fail(404, { scope: 'history', channelId, error: 'channel not found' });
 		}
-		console.info(`history analysis requested for channel ${channelId}: scanning back to ${boundary}`);
+		console.info(``);
 		return { ok: true, scope: 'history', channelId, months };
 	},
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: expected "info" to be called with arguments: [ StringMatching{…} ]

Received:

  1st info call:

  [
-   StringMatching /^history analysis requested for channel UC1: scanning back to /,

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:177:16
 			return fail(404, { scope: 'history', channelId, error: 'channel not found' });
 		}
 		console.info(`history analysis requested for channel ${channelId}: scanning back to ${boundary}`);
-		return { ok: true, scope: 'history', channelId, months };
+		return { ok: false, scope: 'history', channelId, months };
 	},
 	dryRun: async ({ request, locals }) => {
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: expected { ok: false, scope: 'history', …(2) } to match object { ok: true, scope: 'history', …(2) }
