[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:177:29
 			return fail(404, { scope: 'history', channelId, error: 'channel not found' });
 		}
 		console.info(`history analysis requested for channel ${channelId}: scanning back to ${boundary}`);
-		return { ok: true, scope: 'history', channelId, months };
+		return { ok: true, scope: "", channelId, months };
 	},
 	dryRun: async ({ request, locals }) => {
killedBy: analyze history moves the scan boundary N months back and resets the drain state
statusReason: expected { ok: true, scope: '', …(2) } to match object { ok: true, scope: 'history', …(2) }

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:182:34
 	dryRun: async ({ request, locals }) => {
 		const user = requireUser(locals);
 		const f = await request.formData();
-		const channelId = String(f.get('channelId') ?? '');
+		const channelId = String(f.get("") ?? '');
 		// Same presets as Analyze history; absent → 3 (the UI default).
 		const months = f.has('months') ? Number(f.get('months')) : 3;
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Number of calls: 0

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:184:49
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
 		// Same presets as Analyze history; absent → 3 (the UI default).
-		const months = f.has('months') ? Number(f.get('months')) : 3;
+		const months = f.has('months') ? Number(f.get("")) : 3;
 		if (![1, 3, 6, 12, 24].includes(months)) {
 			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
killedBy: 'an incomplete window persists the dra…'
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { ok: true, months: 6, …(2) }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:185:7
 		const channelId = String(f.get('channelId') ?? '');
 		// Same presets as Analyze history; absent → 3 (the UI default).
 		const months = f.has('months') ? Number(f.get('months')) : 3;
-		if (![1, 3, 6, 12, 24].includes(months)) {
+		if (true) {
 			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
 		}
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:185:44
 		const channelId = String(f.get('channelId') ?? '');
 		// Same presets as Analyze history; absent → 3 (the UI default).
 		const months = f.has('months') ? Number(f.get('months')) : 3;
-		if (![1, 3, 6, 12, 24].includes(months)) {
-			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
-		}
+		if (![1, 3, 6, 12, 24].includes(months)) {}
 		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
 		// Atomic lease claim, same protocol as cron/analyzeHistory: the UPDATE's
killedBy: dry run rejects an unsupported months preset with 400 and never runs
statusReason: expected ActionFailure{ status: 502, …(1) } to match object { status: 400, data: { …(2) } }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:186:21
 		// Same presets as Analyze history; absent → 3 (the UI default).
 		const months = f.has('months') ? Number(f.get('months')) : 3;
 		if (![1, 3, 6, 12, 24].includes(months)) {
-			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
+			return fail(400, {});
 		}
 		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
killedBy: dry run rejects an unsupported months preset with 400 and never runs
statusReason: expected ActionFailure{ status: 400, data: {} } to match object { status: 400, data: { …(2) } }

[Survived] StringLiteral
routes/(app)/dashboard/+page.server.ts:186:58
 		// Same presets as Analyze history; absent → 3 (the UI default).
 		const months = f.has('months') ? Number(f.get('months')) : 3;
 		if (![1, 3, 6, 12, 24].includes(months)) {
-			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
+			return fail(400, { scope: 'dryRun', channelId, error: "" });
 		}
 		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:188:42
 		if (![1, 3, 6, 12, 24].includes(months)) {
 			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
 		}
-		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
+		const boundary = new Date(Date.now() - months * 30 / 24 * 60 * 60 * 1000).toISOString();
 		// Atomic lease claim, same protocol as cron/analyzeHistory: the UPDATE's
 		// predicate makes concurrent claimants single-winner (TOCTOU-safe), and
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected 1786018340107 to be less than or equal to 1778255845093

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:188:42
 		if (![1, 3, 6, 12, 24].includes(months)) {
 			return fail(400, { scope: 'dryRun', channelId, error: 'dry-run window must be 1, 3, 6, 12, or 24 months' });
 		}
-		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 * 1000).toISOString();
+		const boundary = new Date(Date.now() - months * 30 * 24 * 60 * 60 / 1000).toISOString();
 		// Atomic lease claim, same protocol as cron/analyzeHistory: the UPDATE's
 		// predicate makes concurrent claimants single-winner (TOCTOU-safe), and
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected 1786031831900 to be less than or equal to 1778255844663

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:194:28
 		// it doubles as the tenancy check — another team's channel matches 0
 		// rows and reads as "not found". The lease self-expires if this request
 		// dies mid-preview.
-		const myLease = new Date(Date.now() + 60_000).toISOString();
+		const myLease = new Date(Date.now() - 60_000).toISOString();
 		const claimable = or(isNull(channels.leaseExpiresAt), lt(channels.leaseExpiresAt, new Date().toISOString()));
 		const claimed = await db
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected 1786031780209 to be greater than or equal to 1786031899194

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:201:7
 			.set({ leaseExpiresAt: myLease })
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId), claimable))
 			.returning({ id: channels.id });
-		if (claimed.length === 0) {
+		if (true) {
 			// Distinguish "not your channel" from "currently scanning": the extra
 			// read only happens on the failure path.
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:201:29
 			.set({ leaseExpiresAt: myLease })
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId), claimable))
 			.returning({ id: channels.id });
-		if (claimed.length === 0) {
-			// Distinguish "not your channel" from "currently scanning": the extra
-			// read only happens on the failure path.
-			const existing = await db
-				.select({ id: channels.id })
-				.from(channels)
-				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
-				.get();
-			if (existing) {
-				return fail(409, { scope: 'dryRun', channelId, error: 'This channel is mid-scan — retry in a minute.' });
-			}
-			return fail(404, { scope: 'dryRun', channelId, error: 'channel not found' });
-		}
+		if (claimed.length === 0) {}
 		// First page synchronously (one page, hard 20 s ceiling); a window with
 		// more pages drains one page per cron invocation afterwards. The run
killedBy: dry run rejects a channel owned by another team with 404 and never runs
statusReason: expected ActionFailure{ status: 502, …(1) } to match object { status: 404, data: { …(3) } }

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:209:8
 				.from(channels)
 				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 				.get();
-			if (existing) {
+			if (true) {
 				return fail(409, { scope: 'dryRun', channelId, error: 'This channel is mid-scan — retry in a minute.' });
 			}
killedBy: dry run rejects a channel owned by another team with 404 and never runs
statusReason: expected ActionFailure{ status: 409, …(1) } to match object { status: 404, data: { …(3) } }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:209:18
 				.from(channels)
 				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 				.get();
-			if (existing) {
-				return fail(409, { scope: 'dryRun', channelId, error: 'This channel is mid-scan — retry in a minute.' });
-			}
+			if (existing) {}
 			return fail(404, { scope: 'dryRun', channelId, error: 'channel not found' });
 		}
killedBy: dry run refuses to race a cron run holding the channel lease (409)
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { status: 409, data: { …(3) } }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:210:22
 				.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 				.get();
 			if (existing) {
-				return fail(409, { scope: 'dryRun', channelId, error: 'This channel is mid-scan — retry in a minute.' });
+				return fail(409, {});
 			}
 			return fail(404, { scope: 'dryRun', channelId, error: 'channel not found' });
killedBy: dry run refuses to race a cron run holding the channel lease (409)
statusReason: expected ActionFailure{ status: 409, data: {} } to match object { status: 409, data: { …(3) } }

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:212:58
 			if (existing) {
 				return fail(409, { scope: 'dryRun', channelId, error: 'This channel is mid-scan — retry in a minute.' });
 			}
-			return fail(404, { scope: 'dryRun', channelId, error: 'channel not found' });
+			return fail(404, { scope: 'dryRun', channelId, error: "" });
 		}
 		// First page synchronously (one page, hard 20 s ceiling); a window with
killedBy: dry run rejects a channel owned by another team with 404 and never runs
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { status: 404, data: { …(3) } }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:218:47
 		// more pages drains one page per cron invocation afterwards. The run
 		// writes nothing durable except dry-run audit rows (I8).
 		try {
-			const result = await runChannel(channelId, {
-				deadline: Date.now() + 20_000,
-				forceDryRun: true,
-				window: { boundary, pageToken: null }
-			});
+			const result = await runChannel(channelId, {});
 			// Persist the drain state under the held lease: incomplete windows
 			// hand cron the continuation; complete ones clear any older drain.
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Received:

  1st vi.fn() call:

  [
    "UC1",

[Killed] ArithmeticOperator
routes/(app)/dashboard/+page.server.ts:219:15
 		// writes nothing durable except dry-run audit rows (I8).
 		try {
 			const result = await runChannel(channelId, {
-				deadline: Date.now() + 20_000,
+				deadline: Date.now() - 20_000,
 				forceDryRun: true,
 				window: { boundary, pageToken: null }
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected 1786031822420 to be greater than 1786031842405

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:220:18
 		try {
 			const result = await runChannel(channelId, {
 				deadline: Date.now() + 20_000,
-				forceDryRun: true,
+				forceDryRun: false,
 				window: { boundary, pageToken: null }
 			});
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Received:

  1st vi.fn() call:

  [
    "UC1",

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:221:13
 			const result = await runChannel(channelId, {
 				deadline: Date.now() + 20_000,
 				forceDryRun: true,
-				window: { boundary, pageToken: null }
+				window: {}
 			});
 			// Persist the drain state under the held lease: incomplete windows
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected "vi.fn()" to be called with arguments: [ 'UC1', …(1) ]

Received:

  1st vi.fn() call:

  [
    "UC1",

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:230:23
 			// just abandoned — so any non-skipped, non-complete result restarts
 			// the NEW window from the top in the background. A skipped run
 			// (channel paused) touches nothing.
-			const background = !result.skipped && result.windowComplete !== true;
+			const background = true;
 			if (result.windowComplete === true) {
 				await db
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected { ok: true, scope: 'dryRun', …(11) } to match object { ok: true, scope: 'dryRun', …(7) }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:230:42
 			// just abandoned — so any non-skipped, non-complete result restarts
 			// the NEW window from the top in the background. A skipped run
 			// (channel paused) touches nothing.
-			const background = !result.skipped && result.windowComplete !== true;
+			const background = !result.skipped && result.windowComplete === true;
 			if (result.windowComplete === true) {
 				await db
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected { ok: true, scope: 'dryRun', …(11) } to match object { ok: true, scope: 'dryRun', …(7) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:231:8
 			// the NEW window from the top in the background. A skipped run
 			// (channel paused) touches nothing.
 			const background = !result.skipped && result.windowComplete !== true;
-			if (result.windowComplete === true) {
+			if (true) {
 				await db
 					.update(channels)
killedBy: 'an incomplete window persists the dra…'
statusReason: expected null to be 'page-2' // Object.is equality

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:231:8
 			// the NEW window from the top in the background. A skipped run
 			// (channel paused) touches nothing.
 			const background = !result.skipped && result.windowComplete !== true;
-			if (result.windowComplete === true) {
+			if (result.windowComplete !== true) {
 				await db
 					.update(channels)
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected { …(2) } to deeply equal { boundary: null, pageToken: null }

[Killed] BooleanLiteral
routes/(app)/dashboard/+page.server.ts:236:15
 					.update(channels)
 					.set({ dryRunBoundary: null, dryRunPageToken: null })
 					.where(eq(channels.id, channelId));
-			} else if (!result.skipped) {
+			} else if (result.skipped) {
 				await db
 					.update(channels)
killedBy: 'an incomplete window persists the dra…'
statusReason: expected null to be 'page-2' // Object.is equality

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:236:15
 					.update(channels)
 					.set({ dryRunBoundary: null, dryRunPageToken: null })
 					.where(eq(channels.id, channelId));
-			} else if (!result.skipped) {
+			} else if (false) {
 				await db
 					.update(channels)
killedBy: 'an incomplete window persists the dra…'
statusReason: expected null to be 'page-2' // Object.is equality

[Killed] LogicalOperator
routes/(app)/dashboard/+page.server.ts:239:56
 			} else if (!result.skipped) {
 				await db
 					.update(channels)
-					.set({ dryRunBoundary: boundary, dryRunPageToken: result.windowNextPageToken ?? null })
+					.set({ dryRunBoundary: boundary, dryRunPageToken: result.windowNextPageToken && null })
 					.where(eq(channels.id, channelId));
 			}
killedBy: 'an incomplete window persists the dra…'
statusReason: expected null to be 'page-2' // Object.is equality

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:242:11
 					.set({ dryRunBoundary: boundary, dryRunPageToken: result.windowNextPageToken ?? null })
 					.where(eq(channels.id, channelId));
 			}
-			return { ok: true as const, scope: 'dryRun', channelId, months, ...result, background };
+			return {};
 		} catch (e) {
 			// Loud server-side, generic client-side — never return raw
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected {} to match object { ok: true, scope: 'dryRun', …(7) }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:243:15
 					.where(eq(channels.id, channelId));
 			}
 			return { ok: true as const, scope: 'dryRun', channelId, months, ...result, background };
-		} catch (e) {
-			// Loud server-side, generic client-side — never return raw
-			// YouTube/OpenAI error detail to the browser.
-			console.error('dry run failed for channel:', channelId, e);
-			return fail(502, { scope: 'dryRun', channelId, error: 'The dry run failed — check the server log and try again.' });
-		} finally {
+		} catch (e) {} finally {
 			// Release only OUR lease: if the preview overran it and cron claimed
 			// the channel in between, that lease is untouched. lastRunAt is
killedBy: a failed dry run is loud on the server and a generic 502 to the client
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:247:30
 			// Loud server-side, generic client-side — never return raw
 			// YouTube/OpenAI error detail to the browser.
 			console.error('dry run failed for channel:', channelId, e);
-			return fail(502, { scope: 'dryRun', channelId, error: 'The dry run failed — check the server log and try again.' });
+			return fail(502, { scope: "", channelId, error: 'The dry run failed — check the server log and try again.' });
 		} finally {
 			// Release only OUR lease: if the preview overran it and cron claimed
killedBy: a failed dry run is loud on the server and a generic 502 to the client
statusReason: expected { scope: '', channelId: 'UC1', …(1) } to deeply equal { scope: 'dryRun', …(2) }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:247:21
 			// Loud server-side, generic client-side — never return raw
 			// YouTube/OpenAI error detail to the browser.
 			console.error('dry run failed for channel:', channelId, e);
-			return fail(502, { scope: 'dryRun', channelId, error: 'The dry run failed — check the server log and try again.' });
+			return fail(502, {});
 		} finally {
 			// Release only OUR lease: if the preview overran it and cron claimed
killedBy: a failed dry run is loud on the server and a generic 502 to the client
statusReason: expected {} to deeply equal { scope: 'dryRun', …(2) }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:248:13
 			// YouTube/OpenAI error detail to the browser.
 			console.error('dry run failed for channel:', channelId, e);
 			return fail(502, { scope: 'dryRun', channelId, error: 'The dry run failed — check the server log and try again.' });
-		} finally {
-			// Release only OUR lease: if the preview overran it and cron claimed
-			// the channel in between, that lease is untouched. lastRunAt is
-			// deliberately not set — a preview is not a run.
-			await db
-				.update(channels)
-				.set({ leaseExpiresAt: null })
-				.where(and(eq(channels.id, channelId), eq(channels.leaseExpiresAt, myLease)));
-		}
+		} finally {}
 	},
 	deleteAccount: async ({ request, locals, cookies }) => {
killedBy: dry run previews a live deployment through runChannel and echoes the counts
statusReason: expected '2026-08-06T15:58:25.841Z' to be null

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:261:7
 	deleteAccount: async ({ request, locals, cookies }) => {
 		const user = requireUser(locals);
 		const f = await request.formData();
-		if (f.get('confirm') !== 'on') {
+		if (f.get('confirm') === 'on') {
 			return fail(400, { error: 'You must confirm account deletion to continue.' });
 		}
killedBy: delete account without the confirmation checkbox writes nothing
statusReason: expected Redirect{ status: 302, location: '/' } to match object { status: 400, …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:261:34
 	deleteAccount: async ({ request, locals, cookies }) => {
 		const user = requireUser(locals);
 		const f = await request.formData();
-		if (f.get('confirm') !== 'on') {
-			return fail(400, { error: 'You must confirm account deletion to continue.' });
-		}
+		if (f.get('confirm') !== 'on') {}
 		// Immediate deletion: everything is erased NOW except the evidentiary
 		// consent log (statutory retention, LGPD Art. 16, III). Each channel's
killedBy: delete account without the confirmation checkbox writes nothing
statusReason: expected Redirect{ status: 302, location: '/' } to match object { status: 400, …(1) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:262:21
 		const user = requireUser(locals);
 		const f = await request.formData();
 		if (f.get('confirm') !== 'on') {
-			return fail(400, { error: 'You must confirm account deletion to continue.' });
+			return fail(400, {});
 		}
 		// Immediate deletion: everything is erased NOW except the evidentiary
killedBy: delete account without the confirmation checkbox writes nothing
statusReason: expected ActionFailure{ status: 400, data: {} } to match object { status: 400, …(1) }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:278:27
 			.from(channels)
 			.where(eq(channels.userId, user.id))
 			.all();
-		for (const ch of owned) {
-			try {
-				await revokeGoogleToken(decrypt(ch.refreshTokenEnc), `account deletion channel ${ch.id}`);
-			} catch (cause) {
-				console.error(`token revocation failed for channel ${ch.id}; deleting anyway:`, cause);
-			}
-		}
+		for (const ch of owned) {}
 		await deleteUserRecords(user.id);
 		cookies.delete(SESSION_COOKIE, { path: '/' });
killedBy: delete account revokes each channel at Google, erases everything, and signs out
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc' ]

Number of calls: 0

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:279:8
 			.where(eq(channels.userId, user.id))
 			.all();
 		for (const ch of owned) {
-			try {
-				await revokeGoogleToken(decrypt(ch.refreshTokenEnc), `account deletion channel ${ch.id}`);
-			} catch (cause) {
+			try {} catch (cause) {
 				console.error(`token revocation failed for channel ${ch.id}; deleting anyway:`, cause);
 			}
killedBy: delete account revokes each channel at Google, erases everything, and signs out
statusReason: expected "vi.fn()" to be called with arguments: [ 'enc' ]

Number of calls: 0

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:281:20
 		for (const ch of owned) {
 			try {
 				await revokeGoogleToken(decrypt(ch.refreshTokenEnc), `account deletion channel ${ch.id}`);
-			} catch (cause) {
-				console.error(`token revocation failed for channel ${ch.id}; deleting anyway:`, cause);
-			}
+			} catch (cause) {}
 		}
 		await deleteUserRecords(user.id);
killedBy: a revocation failure on one channel does not stop the others
statusReason: expected "error" to be called with arguments: [ StringContaining "UC1", Anything ]

Received:

  1st error call:

  [
-   StringContaining "UC1",

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:282:19
 			try {
 				await revokeGoogleToken(decrypt(ch.refreshTokenEnc), `account deletion channel ${ch.id}`);
 			} catch (cause) {
-				console.error(`token revocation failed for channel ${ch.id}; deleting anyway:`, cause);
+				console.error(``, cause);
 			}
 		}
killedBy: a revocation failure on one channel does not stop the others
statusReason: expected "error" to be called with arguments: [ StringContaining "UC1", Anything ]

Received:

  1st error call:

  [
-   StringContaining "UC1",

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:286:42
 			}
 		}
 		await deleteUserRecords(user.id);
-		cookies.delete(SESSION_COOKIE, { path: '/' });
+		cookies.delete(SESSION_COOKIE, { path: "" });
 		throw redirect(302, '/');
 	},
killedBy: delete account revokes each channel at Google, erases everything, and signs out
statusReason: expected [ { name: 'moderaty_session', …(1) } ] to deep equally contain { name: 'moderaty_session', …(1) }

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:295:34
 		requireOrgRole(user, 'admin');
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
-		if (f.get('confirm') !== 'on') {
-			return fail(400, { scope: 'disconnect', channelId, error: 'You must confirm the disconnect to continue.' });
-		}
+		if (f.get('confirm') !== 'on') {}
 		// Tenancy check doubles as the existence check: another team's channel
 		// matches 0 rows and reads as "not found" — never leak existence.
killedBy: disconnect requires the confirmation checkbox — 400, nothing deleted, no revoke
statusReason: expected { ok: true, scope: 'disconnect', …(1) } to match object { status: 400, data: { …(2) } }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
routes/(app)/dashboard/+page.server.ts:295:7
 		requireOrgRole(user, 'admin');
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
-		if (f.get('confirm') !== 'on') {
+		if (f.get('confirm') === 'on') {
 			return fail(400, { scope: 'disconnect', channelId, error: 'You must confirm the disconnect to continue.' });
 		}
killedBy: disconnect requires the confirmation checkbox — 400, nothing deleted, no revoke
statusReason: expected { ok: true, scope: 'disconnect', …(1) } to match object { status: 400, data: { …(2) } }
(3 matching properties omitted from actual)

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:296:21
 		const f = await request.formData();
 		const channelId = String(f.get('channelId') ?? '');
 		if (f.get('confirm') !== 'on') {
-			return fail(400, { scope: 'disconnect', channelId, error: 'You must confirm the disconnect to continue.' });
+			return fail(400, {});
 		}
 		// Tenancy check doubles as the existence check: another team's channel
killedBy: disconnect requires the confirmation checkbox — 400, nothing deleted, no revoke
statusReason: expected ActionFailure{ status: 400, data: {} } to match object { status: 400, data: { …(2) } }

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:301:12
 		// Tenancy check doubles as the existence check: another team's channel
 		// matches 0 rows and reads as "not found" — never leak existence.
 		const channel = await db
-			.select({ id: channels.id, refreshTokenEnc: channels.refreshTokenEnc })
+			.select({})
 			.from(channels)
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
killedBy: disconnect reads another team's channel as 404 and touches nothing
statusReason: Failed query: select  from "channels" where ("channels"."id" = ? and "channels"."org_id" = ?)
params: UC1,org-1

[Killed] ConditionalExpression
routes/(app)/dashboard/+page.server.ts:305:7
 			.from(channels)
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 			.get();
-		if (!channel) {
+		if (true) {
 			return fail(404, { scope: 'disconnect', channelId, error: 'channel not found' });
 		}
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected ActionFailure{ status: 404, …(1) } to match object { ok: true, scope: 'disconnect', …(1) }
(5 matching properties omitted from actual)

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:305:17
 			.from(channels)
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 			.get();
-		if (!channel) {
-			return fail(404, { scope: 'disconnect', channelId, error: 'channel not found' });
-		}
+		if (!channel) {}
 		// Best-effort revoke BEFORE the erase (YouTube API ToS); a failure —
 		// including a grant minted by another environment's OAuth client, or an
killedBy: disconnect reads another team's channel as 404 and touches nothing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
routes/(app)/dashboard/+page.server.ts:306:21
 			.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 			.get();
 		if (!channel) {
-			return fail(404, { scope: 'disconnect', channelId, error: 'channel not found' });
+			return fail(404, {});
 		}
 		// Best-effort revoke BEFORE the erase (YouTube API ToS); a failure —
killedBy: disconnect reads another team's channel as 404 and touches nothing
statusReason: expected ActionFailure{ status: 404, data: {} } to match object { status: 404, data: { …(2) } }
