[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:312:7
 		// including a grant minted by another environment's OAuth client, or an
 		// already-wiped token — is logged loudly but never blocks, since the
 		// ciphertext dies either way.
-		try {
-			await revokeGoogleToken(decrypt(channel.refreshTokenEnc), `channel disconnect ${channel.id}`);
-		} catch (cause) {
+		try {} catch (cause) {
 			console.error(`token revocation failed for channel ${channel.id}; disconnecting anyway:`, cause);
 		}
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:314:19
 		// ciphertext dies either way.
 		try {
 			await revokeGoogleToken(decrypt(channel.refreshTokenEnc), `channel disconnect ${channel.id}`);
-		} catch (cause) {
-			console.error(`token revocation failed for channel ${channel.id}; disconnecting anyway:`, cause);
-		}
+		} catch (cause) {}
 		await db.transaction(async (tx) => {
 			await deleteChannelRecords(tx, [channel.id], { expectedOrgId: user.orgId });
killedBy: a failed revocation is logged loudly and never blocks the erase
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "token revocation failed for channel UC1; disconnecting anyway:",

[Killed] BlockStatement
routes/(app)/dashboard/+page.server.ts:317:38
 		} catch (cause) {
 			console.error(`token revocation failed for channel ${channel.id}; disconnecting anyway:`, cause);
 		}
-		await db.transaction(async (tx) => {
-			await deleteChannelRecords(tx, [channel.id], { expectedOrgId: user.orgId });
-		});
+		await db.transaction(async (tx) => {});
 		// The channel's own audit rows die with it — the server log is the record.
 		console.info(`channel ${channel.id} disconnected and erased by user ${user.id}`);
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected { channel: 1, rules: 1, …(3) } to deeply equal { channel: +0, rules: +0, …(3) }

[Killed] StringLiteral
routes/(app)/dashboard/+page.server.ts:322:38
 		});
 		// The channel's own audit rows die with it — the server log is the record.
 		console.info(`channel ${channel.id} disconnected and erased by user ${user.id}`);
-		return { ok: true as const, scope: 'disconnect', channelId };
+		return { ok: true as const, scope: "", channelId };
 	}
 };
killedBy: disconnect revokes the grant at Google, then erases the channel and every row it owns
statusReason: expected { ok: true, scope: '', …(1) } to match object { ok: true, scope: 'disconnect', …(1) }
