[Killed] BlockStatement
src/routes/connect-channel/+page.server.ts:31:73
 
 import type { Actions, PageServerLoad } from './$types';
 
-export const load: PageServerLoad = async ({ cookies, url, locals }) => {
-	// Same gate as the OAuth callback that parks the pick: signed-in admin+ of
-	// the active team. Members moderate; they don't connect channels.
-	const user = requireUser(locals);
-	requireOrgRole(user, 'admin');
-
-	const state = url.searchParams.get('state');
-	if (!state) throw error(400, 'missing state — restart the channel connection from the dashboard');
-	const pending = readPendingChannelPick(cookies, state);
-	if (!pending) {
-		throw error(400, 'this channel selection expired — reconnect the channel from the dashboard');
-	}
-	// Only the candidate list reaches the browser — the parked refresh token
-	// never leaves the encrypted cookie until a channel is chosen.
-	return { channels: pending.channels };
-};
+export const load: PageServerLoad = async ({ cookies, url, locals }) => {};
 
 export const actions: Actions = {
killedBy: load without a state param fails loudly with 400
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/routes/connect-channel/+page.server.ts:38:6
 	requireOrgRole(user, 'admin');
 
 	const state = url.searchParams.get('state');
-	if (!state) throw error(400, 'missing state — restart the channel connection from the dashboard');
+	if (state) throw error(400, 'missing state — restart the channel connection from the dashboard');
 	const pending = readPendingChannelPick(cookies, state);
 	if (!pending) {
killedBy: load without a state param fails loudly with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ConditionalExpression
src/routes/connect-channel/+page.server.ts:38:6
 	requireOrgRole(user, 'admin');
 
 	const state = url.searchParams.get('state');
-	if (!state) throw error(400, 'missing state — restart the channel connection from the dashboard');
+	if (false) throw error(400, 'missing state — restart the channel connection from the dashboard');
 	const pending = readPendingChannelPick(cookies, state);
 	if (!pending) {
killedBy: load without a state param fails loudly with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ConditionalExpression
src/routes/connect-channel/+page.server.ts:40:6
 	const state = url.searchParams.get('state');
 	if (!state) throw error(400, 'missing state — restart the channel connection from the dashboard');
 	const pending = readPendingChannelPick(cookies, state);
-	if (!pending) {
+	if (false) {
 		throw error(400, 'this channel selection expired — reconnect the channel from the dashboard');
 	}
killedBy: load without a parked pick fails loudly with 400
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 400, …(1) }

[Killed] BooleanLiteral
src/routes/connect-channel/+page.server.ts:40:6
 	const state = url.searchParams.get('state');
 	if (!state) throw error(400, 'missing state — restart the channel connection from the dashboard');
 	const pending = readPendingChannelPick(cookies, state);
-	if (!pending) {
+	if (pending) {
 		throw error(400, 'this channel selection expired — reconnect the channel from the dashboard');
 	}
killedBy: load without a parked pick fails loudly with 400
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 400, …(1) }

[Killed] StringLiteral
src/routes/connect-channel/+page.server.ts:53:38
 		const user = requireUser(locals);
 		requireOrgRole(user, 'admin');
 
-		const state = url.searchParams.get('state');
+		const state = url.searchParams.get("");
 		const pending = state ? readPendingChannelPick(cookies, state) : null;
 		if (!pending) {
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/routes/connect-channel/+page.server.ts:55:7
 
 		const state = url.searchParams.get('state');
 		const pending = state ? readPendingChannelPick(cookies, state) : null;
-		if (!pending) {
+		if (pending) {
 			return fail(400, { error: 'This channel selection expired — reconnect the channel from the dashboard.' });
 		}
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/routes/connect-channel/+page.server.ts:55:17
 
 		const state = url.searchParams.get('state');
 		const pending = state ? readPendingChannelPick(cookies, state) : null;
-		if (!pending) {
-			return fail(400, { error: 'This channel selection expired — reconnect the channel from the dashboard.' });
-		}
+		if (!pending) {}
 
 		const form = await request.formData();
killedBy: a replayed state after a successful pick fails loudly with 400
statusReason: expected TypeError: Cannot read properties of null… to match object { status: 400, …(1) }

[Killed] ObjectLiteral
src/routes/connect-channel/+page.server.ts:56:21
 		const state = url.searchParams.get('state');
 		const pending = state ? readPendingChannelPick(cookies, state) : null;
 		if (!pending) {
-			return fail(400, { error: 'This channel selection expired — reconnect the channel from the dashboard.' });
+			return fail(400, {});
 		}
 
killedBy: a replayed state after a successful pick fails loudly with 400
statusReason: expected ActionFailure{ status: 400, data: {} } to match object { status: 400, …(1) }

[Killed] StringLiteral
src/routes/connect-channel/+page.server.ts:56:30
 		const state = url.searchParams.get('state');
 		const pending = state ? readPendingChannelPick(cookies, state) : null;
 		if (!pending) {
-			return fail(400, { error: 'This channel selection expired — reconnect the channel from the dashboard.' });
+			return fail(400, { error: "" });
 		}
 
killedBy: a replayed state after a successful pick fails loudly with 400
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 400, …(1) }

[Killed] StringLiteral
src/routes/connect-channel/+page.server.ts:60:27
 		}
 
 		const form = await request.formData();
-		const chosen = form.get('channel');
+		const chosen = form.get("");
 		// The choice must be one of the channels Google's callback parked —
 		// anything else is tampering and fails loudly.
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/routes/connect-channel/+page.server.ts:64:70
 		// The choice must be one of the channels Google's callback parked —
 		// anything else is tampering and fails loudly.
-		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id === chosen) : undefined;
+		const channel = typeof chosen === 'string' ? pending.channels.find(() => undefined) : undefined;
 		if (!channel) {
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/routes/connect-channel/+page.server.ts:64:77
 		// The choice must be one of the channels Google's callback parked —
 		// anything else is tampering and fails loudly.
-		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id === chosen) : undefined;
+		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id !== chosen) : undefined;
 		if (!channel) {
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected { id: 'UC1', userId: 'user-1', …(17) } to match object { id: 'UC2', userId: 'user-1', …(3) }
(14 matching properties omitted from actual)

[Killed] ConditionalExpression
src/routes/connect-channel/+page.server.ts:65:7
 		// anything else is tampering and fails loudly.
 		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id === chosen) : undefined;
-		if (!channel) {
+		if (false) {
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
 		}
killedBy: a channel id that was never parked fails loudly with 400 and writes nothing
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 400, …(1) }

[Killed] BooleanLiteral
src/routes/connect-channel/+page.server.ts:65:7
 		// anything else is tampering and fails loudly.
 		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id === chosen) : undefined;
-		if (!channel) {
+		if (channel) {
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
 		}
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 400, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/routes/connect-channel/+page.server.ts:66:21
 		const channel = typeof chosen === 'string' ? pending.channels.find((c) => c.id === chosen) : undefined;
 		if (!channel) {
-			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
+			return fail(400, {});
 		}
 
killedBy: a channel id that was never parked fails loudly with 400 and writes nothing
statusReason: expected ActionFailure{ status: 400, data: {} } to match object { status: 400, …(1) }

[Killed] BlockStatement
src/routes/connect-channel/+page.server.ts:69:92
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
 		}
 
-		if ((await upsertChannelConnection(user, channel, pending.refreshToken)) === 'conflict') {
-			return fail(409, { error: 'This channel is connected to a different Moderaty team.' });
-		}
+		if ((await upsertChannelConnection(user, channel, pending.refreshToken)) === 'conflict') {}
 
 		// Consumed on success only: a transient failure leaves the pick
killedBy: a parked channel owned by another team yields 409 and stays unchanged
statusReason: expected Redirect{ status: 302, …(1) } to match object { status: 409, …(1) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/routes/connect-channel/+page.server.ts:69:7
 			return fail(400, { error: 'Unknown channel — pick one of the listed channels.' });
 		}
 
-		if ((await upsertChannelConnection(user, channel, pending.refreshToken)) === 'conflict') {
+		if (true) {
 			return fail(409, { error: 'This channel is connected to a different Moderaty team.' });
 		}
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected ActionFailure{ status: 409, …(1) } to match object { status: 302, location: '/dashboard' }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/routes/connect-channel/+page.server.ts:76:23
 		// Consumed on success only: a transient failure leaves the pick
 		// retryable while a success cannot be replayed.
 		clearPendingChannelPick(cookies, state as string);
-		throw redirect(302, '/dashboard');
+		throw redirect(302, "");
 	}
 };
killedBy: choosing a parked channel connects it, encrypts the token, and consumes the state
statusReason: expected Redirect{ status: 302, location: '' } to match object { status: 302, location: '/dashboard' }
