[Killed] BlockStatement
routes/invite/[token]/+page.server.ts:29:67
 // Public invite landing. Unknown tokens are a plain 404 — never leak which
 // tokens exist. Logged-out visitors are asked to sign in and come back to
 // this same URL (invites stay valid for 7 days).
-export const load: PageServerLoad = async ({ params, locals }) => {
-	const invite = await previewInvite(params.token);
-	if (!invite) throw error(404, 'invite not found');
-	return { invite, signedIn: locals.user !== null };
-};
+export const load: PageServerLoad = async ({ params, locals }) => {};
 
 export const actions: Actions = {
killedBy: load: unknown token is a plain 404
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
routes/invite/[token]/+page.server.ts:31:6
 // this same URL (invites stay valid for 7 days).
 export const load: PageServerLoad = async ({ params, locals }) => {
 	const invite = await previewInvite(params.token);
-	if (!invite) throw error(404, 'invite not found');
+	if (false) throw error(404, 'invite not found');
 	return { invite, signedIn: locals.user !== null };
 };
killedBy: load: unknown token is a plain 404
statusReason: promise resolved "{ invite: null, signedIn: true }" instead of rejecting

[Killed] BooleanLiteral
routes/invite/[token]/+page.server.ts:31:6
 // this same URL (invites stay valid for 7 days).
 export const load: PageServerLoad = async ({ params, locals }) => {
 	const invite = await previewInvite(params.token);
-	if (!invite) throw error(404, 'invite not found');
+	if (invite) throw error(404, 'invite not found');
 	return { invite, signedIn: locals.user !== null };
 };
killedBy: load: unknown token is a plain 404
statusReason: promise resolved "{ invite: null, signedIn: true }" instead of rejecting

[Killed] ConditionalExpression
routes/invite/[token]/+page.server.ts:32:29
 export const load: PageServerLoad = async ({ params, locals }) => {
 	const invite = await previewInvite(params.token);
 	if (!invite) throw error(404, 'invite not found');
-	return { invite, signedIn: locals.user !== null };
+	return { invite, signedIn: true };
 };
 
killedBy: load: known token returns the preview and the signed-in flag
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/invite/[token]/+page.server.ts:32:29
 export const load: PageServerLoad = async ({ params, locals }) => {
 	const invite = await previewInvite(params.token);
 	if (!invite) throw error(404, 'invite not found');
-	return { invite, signedIn: locals.user !== null };
+	return { invite, signedIn: false };
 };
 
killedBy: load: known token returns the preview and the signed-in flag
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/invite/[token]/+page.server.ts:36:50
 };
 
 export const actions: Actions = {
-	default: async ({ params, locals, cookies }) => {
-		const user = requireUser(locals);
-		const token = cookies.get(SESSION_COOKIE);
-		if (!token) throw error(401, 'sign-in required');
-		await acceptInvite(user.id, token, params.token);
-		throw redirect(303, '/dashboard');
-	}
+	default: async ({ params, locals, cookies }) => {}
 };
 
killedBy: accept: signed-out is 401, missing session cookie is 401
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
routes/invite/[token]/+page.server.ts:39:7
 	default: async ({ params, locals, cookies }) => {
 		const user = requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
-		if (!token) throw error(401, 'sign-in required');
+		if (false) throw error(401, 'sign-in required');
 		await acceptInvite(user.id, token, params.token);
 		throw redirect(303, '/dashboard');
killedBy: accept: signed-out is 401, missing session cookie is 401
statusReason: expected Error: Failed query: insert into "members… { …(2) } to match object { status: 401, …(1) }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
routes/invite/[token]/+page.server.ts:39:7
 	default: async ({ params, locals, cookies }) => {
 		const user = requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
-		if (!token) throw error(401, 'sign-in required');
+		if (true) throw error(401, 'sign-in required');
 		await acceptInvite(user.id, token, params.token);
 		throw redirect(303, '/dashboard');
killedBy: accept: joins the org, burns the token, 303s to the dashboard; reuse is 410
statusReason: expected { Object (status, body) } to match object { status: 303, location: '/dashboard' }
(2 matching properties omitted from actual)
