[Killed] BlockStatement
src/routes/logout/+page.server.ts:25:43
 
 import type { PageServerLoad, Actions } from './$types';
 
-export const load: PageServerLoad = () => {
-	throw redirect(302, '/login');
-};
+export const load: PageServerLoad = () => {};
 
 export const actions: Actions = {
killedBy: GET /logout always redirects to the login page
statusReason: expected undefined to match object { status: 302, location: '/login' }

[Killed] StringLiteral
src/routes/logout/+page.server.ts:26:22
 import type { PageServerLoad, Actions } from './$types';
 
 export const load: PageServerLoad = () => {
-	throw redirect(302, '/login');
+	throw redirect(302, "");
 };
 
killedBy: GET /logout always redirects to the login page
statusReason: expected Redirect{ status: 302, location: '' } to match object { status: 302, location: '/login' }

[Killed] BlockStatement
src/routes/logout/+page.server.ts:30:42
 };
 
 export const actions: Actions = {
-	default: async ({ cookies, locals }) => {
-		// Outage: identity cannot be resolved (locals.user is null), so
-		// requireUser would 401 and strand the cookie with no recovery path.
-		// The user asked to sign out — let them: clear the cookie so the
-		// browser forgets the session. The row sweep is best-effort (the DB is
-		// down; the sliding expiry reaps it later), loud on the server.
-		if (!locals.dbDown) requireUser(locals);
-		const token = cookies.get(SESSION_COOKIE);
-		if (token) {
-			try {
-				await destroySession(token);
-			} catch (e) {
-				if (!locals.dbDown) throw e;
-				console.error('logout during outage could not destroy the session row:', e);
-			}
-		}
-		cookies.delete(SESSION_COOKIE, { path: '/' });
-		throw redirect(302, '/login');
-	}
+	default: async ({ cookies, locals }) => {}
 };
 
killedBy: logout rejects a signed-out request with 401 and leaves cookies alone
statusReason: expected undefined to be 401 // Object.is equality

[Killed] ConditionalExpression
src/routes/logout/+page.server.ts:36:7
 		// The user asked to sign out — let them: clear the cookie so the
 		// browser forgets the session. The row sweep is best-effort (the DB is
 		// down; the sliding expiry reaps it later), loud on the server.
-		if (!locals.dbDown) requireUser(locals);
+		if (true) requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
 		if (token) {
killedBy: logout during a database outage clears the cookie and redirects — never a 401
statusReason: expected { Object (status, body) } to match object { status: 302, location: '/login' }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/routes/logout/+page.server.ts:36:7
 		// The user asked to sign out — let them: clear the cookie so the
 		// browser forgets the session. The row sweep is best-effort (the DB is
 		// down; the sliding expiry reaps it later), loud on the server.
-		if (!locals.dbDown) requireUser(locals);
+		if (locals.dbDown) requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
 		if (token) {
killedBy: logout rejects a signed-out request with 401 and leaves cookies alone
statusReason: expected 302 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/routes/logout/+page.server.ts:38:7
 		// down; the sliding expiry reaps it later), loud on the server.
 		if (!locals.dbDown) requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
-		if (token) {
+		if (false) {
 			try {
 				await destroySession(token);
killedBy: logout destroys the session row and clears the cookie
statusReason: expected [ { …(5) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/routes/logout/+page.server.ts:38:7
 		// down; the sliding expiry reaps it later), loud on the server.
 		if (!locals.dbDown) requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
-		if (token) {
+		if (true) {
 			try {
 				await destroySession(token);
killedBy: logout with no session cookie clears and redirects without a session sweep
statusReason: expected Error: Failed query: delete from "session… { …(2) } to match object { status: 302, location: '/login' }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/routes/logout/+page.server.ts:39:8
 		if (!locals.dbDown) requireUser(locals);
 		const token = cookies.get(SESSION_COOKIE);
 		if (token) {
-			try {
-				await destroySession(token);
-			} catch (e) {
+			try {} catch (e) {
 				if (!locals.dbDown) throw e;
 				console.error('logout during outage could not destroy the session row:', e);
killedBy: logout destroys the session row and clears the cookie
statusReason: expected [ { …(5) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/routes/logout/+page.server.ts:41:16
 		if (token) {
 			try {
 				await destroySession(token);
-			} catch (e) {
-				if (!locals.dbDown) throw e;
-				console.error('logout during outage could not destroy the session row:', e);
-			}
+			} catch (e) {}
 		}
 		cookies.delete(SESSION_COOKIE, { path: '/' });
killedBy: logout rethrows a session sweep failure outside an outage — cookie stays, no redirect
statusReason: expected Redirect{ status: 302, …(1) } to be an instance of Error

[Killed] ConditionalExpression
src/routes/logout/+page.server.ts:42:9
 			try {
 				await destroySession(token);
 			} catch (e) {
-				if (!locals.dbDown) throw e;
+				if (true) throw e;
 				console.error('logout during outage could not destroy the session row:', e);
 			}
killedBy: logout during an outage swallows a session sweep failure — loudly — and still signs out
statusReason: expected Error: Failed query: delete from "session… { …(2) } to match object { status: 302, location: '/login' }
(7 matching properties omitted from actual)

[Killed] BooleanLiteral
src/routes/logout/+page.server.ts:42:9
 			try {
 				await destroySession(token);
 			} catch (e) {
-				if (!locals.dbDown) throw e;
+				if (locals.dbDown) throw e;
 				console.error('logout during outage could not destroy the session row:', e);
 			}
killedBy: logout rethrows a session sweep failure outside an outage — cookie stays, no redirect
statusReason: expected Redirect{ status: 302, …(1) } to be an instance of Error

[Killed] StringLiteral
src/routes/logout/+page.server.ts:47:23
 			}
 		}
 		cookies.delete(SESSION_COOKIE, { path: '/' });
-		throw redirect(302, '/login');
+		throw redirect(302, "");
 	}
 };
killedBy: logout during a database outage clears the cookie and redirects — never a 401
statusReason: expected Redirect{ status: 302, location: '' } to match object { status: 302, location: '/login' }
