[Killed] BlockStatement
src/lib/landing/json-ld.ts:25:46
  * while making it impossible to close the script element (</script>) or
  * open an HTML comment (<!--) from inside a string value.
  */
-export function jsonLd(data: object): string {
-	const json = JSON.stringify(data).replace(/</g, '\\u003c');
-	return '<' + 'script type="application/ld+json">' + json + '</' + 'script>';
-}
+export function jsonLd(data: object): string {}
 
killedBy: jsonLd script-tag safety escapes </script> breakouts in string values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
