[Killed] BlockStatement
lib/server/db/index.ts:30:52
 // Validation still fails loudly — just at handler start (first DB access).
 let instance: LibSQLDatabase<typeof schema> | undefined;
 
-function createDb(): LibSQLDatabase<typeof schema> {
-	const databaseUrl = env.TURSO_DATABASE_URL;
-	const authToken = env.TURSO_AUTH_TOKEN;
-
-	if (!databaseUrl) {
-		throw new Error('TURSO_DATABASE_URL is required');
-	}
-	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
-	if (!isLocalUrl && !authToken) {
-		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
-	}
-
-	const client = createClient({
-		url: databaseUrl,
-		authToken: authToken || undefined
-	});
-
-	return drizzle(client, { schema });
-}
+function createDb(): LibSQLDatabase<typeof schema> {}
 
 export const db = new Proxy({} as LibSQLDatabase<typeof schema>, {
killedBy: db module imports without env vars; first use throws loudly
statusReason: expected [Function] to throw error matching /TURSO_DATABASE_URL is required/ but got 'Reflect.get called on non-object'

[Killed] ConditionalExpression
lib/server/db/index.ts:34:6
 	const databaseUrl = env.TURSO_DATABASE_URL;
 	const authToken = env.TURSO_AUTH_TOKEN;
 
-	if (!databaseUrl) {
+	if (true) {
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
killedBy: remote URL without auth token throws loudly at first use
statusReason: expected [Function] to throw error matching /TURSO_AUTH_TOKEN is required/ but got 'TURSO_DATABASE_URL is required'

[Killed] BooleanLiteral
lib/server/db/index.ts:34:6
 	const databaseUrl = env.TURSO_DATABASE_URL;
 	const authToken = env.TURSO_AUTH_TOKEN;
 
-	if (!databaseUrl) {
+	if (databaseUrl) {
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
killedBy: db module imports without env vars; first use throws loudly
statusReason: expected [Function] to throw error matching /TURSO_DATABASE_URL is required/ but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
lib/server/db/index.ts:37:21
 	if (!databaseUrl) {
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
-	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
+	const isLocalUrl = databaseUrl !== ':memory:' || databaseUrl.startsWith('file:');
 	if (!isLocalUrl && !authToken) {
 		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
killedBy: remote URL without auth token throws loudly at first use
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
lib/server/db/index.ts:37:21
 	if (!databaseUrl) {
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
-	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
+	const isLocalUrl = true;
 	if (!isLocalUrl && !authToken) {
 		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
killedBy: remote URL without auth token throws loudly at first use
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
lib/server/db/index.ts:38:6
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
 	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
-	if (!isLocalUrl && !authToken) {
+	if (!isLocalUrl || !authToken) {
 		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
 	}
killedBy: local database URL needs no token and works at first use
statusReason: expected [Function] to not throw an error but 'Error: TURSO_AUTH_TOKEN is required f…' was thrown

[Killed] ConditionalExpression
lib/server/db/index.ts:38:6
 		throw new Error('TURSO_DATABASE_URL is required');
 	}
 	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
-	if (!isLocalUrl && !authToken) {
+	if (false) {
 		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
 	}
killedBy: remote URL without auth token throws loudly at first use
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
lib/server/db/index.ts:39:19
 	}
 	const isLocalUrl = databaseUrl === ':memory:' || databaseUrl.startsWith('file:');
 	if (!isLocalUrl && !authToken) {
-		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
+		throw new Error("");
 	}
 
killedBy: remote URL without auth token throws loudly at first use
statusReason: expected [Function] to throw error matching /TURSO_AUTH_TOKEN is required/ but got ''

[Killed] ObjectLiteral
lib/server/db/index.ts:42:30
 		throw new Error('TURSO_AUTH_TOKEN is required for remote databases');
 	}
 
-	const client = createClient({
-		url: databaseUrl,
-		authToken: authToken || undefined
-	});
+	const client = createClient({});
 
 	return drizzle(client, { schema });
killedBy: local database URL needs no token and works at first use
statusReason: expected [Function] to not throw an error but 'LibsqlError: URL_INVALID: The URL \'u…' was thrown

[Killed] ConditionalExpression
lib/server/db/index.ts:44:14
 
 	const client = createClient({
 		url: databaseUrl,
-		authToken: authToken || undefined
+		authToken: false
 	});
 
killedBy: file: URL is treated as local and needs no token
statusReason: expected [Function] to not throw an error but 'TypeError: failed to downcast any to …' was thrown

[Killed] LogicalOperator
lib/server/db/index.ts:44:14
 
 	const client = createClient({
 		url: databaseUrl,
-		authToken: authToken || undefined
+		authToken: authToken && undefined
 	});
 
killedBy: createClient receives the provided authToken unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ { url: ':memory:', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ObjectLiteral
lib/server/db/index.ts:47:25
 		authToken: authToken || undefined
 	});
 
-	return drizzle(client, { schema });
+	return drizzle(client, {});
 }
 
killedBy: drizzle is created with the schema (db.query table API available)
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
lib/server/db/index.ts:50:66
 	return drizzle(client, { schema });
 }
 
-export const db = new Proxy({} as LibSQLDatabase<typeof schema>, {
-	get(_target, property) {
-		const real = (instance ??= createDb());
-		const value = Reflect.get(real, property);
-		return typeof value === 'function' ? value.bind(real) : value;
-	}
-});
+export const db = new Proxy({} as LibSQLDatabase<typeof schema>, {});
 
killedBy: db module imports without env vars; first use throws loudly
statusReason: expected [Function] to throw error matching /TURSO_DATABASE_URL is required/ but got 'mod.db.select is not a function'

[Killed] BlockStatement
lib/server/db/index.ts:51:25
 }
 
 export const db = new Proxy({} as LibSQLDatabase<typeof schema>, {
-	get(_target, property) {
-		const real = (instance ??= createDb());
-		const value = Reflect.get(real, property);
-		return typeof value === 'function' ? value.bind(real) : value;
-	}
+	get(_target, property) {}
 });
 
killedBy: db module imports without env vars; first use throws loudly
statusReason: expected [Function] to throw error matching /TURSO_DATABASE_URL is required/ but got 'mod.db.select is not a function'

[Killed] AssignmentOperator
lib/server/db/index.ts:52:17
 
 export const db = new Proxy({} as LibSQLDatabase<typeof schema>, {
 	get(_target, property) {
-		const real = (instance ??= createDb());
+		const real = (instance &&= createDb());
 		const value = Reflect.get(real, property);
 		return typeof value === 'function' ? value.bind(real) : value;
killedBy: db module imports without env vars; first use throws loudly
statusReason: expected [Function] to throw error matching /TURSO_DATABASE_URL is required/ but got 'Reflect.get called on non-object'

[Killed] ConditionalExpression
lib/server/db/index.ts:54:10
 	get(_target, property) {
 		const real = (instance ??= createDb());
 		const value = Reflect.get(real, property);
-		return typeof value === 'function' ? value.bind(real) : value;
+		return true ? value.bind(real) : value;
 	}
 });
killedBy: drizzle is created with the schema (db.query table API available)
statusReason: value.bind is not a function

[Killed] EqualityOperator
lib/server/db/index.ts:54:10
 	get(_target, property) {
 		const real = (instance ??= createDb());
 		const value = Reflect.get(real, property);
-		return typeof value === 'function' ? value.bind(real) : value;
+		return typeof value !== 'function' ? value.bind(real) : value;
 	}
 });
killedBy: local database URL needs no token and works at first use
statusReason: expected [Function] to not throw an error but 'TypeError: value.bind is not a functi…' was thrown
