[Killed] BlockStatement
src/lib/server/migrationGuard.ts:54:64
  *
  * @throws {HttpError} 503 when migrations are pending; raw database errors propagate
  */
-export async function assertMigrationsCurrent(): Promise<void> {
-	// Prerendered pages also run handle, and the build has no database —
-	// the guard is a runtime deploy-ordering concern, not a build-time one.
-	if (building) return;
-	verificationPromise ??= checkMigrations().catch((e: unknown) => {
-		verificationPromise = null;
-		throw e;
-	});
-	return verificationPromise;
-}
+export async function assertMigrationsCurrent(): Promise<void> {}
 
 async function checkMigrations(): Promise<void> {
killedBy: a database behind the code fails loudly with a 503 and logs the actionable counts
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/server/migrationGuard.ts:57:6
 export async function assertMigrationsCurrent(): Promise<void> {
 	// Prerendered pages also run handle, and the build has no database —
 	// the guard is a runtime deploy-ordering concern, not a build-time one.
-	if (building) return;
+	if (false) return;
 	verificationPromise ??= checkMigrations().catch((e: unknown) => {
 		verificationPromise = null;
killedBy: during prerendering the guard is a no-op — the build has no database
statusReason: promise rejected "HttpError{ status: 503, body: { …(1) } }" instead of resolving

[Killed] ConditionalExpression
src/lib/server/migrationGuard.ts:57:6
 export async function assertMigrationsCurrent(): Promise<void> {
 	// Prerendered pages also run handle, and the build has no database —
 	// the guard is a runtime deploy-ordering concern, not a build-time one.
-	if (building) return;
+	if (true) return;
 	verificationPromise ??= checkMigrations().catch((e: unknown) => {
 		verificationPromise = null;
killedBy: a database behind the code fails loudly with a 503 and logs the actionable counts
statusReason: promise resolved "undefined" instead of rejecting

[Killed] AssignmentOperator
src/lib/server/migrationGuard.ts:58:2
 	// Prerendered pages also run handle, and the build has no database —
 	// the guard is a runtime deploy-ordering concern, not a build-time one.
 	if (building) return;
-	verificationPromise ??= checkMigrations().catch((e: unknown) => {
-		verificationPromise = null;
-		throw e;
-	});
+	verificationPromise &&= checkMigrations().catch((e: unknown) => {
+  verificationPromise = null;
+  throw e;
+});
 	return verificationPromise;
 }
killedBy: a current database passes, and the success is cached for the process
statusReason: expected null to be undefined

[Killed] BlockStatement
src/lib/server/migrationGuard.ts:58:66
 	// Prerendered pages also run handle, and the build has no database —
 	// the guard is a runtime deploy-ordering concern, not a build-time one.
 	if (building) return;
-	verificationPromise ??= checkMigrations().catch((e: unknown) => {
-		verificationPromise = null;
-		throw e;
-	});
+	verificationPromise ??= checkMigrations().catch((e: unknown) => {});
 	return verificationPromise;
 }
killedBy: a database behind the code fails loudly with a 503 and logs the actionable counts
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/migrationGuard.ts:65:49
 	return verificationPromise;
 }
 
-async function checkMigrations(): Promise<void> {
-	const row = await db.get<{ n: number }>(sql`SELECT COUNT(*) AS n FROM __drizzle_migrations`);
-	const applied = row?.n ?? 0;
-	if (applied < expected) {
-		console.error(
-			`database schema is behind the deployed code: ${applied}/${expected} migrations applied — run npm run db:migrate (DEPLOY.md §1)`
-		);
-		throw error(503, 'the service is being upgraded — please retry in a few minutes');
-	}
-}
+async function checkMigrations(): Promise<void> {}
 
killedBy: a database behind the code fails loudly with a 503 and logs the actionable counts
statusReason: promise resolved "undefined" instead of rejecting

[Killed] OptionalChaining
src/lib/server/migrationGuard.ts:67:18
 
 async function checkMigrations(): Promise<void> {
 	const row = await db.get<{ n: number }>(sql`SELECT COUNT(*) AS n FROM __drizzle_migrations`);
-	const applied = row?.n ?? 0;
+	const applied = row.n ?? 0;
 	if (applied < expected) {
 		console.error(
killedBy: an empty migration count result reads as 0 applied, not a crash
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 503, …(1) }

[Killed] LogicalOperator
src/lib/server/migrationGuard.ts:67:18
 
 async function checkMigrations(): Promise<void> {
 	const row = await db.get<{ n: number }>(sql`SELECT COUNT(*) AS n FROM __drizzle_migrations`);
-	const applied = row?.n ?? 0;
+	const applied = row?.n && 0;
 	if (applied < expected) {
 		console.error(
killedBy: a current database passes, and the success is cached for the process
statusReason: promise rejected "HttpError{ status: 503, body: { …(1) } }" instead of resolving

[Killed] ConditionalExpression
src/lib/server/migrationGuard.ts:68:6
 async function checkMigrations(): Promise<void> {
 	const row = await db.get<{ n: number }>(sql`SELECT COUNT(*) AS n FROM __drizzle_migrations`);
 	const applied = row?.n ?? 0;
-	if (applied < expected) {
+	if (true) {
 		console.error(
 			`database schema is behind the deployed code: ${applied}/${expected} migrations applied — run npm run db:migrate (DEPLOY.md §1)`
killedBy: a current database passes, and the success is cached for the process
statusReason: promise rejected "HttpError{ status: 503, body: { …(1) } }" instead of resolving

[Killed] EqualityOperator
src/lib/server/migrationGuard.ts:68:6
 async function checkMigrations(): Promise<void> {
 	const row = await db.get<{ n: number }>(sql`SELECT COUNT(*) AS n FROM __drizzle_migrations`);
 	const applied = row?.n ?? 0;
-	if (applied < expected) {
+	if (applied >= expected) {
 		console.error(
 			`database schema is behind the deployed code: ${applied}/${expected} migrations applied — run npm run db:migrate (DEPLOY.md §1)`
killedBy: a current database passes, and the success is cached for the process
statusReason: promise rejected "HttpError{ status: 503, body: { …(1) } }" instead of resolving

[Killed] StringLiteral
src/lib/server/migrationGuard.ts:70:4
 	const applied = row?.n ?? 0;
 	if (applied < expected) {
 		console.error(
-			`database schema is behind the deployed code: ${applied}/${expected} migrations applied — run npm run db:migrate (DEPLOY.md §1)`
+			``
 		);
 		throw error(503, 'the service is being upgraded — please retry in a few minutes');
killedBy: a database behind the code fails loudly with a 503 and logs the actionable counts
statusReason: expected '' to contain '19/20'
