[Killed] ConditionalExpression
src/lib/server/openaiKey.ts:37:6
  * human review queue (I11).
  */
 export async function resolveOpenAiKey(orgId: string | null): Promise<string | undefined> {
-	if (!orgId) return env.OPENAI_API_KEY;
+	if (true) return env.OPENAI_API_KEY;
 	let enc: string | null | undefined;
 	try {
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] BooleanLiteral
src/lib/server/openaiKey.ts:37:6
  * human review queue (I11).
  */
 export async function resolveOpenAiKey(orgId: string | null): Promise<string | undefined> {
-	if (!orgId) return env.OPENAI_API_KEY;
+	if (orgId) return env.OPENAI_API_KEY;
 	let enc: string | null | undefined;
 	try {
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] BlockStatement
src/lib/server/openaiKey.ts:39:6
 export async function resolveOpenAiKey(orgId: string | null): Promise<string | undefined> {
 	if (!orgId) return env.OPENAI_API_KEY;
 	let enc: string | null | undefined;
-	try {
-		const row = await db
-			.select({ openaiKeyEnc: organizations.openaiKeyEnc })
-			.from(organizations)
-			.where(eq(organizations.id, orgId))
-			.get();
-		enc = row?.openaiKeyEnc;
-	} catch (error) {
+	try {} catch (error) {
 		// Loud fallback: a mid-run DB hiccup must neither abort the batch nor
 		// go unnoticed — degrade to the deployment key and log it.
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] ObjectLiteral
src/lib/server/openaiKey.ts:41:12
 	let enc: string | null | undefined;
 	try {
 		const row = await db
-			.select({ openaiKeyEnc: organizations.openaiKeyEnc })
+			.select({})
 			.from(organizations)
 			.where(eq(organizations.id, orgId))
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] OptionalChaining
src/lib/server/openaiKey.ts:45:9
 			.from(organizations)
 			.where(eq(organizations.id, orgId))
 			.get();
-		enc = row?.openaiKeyEnc;
+		enc = row.openaiKeyEnc;
 	} catch (error) {
 		// Loud fallback: a mid-run DB hiccup must neither abort the batch nor
killedBy: an unknown org uses the env key — quietly
statusReason: expected "error" to not be called at all, but actually been called 1 times

Received:

  1st error call:

    Array [
      "failed to read the stored OpenAI key — falling back to the deployment key",

[Killed] BlockStatement
src/lib/server/openaiKey.ts:46:18
 			.where(eq(organizations.id, orgId))
 			.get();
 		enc = row?.openaiKeyEnc;
-	} catch (error) {
-		// Loud fallback: a mid-run DB hiccup must neither abort the batch nor
-		// go unnoticed — degrade to the deployment key and log it.
-		console.error('failed to read the stored OpenAI key — falling back to the deployment key', { orgId, error });
-		return env.OPENAI_API_KEY;
-	}
+	} catch (error) {}
 	if (!enc) return env.OPENAI_API_KEY;
 	try {
killedBy: a database failure falls back to the env key and logs loudly instead of crashing the run
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BooleanLiteral
src/lib/server/openaiKey.ts:52:6
 		console.error('failed to read the stored OpenAI key — falling back to the deployment key', { orgId, error });
 		return env.OPENAI_API_KEY;
 	}
-	if (!enc) return env.OPENAI_API_KEY;
+	if (enc) return env.OPENAI_API_KEY;
 	try {
 		return decrypt(enc);
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] ConditionalExpression
src/lib/server/openaiKey.ts:52:6
 		console.error('failed to read the stored OpenAI key — falling back to the deployment key', { orgId, error });
 		return env.OPENAI_API_KEY;
 	}
-	if (!enc) return env.OPENAI_API_KEY;
+	if (true) return env.OPENAI_API_KEY;
 	try {
 		return decrypt(enc);
killedBy: a stored org key beats the env key
statusReason: expected 'env-openai-key' to be 'sk-org-key' // Object.is equality

[Killed] BlockStatement
src/lib/server/openaiKey.ts:53:6
 		return env.OPENAI_API_KEY;
 	}
 	if (!enc) return env.OPENAI_API_KEY;
-	try {
-		return decrypt(enc);
-	} catch (error) {
+	try {} catch (error) {
 		// Loud fallback: a corrupt stored key must not abort the run, but it
 		// must never be silent either.
killedBy: a stored org key beats the env key
statusReason: expected undefined to be 'sk-org-key' // Object.is equality

[Killed] BlockStatement
src/lib/server/openaiKey.ts:55:18
 	if (!enc) return env.OPENAI_API_KEY;
 	try {
 		return decrypt(enc);
-	} catch (error) {
-		// Loud fallback: a corrupt stored key must not abort the run, but it
-		// must never be silent either.
-		console.error('stored OpenAI key failed to decrypt — falling back to the deployment key', { orgId, error });
-		return env.OPENAI_API_KEY;
-	}
+	} catch (error) {}
 }
 
killedBy: corrupt ciphertext falls back to the env key and logs loudly
statusReason: expected undefined to be 'env-openai-key' // Object.is equality
