[Killed] BlockStatement
src/lib/server/ownership.ts:33:85
  * moderation work needs no role check beyond org membership (which
  * ownedChannel already enforces).
  */
-export function requireOrgRole(user: SessionUser, minimum: 'admin' | 'owner'): void {
-	requireRole(user.orgRole, minimum);
-}
+export function requireOrgRole(user: SessionUser, minimum: 'admin' | 'owner'): void {}
 
 /**
killedBy: rename: member is a raw 403; owner errors are wrapped as form failures
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/server/ownership.ts:43:93
  * out, 404 when the channel is missing or owned by another org (never leak
  * existence).
  */
-export async function ownedChannel(channelId: string, locals: { user: SessionUser | null }) {
-	const user = requireUser(locals);
-	const ch = await db
-		.select()
-		.from(channels)
-		.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
-		.get();
-	if (!ch) throw error(404, 'channel not found');
-	return ch;
-}
+export async function ownedChannel(channelId: string, locals: { user: SessionUser | null }) {}
 
killedBy: undo restores a rejected comment at YouTube and records the restore
statusReason: Cannot read properties of undefined (reading 'refreshTokenEnc')

[Killed] ConditionalExpression
src/lib/server/ownership.ts:50:6
 		.from(channels)
 		.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 		.get();
-	if (!ch) throw error(404, 'channel not found');
+	if (false) throw error(404, 'channel not found');
 	return ch;
 }
killedBy: undo on another team's channel 404s without leaking existence
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 404 }

[Killed] ConditionalExpression
src/lib/server/ownership.ts:50:6
 		.from(channels)
 		.where(and(eq(channels.id, channelId), eq(channels.orgId, user.orgId)))
 		.get();
-	if (!ch) throw error(404, 'channel not found');
+	if (true) throw error(404, 'channel not found');
 	return ch;
 }
killedBy: ownedChannel returns the channel for the user's org
statusReason: StrykerJS: Unknown test failure
