[Killed] BlockStatement
src/lib/server/testcookies.ts:24:31
 // themselves can use these without registering testdb's database mock.
 
 /** Minimal Cookies stand-in that records set/delete calls like SvelteKit's. */
-export function makeCookies() {
-	const store = new Map<string, string>();
-	const setCalls: Array<{ name: string; value: string; opts: Record<string, unknown> }> = [];
-	const deleteCalls: Array<{ name: string; opts: Record<string, unknown> | undefined }> = [];
-	return {
-		setCalls,
-		deleteCalls,
-		get: (name: string) => store.get(name),
-		set: (name: string, value: string, opts: Record<string, unknown>) => {
-			setCalls.push({ name, value, opts });
-			store.set(name, value);
-		},
-		delete: (name: string, opts?: Record<string, unknown>) => {
-			deleteCalls.push({ name, opts });
-			store.delete(name);
-		}
-	};
-}
+export function makeCookies() {}
 
 /** A cookie jar pre-seeded with pending OAuth states for callback tests. */
killedBy: login start sets an HttpOnly oauth_state cookie and redirects with identity scopes and matching state
statusReason: Invalid URL

[Killed] ArrowFunction
src/lib/server/testcookies.ts:31:8
 	return {
 		setCalls,
 		deleteCalls,
-		get: (name: string) => store.get(name),
+		get: () => undefined,
 		set: (name: string, value: string, opts: Record<string, unknown>) => {
 			setCalls.push({ name, value, opts });
killedBy: leave: missing cookie fails 401; sole member is a wrapped 400
statusReason: expected 401 to be 400 // Object.is equality

[Killed] BlockStatement
src/lib/server/testcookies.ts:32:72
 		setCalls,
 		deleteCalls,
 		get: (name: string) => store.get(name),
-		set: (name: string, value: string, opts: Record<string, unknown>) => {
-			setCalls.push({ name, value, opts });
-			store.set(name, value);
-		},
+		set: (name: string, value: string, opts: Record<string, unknown>) => {},
 		delete: (name: string, opts?: Record<string, unknown>) => {
 			deleteCalls.push({ name, opts });
killedBy: login start sets an HttpOnly oauth_state cookie and redirects with identity scopes and matching state
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/lib/server/testcookies.ts:36:61
 			setCalls.push({ name, value, opts });
 			store.set(name, value);
 		},
-		delete: (name: string, opts?: Record<string, unknown>) => {
-			deleteCalls.push({ name, opts });
-			store.delete(name);
-		}
+		delete: (name: string, opts?: Record<string, unknown>) => {}
 	};
 }
killedBy: callback with a new identity parks a pending consent and redirects to /consent without creating anything
statusReason: expected '["s"]' to be undefined

[Killed] BlockStatement
src/lib/server/testcookies.ts:44:59
 }
 
 /** A cookie jar pre-seeded with pending OAuth states for callback tests. */
-export function makeCookiesWithState(...states: string[]) {
-	const cookies = makeCookies();
-	cookies.set('oauth_state', JSON.stringify(states), { path: '/' });
-	return cookies;
-}
+export function makeCookiesWithState(...states: string[]) {}
 
killedBy: callback rejects a missing or mismatched state with 400
statusReason: expected TypeError: Cannot read properties of unde… to match object { status: 400, …(1) }

[Killed] StringLiteral
src/lib/server/testcookies.ts:46:14
 /** A cookie jar pre-seeded with pending OAuth states for callback tests. */
 export function makeCookiesWithState(...states: string[]) {
 	const cookies = makeCookies();
-	cookies.set('oauth_state', JSON.stringify(states), { path: '/' });
+	cookies.set("", JSON.stringify(states), { path: '/' });
 	return cookies;
 }
killedBy: callback errors never leak tokens to client or logs ('failed token exchange')
statusReason: expected 400 to be 502 // Object.is equality
