[Killed] BlockStatement
(app)/org/switch/+server.ts:27:77
 import type { RequestHandler } from './$types';
 
 // Nav team switcher target. 303 back to the dashboard so the POST is never replayed.
-export const POST: RequestHandler = async ({ request, locals, cookies }) => {
-	const user = requireUser(locals);
-	const token = cookies.get(SESSION_COOKIE);
-	if (!token) throw error(401, 'sign-in required');
-	const form = await request.formData();
-	const orgId = String(form.get('orgId') ?? '');
-	if (!orgId) throw error(400, 'missing team');
-	await switchActiveOrg(user.id, token, orgId);
-	throw redirect(303, '/dashboard');
-};
+export const POST: RequestHandler = async ({ request, locals, cookies }) => {};
 
killedBy: rejects signed-out callers and missing session cookies with 401
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
(app)/org/switch/+server.ts:30:6
 export const POST: RequestHandler = async ({ request, locals, cookies }) => {
 	const user = requireUser(locals);
 	const token = cookies.get(SESSION_COOKIE);
-	if (!token) throw error(401, 'sign-in required');
+	if (token) throw error(401, 'sign-in required');
 	const form = await request.formData();
 	const orgId = String(form.get('orgId') ?? '');
killedBy: rejects signed-out callers and missing session cookies with 401
statusReason: expected Error: Failed query: update "sessions" se… { …(2) } to match object { status: 401, …(1) }
(3 matching properties omitted from actual)

[Killed] LogicalOperator
(app)/org/switch/+server.ts:32:23
 	const token = cookies.get(SESSION_COOKIE);
 	if (!token) throw error(401, 'sign-in required');
 	const form = await request.formData();
-	const orgId = String(form.get('orgId') ?? '');
+	const orgId = String(form.get('orgId') && '');
 	if (!orgId) throw error(400, 'missing team');
 	await switchActiveOrg(user.id, token, orgId);
killedBy: rejects a missing orgId with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] ConditionalExpression
(app)/org/switch/+server.ts:33:6
 	if (!token) throw error(401, 'sign-in required');
 	const form = await request.formData();
 	const orgId = String(form.get('orgId') ?? '');
-	if (!orgId) throw error(400, 'missing team');
+	if (true) throw error(400, 'missing team');
 	await switchActiveOrg(user.id, token, orgId);
 	throw redirect(303, '/dashboard');
killedBy: switching to an org the user does not belong to is 404
statusReason: expected { Object (status, body) } to match object { status: 404 }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
(app)/org/switch/+server.ts:33:6
 	if (!token) throw error(401, 'sign-in required');
 	const form = await request.formData();
 	const orgId = String(form.get('orgId') ?? '');
-	if (!orgId) throw error(400, 'missing team');
+	if (false) throw error(400, 'missing team');
 	await switchActiveOrg(user.id, token, orgId);
 	throw redirect(303, '/dashboard');
killedBy: rejects a missing orgId with 400
statusReason: expected { Object (status, body) } to match object { status: 400, …(1) }

[Killed] StringLiteral
(app)/org/switch/+server.ts:35:22
 	const orgId = String(form.get('orgId') ?? '');
 	if (!orgId) throw error(400, 'missing team');
 	await switchActiveOrg(user.id, token, orgId);
-	throw redirect(303, '/dashboard');
+	throw redirect(303, "");
 };
 
killedBy: a member switch updates sessions.active_org_id and 303s to the dashboard
statusReason: expected Redirect{ status: 303, location: '' } to match object { status: 303, location: '/dashboard' }
