[Killed] BlockStatement
routes/api/health/+server.ts:26:48
 // Uptime probe target (issue #82): unauthenticated by design so an external
 // monitor can detect a Turso outage without credentials. Loud on the server,
 // generic to the client — the driver error never crosses the boundary.
-export const GET: RequestHandler = async () => {
-	try {
-		await db.get(sql`SELECT 1`);
-	} catch (e) {
-		console.error('health check database query failed:', e);
-		throw error(503, 'the service is temporarily unavailable — please retry shortly');
-	}
-	return json({ status: 'ok' });
-};
+export const GET: RequestHandler = async () => {};
 
killedBy: a healthy database answers 200 with a bare ok status
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
routes/api/health/+server.ts:27:6
 // monitor can detect a Turso outage without credentials. Loud on the server,
 // generic to the client — the driver error never crosses the boundary.
 export const GET: RequestHandler = async () => {
-	try {
-		await db.get(sql`SELECT 1`);
-	} catch (e) {
+	try {} catch (e) {
 		console.error('health check database query failed:', e);
 		throw error(503, 'the service is temporarily unavailable — please retry shortly');
killedBy: a database failure answers 503 with a generic body and logs the real error server-side

[Killed] BlockStatement
routes/api/health/+server.ts:29:14
 export const GET: RequestHandler = async () => {
 	try {
 		await db.get(sql`SELECT 1`);
-	} catch (e) {
-		console.error('health check database query failed:', e);
-		throw error(503, 'the service is temporarily unavailable — please retry shortly');
-	}
+	} catch (e) {}
 	return json({ status: 'ok' });
 };
killedBy: a database failure answers 503 with a generic body and logs the real error server-side

[Killed] StringLiteral
routes/api/health/+server.ts:30:17
 	try {
 		await db.get(sql`SELECT 1`);
 	} catch (e) {
-		console.error('health check database query failed:', e);
+		console.error("", e);
 		throw error(503, 'the service is temporarily unavailable — please retry shortly');
 	}
killedBy: a database failure answers 503 with a generic body and logs the real error server-side
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received:

  1st error call:

  [
-   "health check database query failed:",

[Killed] StringLiteral
routes/api/health/+server.ts:33:24
 		console.error('health check database query failed:', e);
 		throw error(503, 'the service is temporarily unavailable — please retry shortly');
 	}
-	return json({ status: 'ok' });
+	return json({ status: "" });
 };
 
killedBy: a healthy database answers 200 with a bare ok status
statusReason: expected { status: '' } to deeply equal { status: 'ok' }

[Killed] ObjectLiteral
routes/api/health/+server.ts:33:14
 		console.error('health check database query failed:', e);
 		throw error(503, 'the service is temporarily unavailable — please retry shortly');
 	}
-	return json({ status: 'ok' });
+	return json({});
 };
 
killedBy: a healthy database answers 200 with a bare ok status
statusReason: expected {} to deeply equal { status: 'ok' }
